Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/other-resources/trac.po
Languages: fr, pt_br

source: TRAC review tool
fr: Outil de révision TRAC
pt_br: Ferramenta de revisão TRAC

source: The Trustworthy Repositories Audit & Certification (TRAC) review tool is a Drupal implementation of the TRAC checklist, an auditing tool to assess the reliability, commitment and readiness of institutions to assume long-term preservation responsibilities.
pt_br: A ferramenta de revisão Trustworthy Repositories Audit & Certification (TRAC) é uma implementação do Drupal da lista de verificação TRAC, uma ferramenta de auditoria para avaliar a confiabilidade, comprometimento e prontidão de instituições em assumir responsabilidades de preservação a longo prazo.

source: The review tool was developed by MIT in a project led by Nancy McGovern, Head of `Curation and Preservation Services`_ at MIT Libraries. Artefactual has permission to host this tool for community use. The copy provided here contains data about the TRAC requirements that Archivematica fulfills for the repository.
pt_br: A ferramenta de revisão foi desenvolvida pelo MIT em um projeto liderado por Nancy McGovern, Diretora do `Curation and Preservation Services`_ nas bibliotecas do MIT. A Artefactual tem permissão de hospedar esta ferramenta para uso da comunidade. A cópia fornecida aqui contém dados sobre os requisitos do TRAC que o Archivematica atende para o repositório.

source: Installation
pt_br: Instalação

source: Download link: https://www.archivematica.org/download/trac.tar.gz
fr: Lien de téléchargement : https://www.archivematica.org/download/trac.tar.gz
pt_br: Link para download: https://www.archivematica.org/download/trac.tar.gz

source: Instructions for installation:
fr: Instructions d'installation :
pt_br: Instruções para a instalação:

source: Be sure to consult the README.txt and README_TRAC.txt files in the tarball prior to installation.
fr: Assurez vous de consulter les fichiers README.txt et README_TRAC.txt avant de procéder à l'installation.
pt_br: Certifique-se de consultar os arquivos README.txt e README_TRAC.txt no tarball antes da instalação.

source: Summary
fr: Résumé
pt_br: Resumo

source: The following text is slightly edited from the home page of the Drupal TRAC Review site.
fr: Le texte qui suit est une version quelque peu remaniée de la page d'accueil du site de révision TRAC Drupal.
pt_br: O seguinte texto é ligeiramente editado a partir da home page do site Drupal TRAC Review.

source: The home page of the site provides an overview of an organization's efforts to document its evidence for meeting the requirements of the CCSDS Audit and Certification of Trustworthy Digital Repositories `checklist`_ that was approved as ISO 16363 and is based on Trustworthy Repositories Audit and Certification (TRAC): Criteria and Checklist that was released in January 2007. A TRAC review is a self-assessment method for an organization to demonstrate good practice and conformance as a trusted digital repository to its designated communities and prepare for a peer review or other external audit. In many organizations, responsibilities for TRAC compliance are distributed throughout the organization, with specific units and committees having certain responsibilities for each requirement.
pt_br: A página inicial do site fornece uma visão geral dos esforços de uma organização para documentar suas evidências para atender requisitos do CCSDS Audit and Certification of Trustworthy Digital Repositories `checklist`_ que foram aprovadas como a ISO 16363 e foi baseado no Trustworthy Repositories Audit and Certification (TRAC): Criteria and Checklist que foi lançado em janeiro de 2007. Uma revisão TRAC é um método de auto-avaliação para uma organização demonstrar boas práticas e conformidade como repositório digital confiável para suas comunidades designadas e preparar-se para uma revisão por seus pares ou outra auditoria externa. em muitas organizações, as responsabilidades pelo atendimento ao TRAC são distribuídas pela organização, com unidades e comitês específicos tendo certas responsabilidades por cada requisito.

source: Responsibilities
fr: Responsabilités
pt_br: Responsabilidades

source: Each entity is assigned a role for each requirement using the RACI responsibility assignment `matrix`_.
pt_br: A cada entidade é designada uma função para cada requisito usando a `matriz de definição de responsabilidades RACI`_.

source: The RACI Matrix describes participation by various organizational roles in completing tasks for a project. RACI is especially useful in clarifying roles in projects and processes requiring distributed responsibilities. See the Responsibilities for TRAC page of the Drupal site for more information on RACI responsibilities, and a listing of units and committees that have roles in TRAC conformance.
pt_br: A Matriz RACI descreve a participação de várias funções organizacionais em completar tarefas para um projeto. O RACI é especialmente útil em esclarecer funções em projetos e processos que requerem responsabilidades distribuídas. Consulte a página de Responsabilidades pelo TRAC do site do Drupal para maiores informações sobre responsabilidades RACI, e uma lista de unidades e comitês que têm funções conforme a TRAC.

source: In each requirement where Archivematica provides all or part of the evidence, the Operations Group is identified as one of the Responsible parties. Other organizational roles indicated are simply suggestions.
fr: Pour chaque exigence, Archivematica fournit toutes ou une partie des preuves, le groupe des opérations est identifié comme une des parties responsables. Les autres rôles organisationnels indiqués ne sont que des suggestions.
pt_br: Em cada requisito em que o Archivematica fornece toda ou parte da evidência, o Grupo de Operações é identificado como uma das partes responsáveis. Outras funções organizacionais indicadas são simplesmente sugestões.

source: Requirements
fr: Exigences
pt_br: Requisitos

source: In the site, each TRAC requirement has its own page. Sub- and Sub-sub requirements are referred to on the relevant high-level requirement page. Current compliance with TRAC requirements is assessed on a rating system from 0 to 4 (see example: `SGDS report`_, page 14):
pt_br: No site, cada requisito TRAC tem sua própria página.. Sub- e Sub-sub requisitos são citados na página de requisitos de alto nível relevantes. A conformidade atual com os requisitos do TRAC é avaliada em um sistema de avaliação de 0 a 4 (consulte o exemplo: `SGDS report`_, page 14):

source: 4 = fully compliant - the repository can demonstrate that has comprehensively addressed the requirement
fr: 4 = complètement conforme - le dépôt est en mesure de démontrer qu'il répond de façon exhaustive à l'exigence
pt_br: 4 = totalmente compatível - o repositório pode demonstrar que abordou de forma abrangente o requisito

source: 3 = mostly compliant - the repository can demonstrate that it has mostly addressed the requirement and is on working on full compliance
fr: 3 = généralement conforme - le dépôt est en mesure de démontrer qu'il répond à l'exigence en grande partie et continue le processus afin de devenir complètement conforme
pt_br: 3 = principalmente compatível - o repositório pode demonstrar que abordou principalmente o requisito e está trabalhando em conformidade total

source: 2 = half compliant - the repository has partially addressed the requirement and has significant work remaining to fully address the requirement
fr: 2 = à demi conforme - le dépôt répond partiellement à l'exigence et doit faire un travail considérable avant de répondre pleinement à l'exigence
pt_br: 2 = meio compatível - o repositório abordou parcialmente o requisito e tem um trabalho significativo remanescente para atender ao requisito

source: 1 = slightly compliant - the repository has something in place, but has a lot of work to do in addressing the requirement
fr: 1 = partiellement conforme - le dépôt a quelque chose en place, mais beaucoup de travail reste à faire afin de répondre à l'exigence
pt_br: 1 = um pouco compatível - o repositório tem algo em funcionamento, mas tem muito trabalho a fazer para atender ao requisito

source: 0 = non-compliant or not started - the repository has not yet addressed the requirement or has not started the review of the requirement
fr: 0 = non-conforme ou le travail n'a pas commencé -- le dépôt n'a pas encore pris en compte l'exigence ou n'a pas débuté la revue de l'exigence
pt_br: 0 = não compatível ou não iniciado - o repositório ainda não abordou o requisito ou não iniciou a revisão do requisito

source: Any group in the organization that is involved in defining policy and practice should update the status of relevant requirements. When listing evidence, please include sufficient information for reviewers to get to the cited evidence (e.g., a document title, date, a link) and note the name of the group or department that is adding an entry to the evidence addressing the requirement along with the date of the annotations (e.g., [Right Management group, 2/13/2013]). (Note that for requirements where Archivematica provides all or part of the evidence, no date or group is specified as this evidence must be reviewed and assigned a responsible group per repository) For additional guidance, please see the Responsibilities for TRAC page of the site.
fr: Tout groupe de l'organisation, impliqué dans la définition des politiques et pratiques, doit mettre à jour le statut des exigences pertinentes. Lorsque l'on établit la liste des éléments probants, il faut inclure suffisamment de renseignements pour les réviseurs afin qu'ils puissent accéder à l'élément identifié (p. ex., titre du document, date, lien) et il faut inscrire le nom du groupe ou du service qui ajoute une entrée à l'élément probant concernant l'exigence avec la date des annotations (p. ex., [Groupe de gestion des droits, 13/02/2013]). (Notez que pour certaines exigences, notamment lorsque Archivematica fournit en tout ou en partie l'élément probant, aucune date ou groupe n'est spécifié puisque cet élément doit être revu et attribué à un groupe responsable pour chaque dépôt.) Pour un suivi additionnel, voir la page des Responsabilités du TRAC sur le site.
pt_br: Qualquer grupo da organização envolvido na definição de políticas e práticas deve atualizar o status dos requisitos relevantes. Ao listar evidências, inclua informações suficientes para que os revisores acessem as evidências citadas (por exemplo, um título de documento, data, um link) e anote o nome do grupo ou departamento que está adicionando uma entrada à evidência que trata do requisito junto com a data das anotações (por exemplo, [Right Management group, 2/13/2013]). (Observe que, para os requisitos em que o Archivematica fornece toda ou parte da evidência, nenhuma data ou grupo é especificado, pois essa evidência deve ser revisada e atribuída a um grupo responsável por repositório) Para obter orientações adicionais, consulte a página Responsabilidades do TRAC no site.

source: The site provides a sequence of status levels for each requirement:
fr: Le site fournit une séquence des différents niveaux de statuts pour chaque exigence:
pt_br: O site fornece uma sequência de níveis de status para cada requisito:

source: Accepted – the evidence provided has been accepted as sufficient for this review round
fr: Accepté - l'élément probant présenté a été accepté comme suffisant pour cette partie de la revue
pt_br: Aceito - as evidências fornecidas foram aceitas como suficientes para esta rodada de revisão

source: Ready for review – the Responsible group has completed its work and the evidence is ready for review
fr: Prêt pour une révision - le groupe responsable a complété son travail et l'élément probant est prêt pour une revue
pt_br: Pronto para revisão - o grupo responsável concluiu seu trabalho e as evidências estão prontas para revisão

source: In progress – the Responsible group is in the process of compiling or generating relevant evidence
fr: En cours - le groupe responsable est en train de compiler ou d'établir l'élément probant pertinent
pt_br: Em andamento - o grupo Responsável está no processo de compilar ou gerar evidências relevantes

source: Not started – no evidence or information has been provided yet
fr: Pas commencé - aucun élément probant ou renseignement n'a été présenté jusqu'ici
pt_br: Não iniciado - nenhuma evidência ou informação foi fornecida ainda

source: For requirements where Archivematica provides all or part of the evidence, the status is indicated as In Progress as it should still be reviewed, edited, and/or completed by the repository.
fr: En ce qui concerne des exigences pour lesquelles Archivematica fournit en tout ou en partie les éléments probants, le statut est indiqué comme étant En cours puisqu’il devra quand même faire l’objet de révision, d’édition ou devra être complété par les responsables du dépôt.
pt_br: Para requisitos em que o Archivematica fornece toda ou parte da evidência, o status é indicado como Em andamento, uma vez que ainda deve ser revisado, editado e / ou concluído pelo repositório.

source: Support
fr: Soutien
pt_br: Suporte

source: Artefactual will not be providing free support for this tool. However, we encourage users to discuss it using our `public discussion list`_.
pt_br: A Artefactual não fornecerá suporte gratuito para esta ferramenta. Entretanto, encorajamos os usuários a discuti-la usando nossa `lista pública de discussão`_.

source: If you have questions about an internal review that are unrelated to this tool, contact the `NDSA Standards and Practices Working Group`_.
pt_br: Se você tem perguntas sobre uma revisão interna que não estejam relacionadas a esta ferramenta, entre com contato com o `NDSA Standards and Practices Working Group`_.

source: Thanks
fr: Merci
pt_br: Obrigado

source: Artefactual is grateful to Nancy McGovern and Matt Bernhardt of MIT for their work towards the development of this tool and for allowing us to host it for community consumption here on the Archivematica website.
fr: Artefactual tient à remercier Nancy McGovern et Matt Bernhardt du MIT pour leur travail tout au long du développement de cet outil ainsi que nous avoir permis de l'héberger sur le site Web d'Archivematica, afin de le rendre accessible à la communauté.
pt_br: A Artefactual é grata a Nancy McGovern e Matt Bernhardt, do MIT, por seu trabalho para o desenvolvimento desta ferramenta e por nos permitir hospedá-la para consumo comunitário aqui no site Archivematica.

source: :ref:`Back to the top <trac>`
fr: :ref:`Retour en haut de page <trac>`
pt_br: :ref:`Voltar ao topo <trac>`

source: Status
fr: Statut
