Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fr, pt_br

source: Archivematica documentation
fr: Documentation Archivematica
pt_br: Documentação do Archivematica

source: Getting started
fr: Commencer
pt_br: Primeiros passos

source: The getting started manual is intended for users who are considering implementing Archivematica as a digital preservation solution. This manual includes information on the Archivematica project as well as a quick-start guide to help new users test it out. For information about installing and using Archivematica in a production environment, see the user or administrator manuals below.
fr: Le manuel de démarrage s'adresse aux utilisateurs qui envisagent d'implémenter Archivematica en tant que solution de préservation numérique. Ce manuel contient des informations sur le projet Archivematica ainsi qu'un guide de démarrage rapide pour aider les nouveaux utilisateurs à le tester. Pour plus d'informations sur l'installation et l'utilisation d'Archivematica dans un environnement de production, consultez les manuels de l'utilisateur ou de l'administrateur ci-dessous.
pt_br: O manual de primeiros passos é destinado a usuários que estão considerando implementar o Archivematica como uma solução de preservação digital. Este manual inclui informações sobre o projeto Archivematica, bem como um guia de início rápido para ajudar novos usuários a testá-lo. Para informações sobre a instalação e uso do Archivematica em um ambiente de produção, consulte os manuais do usuário ou do administrador abaixo.

source: Overview
fr: Aperçu
pt_br: Visão geral

source: The overview section provides a definition of Archivematica and a description of the OAIS model on which it is based, its technical architecture, the microservices framework, and information about system requirements for deploying Archivematica.
fr: La section Aperçu vous présente une définition d'Archivematica et une description du modèle OAIS sur lequel il est basé, son architecture technique, la structure de ses microservices, ainsi que de l’information sur les exigences système requises pour le déploiement d'Archivematica.
pt_br: A seção de visão geral fornece uma definição do Archivematica e uma descrição do modelo OAIS, no qual ele foi baseado, sua arquitetura, o esquema de microsserviços e informações sobre requisitos de sistema para implementar o Archivematica.

source: :ref:`What is Archivematica? <intro>`
fr: :ref:`Qu'est ce qu'Archivematica? <intro>`
pt_br: :ref:`O que é o Archivematica? <intro>`

source: :ref:`Web-based dashboard <web-dashboard>`
fr: :ref:`Tableau de bord en ligne <web-dashboard>`
pt_br: :ref:`Dashboard baseado na web<web-dashboard>`

source: :ref:`Technical architecture <technical-arch>`
fr: :ref:`Architecture technique <technical-arch>`
pt_br: :ref:`Arquitetura técnica <technical-arch>`

source: :ref:`Micro-services <micro-services>`
pt_br: :ref:`Microsserviços <micro-services>`

source: :ref:`System requirements <system-requirements>`
fr: :ref:`Configuration requise <system-requirements>`
pt_br: :ref:`Requisitos de sistema <system-requirements>`

source: Quick-start guide
fr: Guide de démarrage rapide
pt_br: Guia de início rápido

source: This section is intended to introduce prospective users to Archivematica for testing purposes, using either the Archivematica sandbox or a local virtual machine. This is not a guide to installing Archivematica for development or production - please see the :ref:`Administrator manual <admin-manual-home>` for full installation instructions.
fr: Cette section a pour but de présenter Archivematica à des utilisateurs potentiels à des fins d’essai, en utilisant le bac à sable Archivematica ou une machine virtuelle locale. Cette section n'est donc pas un guide d'installation d'Archivematica pour le développement ou la production – pour ce faire, veuillez consulter le :ref:`manuel de l'administrateur <admin-manual-home>` pour les instructions d'installation complètes.
pt_br: Esta seção é destinada a introduzir prováveis usuários ao Archivematica para propósitos de teste, usando a sandbox do Archivematica ou uma máquina virtual local. Não é um guia de instalação do Archivematica para desenvolvimento ou produção - por favor, consulte o :ref:`Manual do administrador <admin-manual-home>` para instruções completas de instalação.

source: :ref:`Archivematica quick-start guide <quick-start>`
fr: :ref:`Guide de démarrage rapide Archivematica <quick-start>`
pt_br: :ref:`Guia de início rápido do Archivematica <quick-start>`

source: :ref:`Configuration <configuration>`
pt_br: :ref:`Configuração <configuration>`

source: Troubleshooting
fr: Dépannage
pt_br: Solução de problemas

source: The troubleshooting section contains information on how Archivematica handles errors, as well as how to report errors
fr: La section de dépannage contient des informations sur la façon dont Archivematica traite les erreurs, ainsi que sur la façon de signaler les erreurs
pt_br: A seção de solução de problemas contém informações sobre como o Archivematica trata erros, bem como a forma de relatar erros.

source: :ref:`Error handling <error-handling>`
fr: :ref:`Gestion d'erreur <error-handling>`
pt_br: :ref:`Tratativa de erros <error-handling>`

source: :ref:`Error reporting <error-reporting>`
fr: :ref:`Signaler une erreur <error-reporting>`
pt_br: :ref:`Relatório de Erros <error-reporting>`

source: Other resources
fr: Autres ressources
pt_br: Outros recursos

source: :ref:`TRAC review tool <trac>`
fr: :ref:`Outil de révision TRAC <trac>`
pt_br: :ref:`Ferramenta de revisão TRAC <trac>`

source: User manual
fr: Guide de l'utilisateur
pt_br: Manual do usuário

source: The user manual is intended for archivists, librarians, and other users who interact with Archivematica through the web-based user interface. The user manual is organized based on the tabs in the Archivematica UI.
fr: Le guide de l'utilisateur est destiné aux archivistes, bibliothécaires et autres utilisateurs qui interagissent avec Archivematica via l'interface de l'utilisateur en ligne. Le guide de l'utilisateur est organisé en fonction des onglets de l'interface de l'utilisateur Archivematica.
pt_br: O manual do usuário é destinado a arquivistas, bibliotecários e outros usuários que interagem com o Archivematica através de sua interface baseada na web. O manual do usuário está organizado baseado nas telas da interface de usuário do Archivematica.

source: Transfer
fr: Transfert
pt_br: Transferência

source: The Transfer tab is the place where an Archivematica transfer begins. Along with the transfer widget, this tab displays micro-services and jobs that act upon content to prepare your transfer to become a SIP (submission information package).
fr: L'onglet Transfert est l'endroit où débute les transferts avec Archivematica. Avec le widget de transfert, cet onglet affiche les microservices et les tâches qui agissent sur le contenu afin de préparer votre transfert pour devenir un SIP (paquet d'information à verser ou submission information package).
pt_br: A janela Transferência é o local onde uma transferência do Archivematica começa. Junto com a ferramenta de transferência, esta janela exibe microsserviços e tarefas que atuam sobre o conteúdo para preparar sua transferência para se tornar um SIP (submission information package).

source: :ref:`General description <transfer>`
fr: :ref:`Description générale <transfer>`
pt_br: :ref:`Descrição geral <transfer>`

source: :ref:`Create a transfer <create-transfer>`
fr: :ref:`Créer un transfert <create-transfer>`
pt_br: :ref:`Criar uma transferência <create-transfer>`

source: :ref:`Create a transfer with submission documentation <create-submission>`
fr: :ref:`Joindre la documentation de soumission à un transfert <create-submission>`
pt_br: :ref:`Criar uma transferência com documentação de submissão <create-submission>`

source: :ref:`Create a transfer with existing checksums <transfer-checksums>`
fr: :ref:`Créer un transfert avec une somme de contrôle existante <transfer-checksums>`
pt_br: :ref:`Criar uma transferência com checksums existentes <transfer-checksums>`

source: :ref:`Process the transfer <process-transfer>`
fr: :ref:`Traiter un transfert <process-transfer>`
pt_br: :ref:`Processar a transferência <process-transfer>`

source: :ref:`Extract packages <extract-packages>`
fr: :ref:`Extraire les paquets <extract-packages>`
pt_br: :ref:`Extrair pacotes <extract-packages>`

source: :ref:`Import metadata <import-metadata>`
fr: :ref:`Importer des métadonnées <import-metadata>`
pt_br: :ref:`Importar metadados <import-metadata>`

source: :ref:`Manage a backlog <manage-backlog>`
fr: :ref:`Gérer un backlog <manage-backlog>`
pt_br: :ref:`Gerenciar um backlog <manage-backlog>`

source: :ref:`Bags (Library of Congress Bagit format) <bags>`
fr: :ref:`Bags (Format BagIt de la Library of Congress) <bags>`
pt_br: :ref:`Bags (formato Bagit da Library of Congress) <bags>`

source: :ref:`Digitized files <digitized>`
fr: :ref:`Fichiers numérisés <digitized>`
pt_br: :ref:`Arquivos digitalizados <digitized>`

source: :ref:`Forensic images <forensic>`
fr: :ref:`Image disque d'investigation <forensic>`
pt_br: :ref:`Imagens forenses <forensic>`

source: :ref:`DSpace exports <dspace>`
fr: :ref:`Transferts DSpace <dspace>`
pt_br: :ref:`Exportações do DSpace <dspace>`

source: :ref:`ContentDM (transfer and ingest) <contentdm>`
fr: :ref:`ContentDM (transfert et acquisition) <contentdm>`
pt_br: :ref:`ContentDM (transferência e admissão) <contentdm>`

source: :ref:`Scan for viruses <scan-for-viruses>`
pt_br: :ref:`Escaneamento por vírus <scan-for-viruses>`

source: The Backlog tab displays content that has been added to the Archivematica backlog and allows users to search, download and delete transfers from the backlog location.
fr: L'onglet Backlog affiche le contenu qui a été ajouté au backlog Archivematica et permet aux utilisateurs de faire des recherche, télécharger et supprimer des transferts à partir de l'emplacement du backlog.
pt_br: A janela Backlog exibe o conteúdo que foi adicionado ao backlog do Archivematica e permite aos usuários buscar, fazer download e apagar transferências do local de backlog.

source: :ref:`General description <backlog>`
fr: :ref:`Description générale <backlog>`
pt_br: :ref:`Descrição geral <backlog>`

source: :ref:`Searching for transfers <backlog-transfer-search>`
fr: :ref:`Recherche de transferts <backlog-transfer-search>`
pt_br: :ref:`Busca de transferências <backlog-transfer-search>`

source: :ref:`Searching for files <backlog-file-search>`
fr: :ref:`Recherche de fichiers <backlog-file-search>`
pt_br: :ref:`Busca por arquivos <backlog-file-search>`

source: :ref:`Downloading transfers or files <backlog-download>`
fr: :ref:`Téléchargement de transferts ou fichiers <backlog-download>`
pt_br: :ref:`Fazer download de transferências ou arquivos <backlog-download>`

source: :ref:`Deletion of transfers <backlog-delete>`
fr: :ref:`Supprimer des transferts <backlog-delete>`
pt_br: :ref:`Apagar transferências <backlog-delete>`

source: Appraisal
fr: Évaluation
pt_br: Avaliação

source: The Appraisal and Arrangement tab is used to analyze and arrange material which has been placed in backlog. It can also be used to arrange materials directly to resources in ArchivesSpace.
fr: L'onglet Évaluation et Classement est utilisé pour analyser et classer le matériel qui a été placé dans le backlog. Il peut également être utilisé pour classer le matériel directement aux ressources d’ArchivesSpace.
pt_br: A janela Avaliação e Arranjo é usada para analisar e fazer o arranjo de material que foi colocado no backlog. Também pode ser usada para fazer o arranjo de materiais diretamente para os recursos no ArchivesSpace.

source: :ref:`General description <appraisal>`
fr: :ref:`Description générale <appraisal>`
pt_br: :ref:`Descrição geral <appraisal>`

source: :ref:`Transfers in the Backlog <backlog_pane>`
fr: :ref:`Transferts dans Backlog <backlog_pane>`
pt_br: :ref:`Transferências no Backlog <backlog_pane>`

source: :ref:`Analysis <analysis_pane>`
fr: :ref:`Analyse <analysis_pane>`
pt_br: :ref:`Análise <analysis_pane>`

source: :ref:`File List <File_list_pane>`
fr: :ref:`Liste de fichiers <File_list_pane>`
pt_br: :ref:`Lista de Arquivos <File_list_pane>`

source: :ref:`ArchivesSpace Resources <archivesspace_pane>`
fr: :ref:`Ressources ArchivesSpace <archivesspace_pane>`
pt_br: :ref:`Recursos do ArchivesSpace <archivesspace_pane>`

source: :ref:`Adding Files to ArchivesSpace Resources and Starting SIPs <adding_files_archivesspace>`
fr: :ref:`Ajouter des fichiers dans Ressources ArchiveSpace et lancer un SIP <adding_files_archivesspace>`
pt_br: :ref:`Adicionar Arquivos ao Recursos do ArchivesSpace e Iniciar SIPs <adding_files_archivesspace>`

source: :ref:`Arrangement <arrangement>`
fr: :ref:`Classement <arrangement>`
pt_br: :ref:`Arranjo <arrangement>`

source: Ingest
fr: Acquisition
pt_br: Admissão

source: The Ingest tab displays the micro-services and jobs that take place to turn a SIP into an AIP or a DIP. This tab also contains the backlog widget.
fr: L'onglet Acquisition affiche les microservices et les tâches qui ont lieu lors de la transformation d’un SIP en AIP ou en DIP. Cet onglet contient également le widget backlog.
pt_br: A janela Admissão exibe os microsserviços e tarefas executadas para transformar um SIP em um AIP ou em um DIP. Esta janela também contém a ferramenta backlog.

source: :ref:`General description <ingest>`
fr: :ref:`Description générale <ingest>`
pt_br: :ref:`Descrição geral <ingest>`

source: :ref:`Create a SIP <create-sip>`
fr: :ref:`Créer un SIP <create-sip>`
pt_br: :ref:`Criar um SIP <create-sip>`

source: :ref:`Arrange a SIP from backlog <arrange-sip>`
fr: :ref:`Classer un SIP à partir du backlog <arrange-sip>`
pt_br: :ref:`Fazer o arranjo de um SIP no backlog <arrange-sip>`

source: :ref:`Add metadata <add-metadata>`
fr: :ref:`Ajouter des métadonnées <add-metadata>`
pt_br: :ref:`Adicionar metadados <add-metadata>`

source: :ref:`Add PREMIS rights <add-rights>`
fr: :ref:`Ajouter des privilèges PREMIS <add-rights>`
pt_br: :ref:`Adicionar rights do PREMIS<add-rights>`

source: :ref:`Normalize <normalize>`
fr: :ref:`Normaliser <normalize>`
pt_br: :ref:`Normalizar <normalize>`

source: :ref:`Store the AIP <store-aip>`
fr: :ref:`Stocker l’AIP <store-aip>`
pt_br: :ref:`Armazenar o AIP <store-aip>`

source: :ref:`Reingest AIP <reingest>`
fr: :ref:`Réacquistion de l’AIP <reingest>`
pt_br: :ref:`Readmitir o AIP <reingest>`

source: :ref:`Upload DIP to ArchivesSpace <upload-AS>`
fr: :ref:`Télécharger le DIP dans ArchivesSpace <upload-as>`
pt_br: :ref:`Fazer upload do DIP no ArchivesSpace <upload-AS>`

source: :ref:`Upload DIP to Archivists Toolkit <upload-AT>`
fr: :ref:`Télécharger le DIP dans Archivists' Toolkit <upload-at>`
pt_br: :ref:`Fazer upload do DIP no Archivists Toolkit <upload-AT>`

source: :ref:`Manual normalization <manual-norm>`
fr: :ref:`Normalisation manuelle <manual-norm>`
pt_br: :ref:`Normalização manual <manual-norm>`

source: Archival Storage
fr: Dossier de stockage des archives
pt_br: Armazenamento Arquivístico

source: The Archival Storage tab displays AIPs that have been processed by the Archivematica pipeline and related metadata such as size of AIP, UUID and date stored.
fr: L'onglet Dossier de stockage des archives affiche les AIP qui ont été traités par le pipeline Archivematica et les métadonnées associées, telles que la taille de l'AIP, l'UUID et la date de stockage.
pt_br: A janela Archival Storage exibe os AIPs que foram processados pela pipeline do Archivematica e metadados relacionados tais como tamanho do AIP, UUID e data de armazenamento.

source: :ref:`Storing an AIP <storing-aip>`
fr: :ref:`Stocker un AIP <storing-aip>`
pt_br: :ref:`Armazenar um AIP <storing-aip>`

source: :ref:`Searching the AIP store <search-aip>`
fr: :ref:`Faire une recherche dans le aip-store <search-aip>`
pt_br: :ref:`Buscar no armazenamento de AIP <search-aip>`

source: :ref:`Deleting an AIP <delete-aip>`
fr: :ref:`Supprimer un AIP <delete-aip>`
pt_br: :ref:`Apagar um AIP <delete-aip>`

source: :ref:`AIP structure <aip-structure>`
fr: :ref:`Structure d'un AIP <aip-structure>`
pt_br: :ref:`Estrutura do AIP <aip-structure>`

source: :ref:`AICs - managing multi-part AIPs <aic>`
fr: :ref:`AIC - Gestion d'AIP en plusieurs parties <aic>`
pt_br: :ref:`AICs - gerenciar AIPs multi-partes <aic>`

source: Access
fr: Accès
pt_br: Accesso

source: Most of Archivematica's access integrations take place within the Ingest tab. The Access tab displays DIPs which have been sent to AtoM.
fr: La plupart des intégrations d'accès d'Archivematica ont lieu dans l'onglet Acquisition. L'onglet Accès affiche les DIP qui ont été envoyés à AtoM.
pt_br: A maioria das integrações do Archivematica são feitas na tela Admissão. A tela Acesso exibe DIPs que foram enviados para o AtoM.

source: :ref:`General description <access>`
fr: :ref:`Description générale <access>`
pt_br: :ref:`Descrição geral <access>`

source: :ref:`Default access system <access-default>`
fr: :ref:`Système d'accès par défaut <access-default>`
pt_br: :ref:`Sistema de acesso padrão <access-default>`

source: :ref:`Upload DIP to AtoM <upload-atom>`
fr: :ref:`Télécharger le DIP dans AtoM <upload-atom>`
pt_br: :ref:`Fazer upload do DIP no AtoM <upload-atom>`

source: :ref:`Store DIP <store-dip>`
fr: :ref:`Entreposer le DIP <store-dip>`
pt_br: :ref:`Armazenar o DIP <store-dip>`

source: :ref:`Access tab <access-tab>`
fr: :ref:`Menu Accès <access-tab>`
pt_br: :ref:`Janela Accesso <access-tab>`

source: :ref:`Upload DIP metadata to Archivists' Toolkit <archivists-toolkit>`
fr: :ref:`Télécharger les métadonnées du DIP dans le module Archivists' Toolkit <archivists-toolkit>`
pt_br: :ref:`Fazer upload de metadados do DIP para o Archivists' Toolkit <archivists-toolkit>`

source: :ref:`Upload DIP to ContentDM <contentdm>`
fr: :ref:`Télécharger le DIP dans ContentDM <contentdm>`
pt_br: :ref:`Fazer upload do DIP para o ContentDM <contentdm>`

source: Preservation planning
fr: Planification de la préservation
pt_br: Planejamento de preservação

source: The Preservation Planning tab is the de facto user interface for the Format Policy Registry (FPR), the extensive format database that controls how Archivematica handles file formats. The Preservation Planning tab allows users to add or edit format policies for normalization, characterization, validation, and other tools and workflows that act upon content preserved through Archivematica.
pt_br: A janela de Planejamento de Preservação é a interface do usuário de facto para o Format Policy Registry (FPR - Registro de Política de Formatos), a extensa base de dados que controla como o Archivematica trata os formatos de arquivos. A janela de Planejamento de Preservação permite aos usuários adicionar ou editar políticas de formatos para normalização, caracterização, validação, e outras ferramentas e fluxos de trabalho que atuem no conteúdo preservado através do Archivematica.

source: :ref:`General description <preservation-planning>`
fr: :ref:`Description générale <preservation-planning>`
pt_br: :ref:`Descrição geral <preservation-planning>`

source: :ref:`Format Policy Registry (FPR) <fpr>`
fr: :ref:`Registre de politiques de formats (FPR) <fpr>`
pt_br: :ref:`Format Policy Registry (FPR - Registro de Política de Formatos) <fpr>`

source: :ref:`Preservation policies <pres-policies>`
fr: :ref:`Politiques de planification de préservation <pres-policies>`
pt_br: :ref:`Políticas de Preservação <pres-policies>`

source: :ref:`Altering rules and commands <fpr-instruct>`
fr: :ref:`Modifier les règles et commandes <fpr-instruct>`
pt_br: :ref:`Alterar regras e comandos <fpr-instruct>`

source: Administration
pt_br: Administração

source: The Administration tab allows administrative users to set processing configurations, transfer and storage locations, DIP upload configurations, and to add and remove users, among other things.
fr: L'onglet Administration permet, entre autre, aux utilisateurs administratifs de définir les configurations de traitement, les emplacements de transfert et de stockage, les configurations de téléchargement des DIP, et d'ajouter et de supprimer des utilisateurs.
pt_br: A janela Administração permite que usuários administradores definam configurações de processamento, locais de transferência e armazenamento, configurações de upload de DIP, e adicionar e remover usuários, entre outras coisas.

source: :ref:`Dashboard administration tab <dashboard-admin>`
fr: :ref:`Onglet Administration du tableau de bord <dashboard-admin>`
pt_br: :ref:`Janela administração do dashboard<dashboard-admin>`

source: :ref:`Storage service users <storageservice:users>`
fr: ref:`Utilisateurs du Service de stockage <storageservice:users>`
pt_br: :ref:`Usuários do storage service <storageservice:users>`

source: Metadata
fr: Métadonnées
pt_br: Metadados

source: Archivematica employs several metadata standards. This section describes how Archivematica implements and makes use of them.
fr: Archivematica utilise plusieurs normes de métadonnées. Cette section décrit comment Archivematica les implémente et les utilise.
pt_br: O Archivematica emprega diversos padrões de metadados. Esta seção descreve como o Archivematica implementa e faz uso deles.

source: Translations
fr: Traductions
pt_br: Traduções

source: Beginning with Archivematica 1.6.1, the community has been able to support the project by volunteering their time and effort to translate the Archivematica documentation, the interface, and the Storage Service into other languages.
fr: Depuis la version 1.6.1 d'Archivematica, la communauté a soutenu le projet en offrant temps et efforts pour traduire dans d'autres langues la documentation d'Archivematica, son interface et son service de stockage.
pt_br: A partir do Archivematica 1.6.1, a comunidade pode apoiar o projeto voluntariando seu tempo e esforço para traduzir a documentação, interface e Storage Service do Archivematica para outros idiomas.

source: :ref:`Contributing translations to the Archivematica project <translations>`
fr: :ref:`Contribuer à la traduction du projet Archivematica <translations>`
pt_br: :ref:`Contrubuir com traduções do projeto Archivematica <translations>`

source: Administrator manual
fr: Manuel de l'administrateur
pt_br: Manual do Administrador

source: The administrator manual is intended for systems administrators who are responsible for installing, configuring, setting up, and maintaining Archivematica and related systems.
pt_br: O manual do administrador é destinado a administradores de sistema que são responsáveis por instalar, configurar e manter o Archivematica e sistemas relacionados.

source: Installation and setup
fr: Installation et configuration
pt_br: Instalação e configuração

source: :ref:`Installing Archivematica <installation>`
pt_br: :ref:`Instalar o Archivematica <installation>`

source: :ref:`Upgrading Archivematica <upgrade>`
pt_br: :ref:`Fazer upgrade do Archivematica <upgrade>`

source: :ref:`Customization and automation <customization>`
fr: :ref:`Personnalisation et automatisation <customization>`
pt_br: :ref:`Personalização e automação <customization>`

source: :ref:`Setting up integrations <integrations>`
pt_br: :ref:`Configurar integrações <integrations>`

source: :ref:`Administering the Storage Service <storageservice:administrators>`
pt_br: :ref:`Administrar o Storage Service <storageservice:administrators>`

source: :ref:`Preservation planning <preservation-planning>`
pt_br: :ref:`Planejamento de preservação <preservation-planning>`

source: Maintenance
fr: Entretien
pt_br: Manutenção

source: :ref:`Data back-up <data-backup>`
fr: :ref:`Sauvegarder les données <data-backup>`
pt_br: :ref:`Backup de dados <data-backup>`

source: Security
fr: Sécurité
pt_br: Segurança
