Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fr, pt_br

source: :ref:`User security <user-security>`
pt_br: :ref:`Segurança do usuário <user-security>`

source: :ref:`LDAP setup <ldap-setup>`
pt_br: :ref:`Configuração LDAP <ldap-setup>`

source: :ref:`Shibboleth setup <shibboleth-setup>`
pt_br: :ref:`Configuração do Shibboleth <shibboleth-setup>`

source: :ref:`CA certificates <ca-root-certificates>`
pt_br: :ref:`Certificados AC <ca-root-certificates>`

source: :ref:`Review/Download DIP <review-dip>`
fr: :ref:`Vérifier/Télécharger le DIP <review-dip>`
