Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/user-manual/metadata/premis.po
Languages: fr

source: PREMIS metadata in Archivematica
fr: Métadonnées PREMIS dans Archivematica

source: Below, the entry template is described as it appears for each rights basis, followed by acts granted/restricted.
fr: Ci-dessous, le modèle de saisie correspondant à chaque base de privilèges est décrit, suivi des actions « accordé/limité ».

source: Skip to:
fr: Aller à :

source: :ref:`Basis: Copyight <basis-copyight>`
fr: :ref:`Base : Droits d’auteurs <basis-copyight>`

source: :ref:`Basis: Statute <basis-statute>`
fr: :ref:`Base : Loi <basis-statute>`

source: :ref:`Basis: License <basis-license>`
fr: :ref:`Base : Licence <basis-license>`

source: :ref:`Basis: Donor <basis-donor>`
fr: :ref:`Base : Donateur <basis-donor>`

source: :ref:`Basis: Policy <basis-policy>`
fr: :ref:`Base : Politique <basis-policy>`

source: :ref:`Basis: Other <basis-other>`
fr: :ref:`Base : Autre <basis-other>`

source: :ref:`Acts granted or restricted <acts-granted>`
fr: :ref:`Actions accordées ou limitées <acts-granted>`

source: Basis: Copyright
fr: Base : Droits d’auteur

source: PREMIS in METS XML: ``<premis:rightsBasis>Copyright</premis:rightsBasis>``
fr: PREMIS dans METS XML : ``<premis:rightsBasis>Droit d’auteur</premis:rightsBasis>``

source: Copyright status
fr: Statut des droits d’auteur

source: **Template field** Copyright status
fr: **Champ du modèle** Statut des droits d’auteur

source: **Rule** "A coded designation of the copyright status of the object at the time the rights status is recorded; e.g. copyrighted, publicdomain, unknown."
fr: **Règle** "Code désignant le statut des droits d’auteur concernant l’objet au moment de sa saisie; p. ex. : Protégé, domaine public, inconnu."

source: Copyright jurisdiction
fr: Compétence juridique

source: **Template field** Copyright jurisdiction
fr: **Champ du modèle** Compétence juridique

source: **Rule** "The country whose copyright laws apply"
fr: **Règle** "Pays dont les lois concernant la propriété intellectuelle s’appliquent"

source: **Notes** Values should be taken from a controlled vocabulary. Recommended: ISO 3166.
fr: **Notes** Les valeurs saisies devraient être choisies parmi des termes standardisés. Recommandation : ISO 3166.

source: Copyright determination date
fr: Date de détermination des droits d’auteur

source: **Template field** Copyright determination date
fr: **Champ du modèle** Date de détermination des droits d’auteur

source: **Rule** "The date that the copyright status recorded in copyrightStatus was determined."
fr: **Règle** “Date à laquelle le statut des droits d’auteur saisi dans StatutDroitsAuteur a été déterminé.”

source: **Notes** Uses ISO 8061.
fr: **Notes** Utilise la norme ISO 8061.

source: Copyright start date
fr: Date d’entrée en vigueur des droits d’auteur

source: **Template field** Copyright start date
fr: **Champ du modèle** Date d’entrée en vigueur des droits d’auteur

source: **Rule** "Date when the particular copyright applies or is applied to the content."
fr: **Règle** "Date à laquelle les droits d’auteur ont pris effet ou s’appliquent au contenu."

source: **Notes** Uses ISO 8061.
fr: **Notes** Utilise la norme ISO 8061.

source: Copyright end date
fr: Date d’expiration des droits d’auteur

source: **Template field** Copyright end date
fr: **Champ du modèle** Date d’expiration des droits d’auteur

source: **Rule** "Date when the particular copyright no longer applies or is applied to the content."
fr: **Règle** "Date à laquelle les droits d’auteur prennent fin ou cessent de s’appliquer au contenu."

source: End date can be left open by clicking "Open End Date." Resulting METS XML:
fr: Si les droits d’auteur n’ont pas pris fin ou si la date est inconnue, saisir "Date indéterminée." Résultat METS XML :

source: Copyright documentation identifier- Type
fr: Identifiant de documentation concernant les droits d’auteur- Type

source: **Template field** Copyright documentation identifier- Type
fr: **Champ du modèle** Identifiant de documentation concernant les droits d’auteur - Type

source: **Rule** "A designation of the domain within which the copyright documentation identifier is unique."
fr: **Règle** "Désignation du domaine dans lequel l’identifiant de la documentation concernant les droits d’auteur est unique."

source: Copyright documentation identifier- Value
fr: Identifiant de documentation concernant les droits d’auteur - Valeur

source: **Template field** Copyright documentation identifier- Value
fr: **Champ du modèle** Identifiant de documentation concernant les droits d’auteur - Valeur

source: **Rule** "The value of the copyrightDocumentationIdentifier."
fr: **Règle** "Valeur de l’identifiant de documentation concernant les droits d’auteur."

source: Copyright documentation identifier- Role
fr: Identifiant de documentation concernant les droits d’auteur - Rôle

source: **Template field** Copyright documentation identifier- Role
fr: **Champ du modèle** Identifiant de documentation concernant les droits d’auteur - Rôle

source: **Rule** "A value indicating the purpose or expected use of the documentation being identified."
fr: **Règle** "Valeur indiquant le rôle et l’utilisation supposés de la documentation identifiée."

source: Copyright note
fr: Note sur les droits d’auteur

source: **Template field** Copyright note
fr: **Champ du modèle** Note sur les droits d’auteur

source: **Rule** "Additional information about the copyright status of the object".
fr: **Règle** "Informations supplémentaires sur l’état des droits d’auteur de l’objet."

source: Basis: Statute
fr: Base : Loi

source: PREMIS in METS XML: ``<premis:rightsBasis>Statute</premis:rightsBasis>``
fr: PREMIS dans METS XML: ``<premis:rightsBasis>Loi</premis:rightsBasis>``

source: Statute jurisdiction
fr: Domaine de compétence juridique

source: **Template field** Statute jurisdiction
fr: **Champ du modèle** Domaine de compétence juridique

source: **Rule** "The country or other political body enacting the statute."
fr: **Règle** "Pays ou autre entité juridique où s’applique la loi."

source: **Notes** Values should be taken from a controlled vocabulary. Recommended: ISO ISO 3166.
fr: **Notes** Les valeurs saisies devraient être choisies parmi des termes standardisés. Recommandation : ISO 3166.

source: Statute citation
fr: Référence à la loi

source: **Template field** Statute citation
fr: **Champ du modèle** Référence à la loi

source: **Rule** "An identifying designation for the statute."
fr: **Règle** "Désignation permettant d’identifier la loi."

source: Statute information determination date
fr: Date de détermination de la loi

source: **Template field** Statute determination date
fr: **Champ du modèle** Date de détermination de la loi

source: **Rule** "The date that the determination was made the the statute authorized the permission(s) noted."
fr: **Règle** "Date à laquelle il a été déterminé que la loi autorisait les permissions données."

source: **Note** Uses ISO 8061
fr: **Note** Utilise la norme ISO 8061

source: Statute start date
fr: Date d’entrée en vigueur de la loi

source: **Template field** Statute start date
fr: **Champ du modèle** Date d’entrée en vigueur de la loi

source: **Rule** "The date when the statute begins to apply or is applied to the content."
fr: **Règle** "Date à laquelle une loi particulière prend effet ou s’applique au contenu."

source: Statute end date
fr: Date d’expiration de la loi

source: **Template field** Statute end date
fr: **Champ du modèle** Date d’expiration de la loi

source: **Rule** "The date when the statute ceases to apply or is applied to the content."
fr: **Règle** "Date à laquelle une loi particulière prend fin ou cesse de s’appliquer au contenu."

source: Statute documentation identifier- Type
fr: Identifiant de documentation concernant la loi - Type

source: **Template field** Statute documentation identifier- Type
fr: **Champ du modèle** Identifiant de documentation concernant la loi - Type

source: **Rule** "A designation of the domain within which the statute documentation identifier is unique."
fr: **Règle** "Désignation du domaine dans lequel l’identifiant de la documentation concernant la loi est unique."

source: Statute documentation identifier- Value
fr: Identifiant de la documentation concernant la loi- Valeur

source: **Template field** Statute documentation identifier- Value
fr: **Champ du modèle** Identifiant de la documentation concernant la loi- Valeur

source: **Rule** "The value of the statuteDocumentationIdentifier."
fr: **Règle** "Valeur de l’identifiant de documentation concernant la loi."

source: Statute documentation identifier- Role
fr: Identifiant de la documentation concernant la loi - Rôle

source: **Template field** Statute documentation identifier- Role
fr: **Champ du modèle** Identifiant de la documentation concernant la loi - Rôle

source: Statute note
fr: **Notes sur la loi**

source: **Template field** Statute note
fr: **Champ du modèle** Notes sur la loi

source: **Rule** "Additional information about the statute."
fr: **Règle** "Informations supplémentaires sur la loi."

source: Basis: License
fr: Base : Licence

source: PREMIS in METS XML: ``<premis:rightsBasis>License</premis:rightsBasis>``
fr: PREMIS dans METS XML : ``<premis:rightsBasis>Licence</premis:rightsBasis>``

source: License terms
fr: Termes et conditions de la licence

source: **Template field** License terms
fr: **Champ du modèle** Termes et conditions de la licence

source: **Rule** "Text describing the license or agreement by which permission was granted."
fr: **Règle** "Description de la licence ou de l’entente accordant la permission."

source: License start date
fr: Date d’entrée en vigueur de la licence

source: **Template field** License start date
fr: **Champ du modèle** Date d’entrée en vigueur de la licence

source: **Rule** "The date at which the license is first applies or is applied to the content."
fr: **Règle** "Date à laquelle un statut particulier prend effet ou s’applique au contenu."

source: **Note** Uses ISO 8061.
fr: **Note** Utilise la norme ISO 8061.

source: License end date
fr: Date d’expiration de la licence

source: **Template field** License end date
fr: **Champ du modèle** Date d’expiration de la licence

source: **Rule** "The date at which the license no longer applies or is applied to the content."
fr: **Règle** "Date à laquelle la licence prend fin ou cesse de s’appliquer au contenu."

source: License documentation identifier- Type
fr: Identifiant de documentation concernant la licence - Type

source: **Template field** License documentation identifier- Type
fr: **Champ du modèle** Identifiant de documentation concernant la licence- Type

source: **Rule** "A designation of the domain within which the license documentation identifier is unique."
fr: **Règle** "Désignation du domaine dans lequel l’identifiant de documentation concernant la licence est unique."

source: License documentation identifier- Value
fr: Identifiant de documentation concernant la licence- Valeur

source: **Template field** License documentation identifier- Value
fr: **Champ du modèle** Identifiant de documentation concernant la licence- Valeur

source: **Rule** "The value of the licenseDocumentationIdentifier."
fr: **Règle** "Valeur de l’identifiant de documentation concernant la licence."

source: License documentation identifier- Role
fr: Identifiant de documentation concernant la licence- Rôle

source: **Template field** License documentation identifier- Role
fr: **Champ du modèle** Identifiant de documentation concernant la licence- Rôle

source: License note
fr: Notes sur la licence

source: **Template field** License note
fr: **Champ du modèle** Notes sur la licence

source: **Rule** "Additional information about the license."
fr: **Règle** "Informations supplémentaires sur la licence."

source: Basis: Donor
fr: Base : Donateur

source: Donor agreement start date
fr: Date d'entrée en vigueur de la convention de donation

source: **Template field** Donor agreement start date
fr: **Champ du modèle** Date d’entrée en vigueur de la convention de donation

source: Donor agreement end date
fr: Date d’expiration de la convention de donation

source: **Template field** Donor agreement end date
fr: **Champ du modèle** Date d’expiration de la convention de donation

source: Donor documentation identifier- Type
fr: Identifiant de documentation concernant le donateur- Type

source: **Template field** Donor documentation identifier- Type
fr: **Champ du modèle** Identifiant de documentation concernant le donateur- Type

source: Donor documentation identifier- Value
fr: Identifiant de documentation concernant le donateur- Valeur

source: **Template field** Donor documentation identifier- Value
fr: **Champ du modèle** Identifiant de documentation concernant le donateur- Valeur

source: Donor documentation identifier- Role
fr: Identifiant de documentation concernant le donateur- Rôle

source: **Template field** Donor documentation identifier- Role
fr: **Champ du modèle** Identifiant de documentation concernant le donateur- Rôle

source: **Rule** "The value indicating the purpose or expected use of the documentation being identified."
fr: **Règle** "Valeur indiquant le rôle et l’utilisation supposés de la documentation identifiée."

source: Donor agreement note
fr: Note sur la convention de donation

source: **Template field** Donor agreement note
fr: **Champ du modèle** Note sur la convention de donation

source: Basis: Policy
fr: Base : Politique

source: Policy start date
fr: Date d’entrée en vigueur de la politique

source: **Template field** Policy start date
fr: **Champ du modèle** Date d’entrée en vigueur de la politique

source: Policy end date
fr: Date d’expiration de la politique

source: **Template field** Policy end date
fr: **Champ du modèle** Date d’expiration de la politique

source: Policy documentation identifier- Type
fr: Identifiant de documentation concernant la politique- Type

source: **Template field** Policy documentation identifier- Type
fr: **Champ du modèle** Identifiant de documentation concernant la politique- Type

source: Policy documentation identifier- Value
fr: Identifiant de documentation concernant la politique- Valeur

source: **Template field** Policy documentation identifier- Value
fr: **Champ du modèle** Identifiant de documentation concernant la politique- Valeur

source: Policy documentation identifier- Role
fr: Identifiant de documentation concernant la politique- Rôle

source: **Template field** Policy documentation identifier- Role
fr: **Champ du modèle** Identifiant de documentation concernant la politique- Rôle

source: Policy note
fr: Note sur la politique

source: **Template field** Policy note
fr: **Champ du modèle** Note sur la politique

source: Basis: Other
fr: Base : Autre

source: PREMIS in METS XML: ``<premis:rightsBasis>Other</premisrightsBasis>``
fr: PREMIS dans METS XML: ``<premis:rightsBasis>Autre</premisrightsBasis>``

source: **Template field** Note
fr: **Champ du modèle** Note

source: Acts granted or restricted
fr: Actions accordées ou limitées

source: Act
fr: Action

source: **Template field** Act
fr: **Champ du modèle** Action

source: Grant/restriction
fr: Accordé/limité

source: **Template field** Grant/restriction
fr: **Champ du modèle** Accordé/limité

source: **Rule** Drop-down field: choose between Allow, Disallow, Conditional
fr: **Règle** Menu déroulant: choisir entre Permis, Interdit, Conditionnel

source: Start
fr: Début

source: **Template field** Start
fr: **Champ du modèle** Début

source: End
fr: Fin

source: **Template field** End
fr: **Champ du modèle** Fin

source: :ref:`Back to the top <premis-template>`
fr: :ref:`Retour en haut de page <premis-template>`
