Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/quick-start/configuration.po
Languages: fr, pt_br

source: Configuration
pt_br: Configuração

source: Workflow settings
fr: Paramètres du flux de travail
pt_br: Configurações de fluxo de trabalho

source: Many workflow choices are pre-configurable through the Administration tab of the Dashboard. Please see :ref:`Processing configuration <dashboard-processing>`.
fr: Plusieurs des choix du flux de travail sont préconfigurables via l'onglet Administration du tableau de bord. Voir :ref:`Configuration du traitement <dashboard-processing>`.
pt_br: Muitas opções de fluxo de trabalho são pré-configuráveis ​​por meio da aba Administração do Painel. Por favor, veja: ref:`Configuração de processamento <dashboard-processing>`.

source: Some users have found processing economies by installing multiple Archivematica pipelines on separate VM's, each with its own processing configuration specific to the type of material being processed through each pipeline.
fr: Certains utilisateurs arrivent à sauver du temps de traitement en installant plusieurs pipelines Archivematica sur des machines virtuelles distinctes, chacune ayant sa propre configuration de traitement spécifique au type de matériel traité par chaque pipeline.
pt_br: Alguns usuários encontraram economias de processamento instalando vários pipelines do Archivematica em VMs separadas, cada uma com sua própria configuração de processamento específica para o tipo de material que está sendo processado em cada pipeline.

source: Integration settings
fr: Paramètres d'intégration
pt_br: Configurações de integração

source: Archivematica integrates with a number of different access and storage systems. Please see:
fr: Archivematica est conçu pour s'intégrer avec une variété de systèmes d'accès et de stockage. Voir:
pt_br: O Archivematica integra-se a vários sistemas de acesso e armazenamento diferentes. Por favor, veja:

source: :ref:`LOCKSS <storageService:admin-lockss>` (Administrator documentation)
fr: :ref:`LOCKSS <storageService:admin-lockss>` (Documentation de l'administrateur)
pt_br: :ref:`LOCKSS <storageService:admin-lockss>` (Documentação do Administrador)

source: Duracloud (coming soon)
fr: Duracloud (à venir)
pt_br: Duracloud (em breve)

source: Arkivum (coming soon)
fr: Arkivum (à venir)
pt_br: Arkivum (em breve)

source: Add/edit users and passwords
fr: Ajouter/modifier les utilisateurs et mots de passe
pt_br: Adicionar/editar usuários e senhas

source: Administrative users can add/edit users and update passwords. An administrative user does not need to be a systems administrator and can perform this function within the Archivematica dashboard Administration page.
fr: Les utilisateurs administratifs peuvent ajouter/modifier les comptes utilisateurs et mettre à jour les mots de passe. Un utilisateur administratif n'a pas besoin d'être administrateur système et peut exécuter cette fonction dans la page d'administration du tableau de bord Archivematica.
pt_br: Usuários com perfil de administrador podem adicionar/editar usuários e atualizar senhas. Este usuário não precisa ser um administrador de sistemas e pode executar essa função na página Administração do painel do Archivematica.

source: Please see :ref:`Users <dashboard-premis>`.
fr: Voir :ref:`Utilisateurs <dashboard-premis>`.
pt_br: Por favor, veja: ref: `Usuários

source: Add/edit PREMIS agents
fr: Ajouter/modifier les agents PREMIS
pt_br: Adicionar/editar agentes PREMIS

source: Administrative users can add/edit PREMIS agents, which are recorded in the METS file to identify the agency performing digital preservation events. This should be configured before processing begins, and can be set through Archivematica dashboard Administration page.
fr: Les utilisateurs administratifs peuvent ajouter/modifier les agents PREMIS qui sont enregistrés dans le fichier METS afin d’identifier l’organisation qui exécute les événements de préservation numérique. Cette configuration devrait être effectuée avant le début du traitement via la page d'administration du tableau de bord Archivematica.
pt_br: Usuários com perfil de administrador podem adicionar/editar agentes PREMIS, que são registrados no arquivo METS para identificar a agência que realiza eventos de preservação digital.

source: Please see :ref:`PREMIS agent <dashboard-premis>`.
fr: Voir :ref:`Agent PREMIS <dashboard-premis>`.
pt_br: Por favor, veja: ref: `PREMIS agent <dashboard-premis>`.

source: :ref:`Back to the top <configuration>`
fr: :ref:`Retour en haut de page <configuration>`
pt_br: :ref:`Voltar ao topo <configuration>`
