Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/quick-start/quick-start.po
Languages: fr, pt_br

source: When prompted, make decisions as you wish; however, don't select anything that would stop the transfer (i.e. anything that says "Reject"). For more information about the decision points, check out the :ref:`transfer tab documentation <transfer>`.
fr: Lorsque vous êtes invité à le faire, prenez les décisions nécessaires. Par contre, ne sélectionnez rien qui interromprait le transfert (c.-à-d. quoi que ce soit qui mentionne « Rejeter »). Pour en savoir plus sur les points de décisions, consultez la :ref:`documentation de l’onglet de transfert<transfer>`.
pt_br: Quando perguntado, tome decisões conforme desejar; entretanto, não selecione nada que possa parar a transferência (ou seja, qualquer coisa que diga "Rejeitar"). Para mais informações sobre pontos de decisão, consulte a :ref:`documentação da janela transferência <transfer>`.

source: When you reach the *Identify file format* micro-service, stop and read the next section.
fr: Lorsque vous êtes arrivé au microservice *Identifier le format de fichier*, arrêtez et lisez la section suivante.
pt_br: Quando chegar ao microsserviço *Identificar formato de arquivo*, pare e leia a próxima seção.

source: Review file formats
fr: Examen des formats de fichiers
pt_br: Revisar formatos de arquivo

source: You do not need to consult the command for every job, but we do recommend taking a look at the output of the *Identify file format* micro-service. One of Archivematica's most important jobs is to identify file formats and then preserve those files as best as possible.
fr: Il n’est pas essentiel de consulter la commande de chaque travail, mais il est recommandé d’examiner les résultats du microservice *Identifier le format de fichier*. Un des travaux les plus importants d’Archivematica est d’identifier les formats de fichiers et ensuite de préserver ces fichiers le mieux possible.
pt_br: Você não precisa consultar o comando de cada tarefa, mas recomendamos que dê uma olhada na saída do microsserviço *Identificar formato de arquivo". Uma das tarefas mais importantes do Archivematica é identificar os formatos de arquivo e então preservar esses arquivos da melhor forma possível.

source: When you are prompted, select a file format identification tool (Siegfried and Fido are the most robust options).
fr: Lorsque vous êtes invité à le faire, sélectionnez un outil d’identification de formation de fichier (Siegfried et Fido sont les options les plus robustes).
pt_br: Quando solicitado, selecione uma ferramenta para identificação de formato de arquivo (Siegfried e Fido são as opções mais robustas).

source: Once file format identification is complete, click on the gear icon to the right of the job name to open the job page.
fr: Lorsque l’identification du format de fichier est terminée, cliquez sur l’icône engrenage, à droite du nom de travail, pour ouvrir la page du travail.
pt_br: Uma vez que a identificação de formato tenha completado, clique no ícone de engrenagem à direita do nome da tarefa para abrir a página da tarefa.

source: On the job page, under the heading STDOUT, you will see information similar to the following:
fr: Sur la page du travail, sous STDOUT, vous verrez de l’information similaire à ce qui suit :
pt_br: Na página da tarefa, sob o cabeçalho STDOUT, você verá informações semelhantes ao seguinte:

source: The above tells us that the file MARBLES.TGA was identified as a Truevision TGA Bitmap 2.0. Archivematica uses `PRONOM <https://www.nationalarchives.gov.uk/PRONOM/Default.aspx>`_, a registry of technical information maintained by the National Archives of the UK, for file identification and to inform normalization, characterization, and other file-manipulation events. Archivematica identifies a TGA file as `fmt/402 <https://www.nationalarchives.gov.uk/PRONOM/fmt/402>`_ (format 402), which is the PRONOM format identifier for a Truvision TGA Bitmap 2.0. There should be a similar STDOUT section for each item in your transfer.
fr: Cette information signifie que le fichier MARBLES.TGA a été identifié comme un format Truevision TGA Bitmap 2.0. Archivematica utilise `PRONOM <https://www.nationalarchives.gov.uk/PRONOM/Default.aspx>`_, un registre d’information technique maintenu par les National Archives of the UK, aux fins d’identification des fichiers et pour informer la normalisation, la caractérisation et d’autres événements de manipulation de fichiers. Archivematica identifie un fichier TGA comme étant `fmt/402 <https://www.nationalarchives.gov.uk/PRONOM/fmt/402>`_ (format 402), l’identificateur de format PRONOM d’un fichier Truvision TGA Bitmap 2.0. Il devrait y avoir une section STDOUT similaire pour chaque élément du transfert.
pt_br: A imagem acima diz que o arquivo MARBLES.TGA foi identificado como um arquivo Truevision TGA Bitmap 2.0. O Archivematica utiliza o `PRONOM <https://www.nationalarchives.gov.uk/PRONOM/Default.aspx>`_, um registro de informações técnicas mantida pelo National Archives of the UK, para identificação e para informar a normalização, caracterização, e outros eventos de manipulação de arquivos. O Archivematica identifica um arquivo TGA como `fmt/402 <https://www.nationalarchives.gov.uk/PRONOM/fmt/402>`_ (format 402), que é o identificador de formado do PRONOM para um Truvision TGA Bitmap 2.0. Deve haver uma seção STDOUT similar para cada item em sua transferência.

source: Archivematica will continue processing your transfer in the background. When you reach the *Create SIP from Transfer micro-service*, read the next section.
fr: Archivematica continuera de traiter votre transfert en arrière-plan. Lorsque vous êtes arrivé au microservice *Création d'un SIP à partir du transfert*, lisez la section suivante.
pt_br: O Archivematica continuará processando sua transferência em segundo plano. Quando chegar ao microsserviço *Criar SIP da Transferência*, leia a próxima seção.

source: Create a SIP
fr: Création d'un SIP
pt_br: Criar uma SIP

source: The final micro-service on the Transfer tab is *Create SIP from Transfer*. The final job, *Create SIP(s)*, allows you to either proceed directly to the Ingest tab or to send the transfer to the backlog. For more information on the backlog, check out the :ref:`backlog documentation <manage-backlog>`.
fr: Le dernier microservice de l’onglet Transfert est *Création d'un SIP à partir du transfert*. Ce dernier travail, à savoir *Création de SIP(s)*, vous permet d’aller directement à l’onglet Acquisition ou d’envoyer le transfert au backlog. Pour en savoir plus sur le backlog, consultez la :ref:`documentation du backlog <manage-backlog>`.
pt_br: O microsserviço final da janela Transferência é *Criar SIP da Transferência*. A tarefa final, "Criar SIP(s)*, permite que você ou continue diretamente para a janela Admissão, ou envie a transferência para o backlog. Para mais informações sobre o backlog, consulte a :ref:`documentação de backlog <manage-backlog>`.

source: When prompted, select *Create single SIP and continue processing*.
fr: Lorsque vous êtes invité à le faire, sélectionnez *Créer un seul SIP et continuer le traitement*.
pt_br: Quando solicitado, selecione *Criar único SIP e continuar a processar*.

source: Task #2 - Make AIPs and DIPs
fr: Tâche #2 – Création d’AIP et de DIP
pt_br: Tarefa nº 2 - Fazer AIPs e DIPs

source: The primary function of Archivematica is to produce Archival Information Packages (AIPs) and Dissemination Information Packaes (DIPs) from SIPs. You just created a SIP on the Transfer tab. The Ingest tab is where you run micro-services that create the AIP and the DIP.
fr: La fonction primaire d’Archivematica est de produire des Paquets d'information archivés (AIP - Archival Information Packages) et des Paquets d’information diffusés (DIP - Dissemination Information Packages) à partir de SIP. Vous venez de créer un SIP dans l’onglet Transfert. C’est dans l’onglet Acquisition que vous lancez le microservice qui crée l’AIP et le DIP.
pt_br: A função primária do Archivematica é produzir Archival Information Packages (AIP) e Dissemination Information Packages (DIPs) a partir de SIPs. Você acabou de criar um SIP na janela Transferência. A janela Admissão é onde você executará microsserviços que criam o AIP e o DIP.

source: Click on the Ingest tab.
fr: Cliquez sur l’onglet Acquisition.
pt_br: Clique no link Admissão

source: Make decisions as required (again, don't select anything that says "Reject"). For more information about the decision points that appear during ingest, check out the :ref:`ingest tab documentation <ingest>`.
fr: Prenez les décisions nécessaires (mais encore une fois, ne sélectionnez rien qui mentionne « Rejeter »). Pour en savoir plus sur les points de décisions présents dans Acquisition, consultez la :ref:`documentation de l’onglet Acquisition<ingest>`.
pt_br: Tome decisões como desejar (novamente, não selecione nada que diga "Rejeitar"). Para mais informações sobre os pontos de decisão que aparecem durante a admissão, consulte a :ref:`documentação da janela admissão <ingest>`.

source: When you get to the Normalize decision point, stop and read the next section.
fr: Lorsque vous arrivez au point de décision Normaliser, arrêtez et lisez la section suivante.
pt_br: Quando chegar ao ponto de decisão de Normalização, pare e leia a próxima seção.

source: Normalization
fr: Normalisation
pt_br: Normalização

source: Ingest, like Transfer, is also made up of a series of micro-services. The most significant micro-service that takes place during ingest is Normalize. Normalization is the process of converting your digital content into appropriate formats for long-term storage (for an AIP) and access (for a DIP). When you reach the Normalization micro-service, you will be prompted to decide how you would like to normalize your content.
fr: Acquisition, tout comme Transfert, comporte plusieurs microservices, le plus important étant Normaliser. La normalisation consiste à convertir votre contenu numérisé en formats appropriés aux fins de stockage à long terme (pour un AIP) et d’accès (pour un DIP). Lorsque vous arrivez au microservice Normalisation, vous devrez déterminer comment normaliser le contenu.
pt_br: A Admissão, assim como a Transferência, é formada por uma série de microsserviços. O microsserviço mais significativo que é feito durante a admissão é a Normalização. Normalização é o processo de converter seu conteúdo digital em formatos apropriados para armazenamento de longo prazo (para um AIP) e acesso (para um DIP). Quando você chegar ao microsserviço Normalização, terá de decidir como deseja normalizar seu conteúdo.

source: Select *Normalize for preservation and access* when prompted. By selecting this option, you are telling Archivematica that you would like to create a preservation copy (AIP) and an access copy (DIP) of the contents of your SIP.
fr: Sélectionnez *Normaliser aux fins de préservation et d'accès* lorsque vous êtes invité à le faire. En sélectionnant cette option, vous dites à Archivematica que vous désirez créer une copie de préservation (AIP) et une copie d’accès (DIP) du contenu de votre SIP.
pt_br: Selecione *Normalizar para preservação e acesso* quando solicitado. Selecionando esta opção, você estará dizendo ao Archivematica que deseja criar uma cópia de preservação (AIP) e uma cópia de acesso (DIP) dos conteúdos de seu SIP.

source: Once normalization is complete, you will be prompted to approve normalization. Before selecting approve, click on the small page icon next to the drop down menu.
fr: Lorsque la normalisation est terminée, vous êtes invité à approuver la normalisation. Avant de l’approuver, cliquez sur la petite icône de page, à côté du menu déroulant.
pt_br: Uma vez que a normalização tenha completado, será solicitado que você aprove a normalização. Antes de selecionar aprovar, clique no ícone de uma pequena página, próximo ao menu de seleção.

source: The Normalization Report will open in a separate tab. Information on how to read this report is included below.
fr: Le Rapport de normalisation s’affichera dans un onglet séparé. La manière de lire cette information est décrire plus loin.
pt_br: O Relatório de Normalização será aberto em uma janela separada. Informações de como ler este relatório estão incluídas a seguir.

source: In your main tab, click on the Preservation Planning tab at the top of the page. When the Preservation Planning tab is open, search for "SVG" (or whatever file format you would like to review). Click on the name of the file format.
fr: Dans votre onglet principal, cliquez sur l’onglet Planification de la préservation en haut de la page. Lorsque cet onglet est ouvert, lancez une recherche sur « SVG » (ou tout format de fichier que vous souhaitez examiner). Cliquez sur le nom du format de fichier.
pt_br: Em sua janela principal, clique no atalho Plano de Preservação, no topo da página. Quando a janela de Plano de Preservação abrir, procure por "SVG" (ou pelo formato de arquivo que você gostaria de revisar). Clique no nome do formato de arquivo.

source: You should now have two tabs open - the Normalization Report and the Preservation Planning page. Go back to the Normalization Report and review the next two sections.
fr: Deux onglets devraient maintenant être ouverts : le Rapport de normalisation et la page Planification de la préservation. Retournez au Rapport de normalisation et examinez les deux sections qui suivent.
pt_br: Você terá agora duas janelas abertas - o Relatório de Normalização e a página do Plano de Preservação. Volte para o Relatório de Normalização e reveja as próximas duas seções.

source: Reviewing normalization for preservation
fr: Examen de la normalisation à des fins de préservation
pt_br: Revisar a normalização para preservação

source: The Normalization Report details whether or not normalization was attempted on the contents of your SIP. This screenshot shows the report for lion.svg, identified as a Scalable Vector Graphic, with the preservation columnns highlighted.
fr: Le Rapport de normalisation précise si le contenu de votre SIP a fait l’objet d’une normalisation. Cette prise d’écran présente le rapport pour lion.svg, un graphique vectoriel adaptable, avec les colonnes de préservation surlignées.
pt_br: O Relatório de Normalização detalha se houve ou não tentativa de normalização dos conteúdos de seu SIP. Esta captura de tela mostra o relatório para lion.svg, identificado como um Scalable Vector Graphic, com as colunas de preservação destacadas.

source: If you return to the Preservation Planning tab where you searched for SVG, you can see that SVG files are considered a preservation format. Therefore, the Normalization Report indicates the following:
fr: Si vous retournez à l’onglet Planification de la préservation où vous avez effectué la recherche pour trouver SVG, vous constaterez que les fichiers SVG sont considérés comme un format de préservation. Le Rapport de normalisation indique alors :
pt_br: Se você retornar à janela do Plano de Preservação, onde você procurou pelo SVG, poderá ver que arquivos SVG são considerados um formato de preservação. Logo, o Relatório de Normalização indica o seguinte:

source: Preservation normalization was attempted.
fr: La normalisation de préservation a été tentée
pt_br: Houve tentativa de normalização para preservação.

source: Preservation normalization did not fail.
fr: La normalisation de préservation n’a pas échoué.
pt_br: A normalização não falhou.

source: The image was already in a preservation format.
fr: L’image était déjà en format de préservation.
pt_br: A imagem já estava em formato para preservação.

source: Essentially, this means that preservation normalization kicked off, but Archivematica realized that the file was already in a preservation format and so no action was taken.
fr: Grosso modo, cela signifie que la normalisation de préservation a été lancée, mais qu’Archivematica a constaté que le fichier était déjà sous forme de format de préservation, et n’a donc rien fait.
pt_br: Essencialmente, isto significa que a normalização de preservação foi disparada, mas o Archivematica entendeu que o arquivo já estava em um formato de preservação, então nenhuma ação foi realizada.

source: Reviewing normalization for access
fr: Examen de la normalisation à des fins d’accès
pt_br: Revisar a normalização para acesso

source: This screenshot shows the report for lion.svg with the access columnns highlighted.
fr: Cette prise d’écran illustre le rapport lion.svg, avec les colonnes d’accès surlignées.
pt_br: Esta captura de tela mostra o relatório pra lion.svg, com as colunas de acesso destacadas.

source: For access normalization, the report indicates the following:
fr: Pour la normalisation d’accès le rapport indique ce qui suit :
pt_br: Para normalização de acesso, o relatório indica o seguinte:

source: Access normalization was attempted.
fr: La normalisation d’accès a été tentée
pt_br: Houve tentativa de normalização para acesso.

source: Access normalization did not fail.
fr: La normalisation d’accès n'a pas échoué.
pt_br: A normalização para acesso não falhou.

source: The image was not in an access format.
fr: L’image n’était pas en format d’accès.
pt_br: A imagem não estava em formato para acesso.

source: To review what this means for lion.svg, we'll dig a little deeper into the Preservation Planning tab.
fr: Pour examiner ce que cela signifie pour lion.svg, nous devrons aller plus loin dans l’onglet Planification de la préservation.
pt_br: Para entender o que isto significa para lion.svg, aprofundaremo-nos na janela de Plano de Preservação.

source: Navigate back to the Preservation Planning tab.
fr: Retournez à l’onglet Planification de la préservation.
pt_br: Navegue de volta à janela Plano de Preservação.

source: Scroll down and find the *Normalization* section in the left-hand sidebar. Click on *Rules*.
fr: Défilez vers le bas et trouvez la section Normalisation, dans la barre latérale de gauche. Cliquez sur Règles.
pt_br: Role para baixo na tela e encontre a seção *Normalização* na barra lateral esquerda. Clique em *Regras*.

source: Search for "Scalable Vector Graphics" (or whatever file format you are analyzing).
fr: Effectuez une recherche « Scalable Vector Graphics » (ou tout autre format de fichier à analyser).
pt_br: Procure por "Scalable Vector Graphics" (ou qualquer formato de arquivo que vocês estiver analisando).

source: The results show the Access and Normalization rules for SVG files. Under the Command column we can see that the preferred access format for an SVG is PDF. Archivematica follows these rules to create access copies, so we can infer from the Normalization Report that a PDF copy of the SVG file has been successfully created for the DIP. You can confirm this by checking the command output for the *Normalize for access* job (similar to how you checked the command output for *Identify file format*, above) or by reviewing the DIP once it has been stored.
fr: Les résultats donnent les règles d’accès et de normalisation des fichiers SVG. À la colonne Commande, on constate que le format d’accès privilégié pour un SVP est PDF. Archivematica suit ces règles pour créer des copies d’accès, ce qui nous permet de conclure d’après le Rapport de normalisation qu’une copie PDF du fichier SVG a bien été créée pour le DIP. Vous pouvez le confirmer en vérifiant le résultat de la commande du travail *Normaliser aux fins d’accès* (comme vous l’avez fait précédemment pour le travail *Identifier le format de fichier*) ou en examinant le DIP après qu’il a été stocké.
pt_br: Os resultados exibem as regras de Acesso e Normalização para arquivos SVG. Sob a coluna Comando, podemos ver que o formato preferencialmente usado para acesso para um SVG é o PDF. O Archivematica segue estas regras para criar cópias de acesso, então podemos inferir do Relatório de Normalização que a cópia PDF do arquivo SVG foi criado com sucesso para o DIP. Você pode confirmar isso verificando a saída do comando para a tarefa *Normalizar para acesso* (de forma similar a como você verificou a saída do comando para *Identificar formato de arquivo* anteriormente), ou revendo o DIP, uma vez que tenha sido armazenado.

source: Continue processing your ingest, stopping when you reach the AIP and DIP decision points.
fr: Continuez le traitement de votre Acquisition, et arrêtez lorsque vous arrivez aux points de décisions AIP et DIP.
pt_br: Continue processando sua admissão, parando quando chegar aos pontos de decisão sobre AIP e DIP.

source: Task #3 - Store AIPs and DIPs
fr: Tâche #3 - Stockage des AIP et des DIP
pt_br: Tarefa nº 3 - Armazenar AIPs e DIPs

source: Archivematica is a tool for creating packages. In a production environment, storage occurs externally to Archivematica in a storage system selected by the user or institution, but for the sake of this demo we'll store our AIP and DIP in Archivematica's default internal storage.
fr: L’outil Archivematica est excellent pour créer des paquets. Dans un environnement de production, le stockage se fait hors d’Archivematica dans un système de stockage privilégié par l’utilisateur ou l’institution. Mais aux fins de la présente démonstration, nous sauvegarderons notre AIP et notre DIP dans l’unité de stockage interne par défaut d’Archivematica.
pt_br: O Archivematica é uma ferramenta para criação de pacotes. Em um ambiente de produção, o armazenamento ocorre externamente ao Archivematica, em um sistema de armazenamento selecionado pelo usuário ou instituição, mas para esta demonstração, armazenaremos nossos AIP e DIP no armazenamento interno padrão do Archivematica.

source: AIPs should always be stored first. Because the packages are smaller, storage options for DIPs are usually the first to appear, so it's tempting to store them right away. However, if anything goes wrong with your AIP, you would then have to delete the DIP from the storage and access systems. Dealing with the AIP first allows you to store and provide access to DIPs knowing that that the AIP is secure.
fr: Il faut toujours stocker les AIP en premier. Étant donné que les paquets sont plus petits, les options de stockage des DIP sont les premières à être affichées, et il est tentant de les stocker immédiatement. Si quelque chose ne fonctionne pas avec votre AIP, il vous faudrait alors supprimer le DIP des systèmes de stockage et d’accès. En traitant l’AIP en premier, vous pourrez stocker les DIP et y donner accès en sachant que l’AIP est sécurisé.
pt_br: Os AIPs devem sempre ser armazenados primeiro. Como os pacotes são menores, as opções para armazenamento dos DIPs geralmente aparecem primeiro, então é tentador armazená-los imediatamente. Entretanto, se ocorrer algo de errado com seu AIP, você terá de apagar o DIP dos sistemas de armazenamento e acesso. Ao lidar com o AIP primeiro você poderá armazenar e permitir acesso aos DIPs sabendo que o AIP está seguro.

source: Process your ingest until the *Store AIP* and *Upload DIP* micro-services prompt you for a decision point.
fr: Traitez votre acquisition jusqu’à ce que les microservices *Stocker l’AIP* et *Télécharger le DIP* vous demandent un point de décision.
pt_br: Processe sua admissão até que os microsserviços *Armazenar AIP* e *Fazer upload o DIP* solicitem uma decisão sua.

source: Select "Store AIP" from the *Store AIP* dropdown.
fr: Sélectionnez « Stocker l’AIP » dans le menu déroulant *Stocker l’AIP*.
pt_br: Selecione "Armazenar AIP" no menu de seleção "Armazenar AIP".
