Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/quick-start/quick-start.po
Languages: fr, pt_br

source: Archivematica Quick-Start Guide
fr: Guide de démarrage rapide Archivematica
pt_br: Guia de início rápido do Archivematica

source: This guide walks you through the Archivematica transfer and ingest process for testing purposes. It is intended for people who are new to Archivematica and looking to test it out. This is not a guide to install Archivematica for development or production - please see :ref:`Installation <installation>` for full installation instructions. Before you start, you should know a bit about the `OAIS Reference Model <http://www.oclc.org/research/publications/library/2000/lavoie-oais.html>`_ enough that the acronyms SIP, AIP, and DIP make sense.
fr: Ce guide décrit le processus de transfert et d'acquisition d’Archivematica aux fins d’essais. Il est destiné aux personnes qui ne connaissent pas Archivematica et désirent le mettre à l’essai. Il ne s’agit pas d’un guide d’installation Archivematica aux fins de développement ou de production. Pour ce faire, consultez plutôt :ref:`Installation <installation>`. Avant de commencer, vous devriez être sensibilisé au `OAIS Reference Model <http://www.oclc.org/research/publications/library/2000/lavoie-oais.html>`_ (Système ouvert d'archivage d'information) et être à l’aise avec les acronymes SIP, AIP et DIP.
pt_br: Este guia irá orientá-lo através do processo de transferência e de admissão do Archivematica para fins de teste. Destina-se a pessoas que são novas no Archivematica e procuram testá-lo. Este não é um guia para instalar o Archivematica para desenvolvimento ou produção - consulte: ref: `Installation<installation>` para instruções completas de instalação. Antes de começar, você deve conhecer o `OAIS Reference Model <http://www.oclc.org/research/publications/library/2000/lavoie-oais.html> `_ o suficiente para que as siglas SIP, AIP e DIP façam sentido.

source: This guide runs through the basic actions taken on a standard transfer and does not cover Archivematica's advanced features. For information about processing more complex content, see the :ref:`User manual <user-manual>`. The instructions below are applicable to both the sandbox and an Archivematica virtual machine, unless otherwise noted.
fr: Ce guide aborde les processus de base d’un transfert standard, et non les fonctionnalités avancées d’Archivematica. Pour savoir comment traiter du contenu plus complexe, consultez le :ref:`Guide de l’utilisateur<user-manual>`. Les instructions qui suivent s’appliquent au bac à sable et à une machine virtuelle Archivematica, à moins d’avis à l’effet du contraire.
pt_br: Este guia descreve ações básicas executadas em uma transferência padrão e não abrange os recursos avançados do Archivematica. Para obter informações sobre o processamento de conteúdo mais complexo, consulte o: ref: `Manual do usuário<user-manual>`. As instruções abaixo são aplicáveis tanto à sandbox quanto a uma máquina virtual Archivematica, a menos que indicado de outra forma.

source: By the end of this walkthrough, you will be able to:
fr: Après avoir pris connaissance de ce guide, vous pourrez :
pt_br: No final deste passo a passo, você será capaz de:

source: Create a standard transfer in Archivematica
fr: Créer un transfert standard dans Archivematica
pt_br: Criar uma transferência padrão no Archivematica

source: Create an AIP and a DIP from the transfer
fr: Créer un AIP et un DIP à partir du transfert
pt_br: Criar um AIP e um DIP da transferência

source: Review file identification
fr: Examiner l’identification d’un fichier
pt_br: Revisar a identificação do arquivo

source: Review file normalization
fr: Examiner la normalisation des fichiers
pt_br: Revisar a normalização do arquivo

source: Automate an Archivematica pipeline
fr: Automatiser un pipeline Archivematica
pt_br: Automatizar um pipeline Archivematica

source: *On this page:*
fr: *Sur cette page :*
pt_br: *Nesta página:*

source: :ref:`Task #0 - Set up your Archivematica test instance <quick-start-install>`
fr: :ref:`Tâche #0 - Installer votre espace d’essai Archivematica <quick-start-install>`
pt_br: :ref:`Tarefa nº 0 - Configurar sua instância de teste do Archivematica <quick-start-install>`

source: :ref:`Task #1 - Start a standard transfer <quick-start-transfer>`
fr: :ref:`Tâche #1 - Commencer un transfert standard <quick-start-transfer>`
pt_br: :ref: `Tarefa nº 1 - Iniciar uma transferência padrão <quick-start-transfer>`

source: :ref:`Task #2 - Make AIPs and DIPs <quick-start-ingest>`
fr: :ref:`Tâche #2 - Création d’AIP et de DIP <quick-start-ingest>`
pt_br: :ref: `Tarefa nº 2 - Fazer AIPs e DIPs <quick-start-ingest>`

source: :ref:`Task #3 - Store AIPs and DIPs <quick-start-storage>`
fr: :ref:`Tâche #3 - Stockage des AIP et des DIP <quick-start-storage>`
pt_br: :ref: `Tarefa nº 3 - Armazenar AIPs e DIPs <quick-start-storage>`

source: :ref:`Task #4 - Review AIPs and DIPs <quick-start-review>`
fr: :ref:`Tâche #4 - Examen des AIP et des DIP <quick-start-review>`
pt_br: :ref: `Tarefa nº 4 - Revisar os AIPs e DIPs<quick-start-review>`

source: :ref:`Task #5 - Automate workflow through configuration <quick-start-config>`
fr: :ref:`Tâche #5 – Automatisation du déroulement des opérations au moyen d’une configuration <quick-start-config>`
pt_br: :ref:``Tarefa nº 5 - Automatizar o fluxo de trabalho através da configuração <quick-start-config>`

source: :ref:`More ways to get familiar with Archivematica <quick-start-resources>`
fr: :ref:` Autres façons de s’initier à Archivematica <quick-start-resources>`
pt_br: ref: `Mais maneiras de se familiarizar com o Archivematica<quick-start-resources>`

source: Task #0 - Set up your Archivematica test instance
fr: Tâche #0 – Installer votre espace d’essai Archivematica
pt_br: Tarefa nº 0 - Configurar sua instância de teste do Archivematica

source: If you do not have access to a full installation of Archivematica, there are two options for testing the software - the hosted Archviematica sandbox or a locally-installed Archivematica VM.
fr: Si vous n’avez pas accès à la version intégrale d’Archivematica, vous pouvez procéder de l’une de deux façons pour faire l’essai du logiciel : le bac à sable Archivematica hébergé ou une machine virtuelle (VM) Archivematica installée localement.
pt_br: Se você não tiver acesso a uma instalação completa do Archivematica, há duas opções para testar o software: a sandbox hospedada do Archviematica ou uma máquina virtual com o Archivematica instalada localmente.

source: Using the sandbox
fr: Utilisation du bac à sable
pt_br: Usando a sandbox

source: Artefactual maintains an `Archivematica sandbox <http://sandbox.archivematica.org/>`_ with the following credentials:
pt_br: A Artefactual mantém uma `sandbox do Archivematica <http://sandbox.archivematica.org/>`_ com as seguintes credenciais:

source: Username: demo@example.com
fr: Nom d'utilisateur: demo@example.com
pt_br: Nome de usuário: demo@example.com

source: Password: demodemo
fr: Mot de passe: demodemo
pt_br: Senha: demodemo

source: The sandbox is provided as an easy way to test the latest release of Archivematica. Please note that the website will automatically reset daily. Any packages that you create will not be permanently saved. Additionally, there may be more than one demo user logged in at the same time, so you may see changes made by others while you are using the software.
fr: Le bac à sable permet de mettre à l’essai la version la plus récente d’Archivematica. Veuillez noter que le site Web est réinitialisé automatiquement tous les jours. Les paquets que vous créez ne seront pas conservés en permanence. Il est également possible qu’un autre utilisateur en fasse l’essai en même temps que vous, c’est pourquoi vous verrez peut-être les changements apportés par d’autres utilisateurs lorsque vous utilisez le logiciel.
pt_br: A sandbox é fornecida como uma maneira fácil de testar a última versão do Archivematica. Por favor, note que o site será redefinido automaticamente diariamente. Todos os pacotes que você irá criar não serão salvos permanentemente. Além disso, pode haver mais de um usuário demo logado ao mesmo tempo, portanto, você poderá ver as alterações feitas por outras pessoas enquanto estiver usando o software.

source: The demo site is publicly edited and unmoderated. For security, test transfers are limited to Artefactual's provided sample data. Users who wish to test using their own data may download the Vagrant box (described below) and test locally.
fr: Le site de démonstration est modifié en direct et n’est pas modéré. À des fins de sécurité, les transferts d’essai sont restreints aux échantillons de données que fournit Artefactual. Les utilisateurs qui désirent mettre à l’essai leurs propres données peuvent télécharger le bac Vagrant (voir ci-dessous) et effectuer des essais localement.
pt_br: O site demo é publicamente editado e não moderado. Por segurança, as transferências de teste são limitadas aos dados de amostra fornecidos pela Artefactual. Os usuários que desejam testar usando seus próprios dados podem baixar a caixa Vagrant (descrita abaixo) e testar localmente.

source: If you are using the sandbox, you can move on to Task #1.
fr: Si vous utilisez le bac à sable, vous pouvez passer à la Tâche #1.
pt_br: Se você estiver usando a sandbox, poderá seguir para a Tarefa nº 1.

source: Installing on a virtual machine using Vagrant
fr: Installation sur une machine virtuelle utilisant Vagrant
pt_br: Instalação em uma máquina virtual usando o Vagrant

source: This virtual machine is **not** intended to be used in production. It targets developers or experienced users willing to try out Archivematica using Vagrant. If you want to start using Archivematica in production, please refer to the other methods of installations explained under this manual.
fr: Cette machine virtuelle **n'est pas** destinée à être utilisée en production. Elle s'adresse aux développeurs ou utilisateurs expérimentés désireux d'essayer Archivematica en utilisant Vagrant. Si vous voulez commencer à utiliser Archivematica en production, veuillez vous référer aux autres méthodes d'installation expliquées dans ce manuel.
pt_br: Esta máquina virtual **não é** destinada a ser usada na produção. Tem como alvo desenvolvedores ou usuários experientes dispostos a experimentar o Archivematica usando o Vagrant. Se você quiser começar a usar o Archivematica em produção, consulte os outros métodos de instalação explicados neste manual.

source: This guide will setup a new Oracle `VirtualBox <https://www.virtualbox.org/>`__ virtual machine with Archivematica installed on your computer. It works on most operating systems, including MacOS X, Linux, Windows, FreeBSD and others.
pt_br: Este guia instalará em seu computador uma nova máquina virtual Oracle `VirtualBox <https://www.virtualbox.org/>`__ com o Archivematica instalado. Ele funciona na maioria dos sistemas operacionais, incluindo MacOS X, Linux, Windows, FreeBSD entre outros.

source: **Minimum system requirements**: 4GB RAM; 10GB disk space.
pt_br: **Requisitos mínimos de sistema**: 4GB de RAM; 10GB de espaço em disco.

source: Install Vagrant and VirtualBox
fr: Installer Vagrant et VirtualBox
pt_br: Instale o Vagrant e o VirtualBox

source: Install VirtualBox from https://www.virtualbox.org/ (or use your package manager). VirtualBox 5.1.18 or newer is required.
fr: Installez VirtualBox à partir du site https://www.virtualbox.org/ (ou utilisez votre gestionnaire de progiciels). VirtualBox 5.1.18 ou plus récent est requis.
pt_br: Instale o VirtualBox em https://www.virtualbox.org/ (ou use o gerenciador de pacotes). VirtualBox 5.1.18 ou mais recente é obrigatório.

source: Install Vagrant from http://www.vagrantup.com/ (or use your package manager). Vagrant 1.9.3 or newer is required. Be aware that Ubuntu 14.04 installs Vagrant 1.4.3, which does not meet the requirements.
fr: Installez Vagrant à partir du site http://www.vagrantup.com/ (ou utilisez votre gestionnaire de progiciels). Vagrant 1.9.3 ou plus récent est requis. Sachez qu'Ubuntu 14.04 installe Vagrant 1.4.3, lequel ne répond pas aux exigences.
pt_br: Instale o Vagrant em http://www.vagrantup.com/ (ou use o gerenciador de pacotes). O Vagrant 1.9.3 ou mais novo é obrigatório requerido. Esteja ciente de que o Ubuntu 14.04 instala o Vagrant 1.4.3, que não atende aos requisitos.

source: Spin it up
pt_br: Executar

source: using your computer's command-line interface, create a new directory and open it. The location doesn't matter, but you'll need to return to it later - all further command line operations should be run from inside the directory.
fr: En utilisant l'interface de ligne de commande de votre ordinateur, créez un nouveau répertoire et ouvrez-le. L'emplacement n'a pas d'importance, mais vous devrez y revenir plus tard - toutes les autres opérations de la ligne de commande doivent être exécutées à partir du répertoire.
pt_br: Usando a interface de linha de comando do seu computador, crie um novo diretório e abra-o. A localização não importa, mas você precisará retornar a ela mais tarde - todas as outras operações de linha de comando devem ser executadas dentro do diretório.

source: Initialize the current directory to be a Vagrant environment.
fr: Initialiser le répertoire courant pour qu'il soit dans l'environnement Vagrant.
pt_br: Inicialize o diretório atual para ser um ambiente Vagrant.

source: Run Vagrant (again, from the same directory where you saved the Vagrantfile).
fr: Exécutez Vagrant (encore une fois, à partir du même répertoire où vous avez enregistré le fichier Vagrant).
pt_br: Execute o Vagrant (novamente, no mesmo diretório em que você salvou o Vagrantfile).

source: Vagrant will download our custom box and boot it in VirtualBox. The download can take anywhere from a few minutes to an hour or more, depending on the speed of your connection, as the box is fairly large (approx 3.2 GB in size).
fr: Vagrant va télécharger notre boîte personnalisée et l'initialiser dans VirtualBox. Le téléchargement peut durer de quelques minutes à une heure ou plus, selon la vitesse de votre connexion, car la taille de la boîte est plutôt importante (environ 3,2 Go).
pt_br: O Vagrant baixará nossa caixa personalizada e inicializará no VirtualBox. O download pode levar de alguns minutos a uma hora ou mais, dependendo da velocidade da sua conexão, pois a caixa é bastante grande (aproximadamente 3,2 GB de tamanho).

source: This will take a while. It depends on your computer, but it could take up to an hour. Your computer may be very slow while Archivematica is being provisioned - be sure to save any work and be prepared to step away from your computer while Archivematica is building.
pt_br: Isto levará algum tempo. Depende de seu computador, mas pode levar até uma hora. Seu computador pode ficar muito lento enquanto o Archivematica estiver sendo provisionado - certifique-se de salvar qualquer trabalho e esteja preparado para afastar-se de seu computador enquanto o Archivematica é instalado.

source: Once it's done provisioning, you can log in to your virtual machine::
fr: Lorsque l’assemblage est terminé, vous pouvez accéder à votre machine virtuelle :
pt_br: Uma vez feito o provisionamento, você pode efetuar login na sua máquina virtual::

source: You can also access your Archivematica instance through the web browser:
fr: Vous pouvez également accéder à votre milieu Archivematica à l’aide de votre navigateur :
pt_br: Você também pode acessar sua instância do Archivematica por meio do navegador da Web:

source: Archivematica: `<http://10.10.10.20>`_. Username & password configured on installation.
fr: Archivematica: `<http://10.10.10.20>`_. Nom d'utilisateur et mot de passe configurés durant l'installation.
pt_br: Archivematica: `<http://10.10.10.20>` _. Nome de usuário e senha configurados na instalação.

source: Storage Service: `<http://10.10.10.20:8000>`_. Username & password configured on installation.
pt_br: Storage Service: `<http://10.10.10.20:8000>`_. Usuário e senha configurados durante a instalação.

source: To get the Storage Service API key, go to `<http://10.10.10.20:8000>`_ and click on the Administration tab. In the left sidebar, click on *Users*, then click on *Edit* for the default user. Scrolling down, you will see the API key for the default user at the bottom of the screen. Copy this into the API key field when prompted during installation.
fr: Pour obtenir la clé API du Service de stockage, allez à `<http://10.10.10.20:8000>`_ et cliquez sur l’onglet Administration. Dans la barre latérale gauche, cliquez sur Utilisateurs, et ensuite sur Modifier pour trouver l’utilisateur par défaut. Défilez vers le bas et vous trouverez la clé API de cet utilisateur en bas de l’écran. Copiez-la dans le champ de la clé API lorsque vous serez invité à le faire durant l'installation.
pt_br: Para pegar a chave API do Storage Service acesse `<http://10.10.10.20:8000>`_ e clique no link Administração. Na barra lateral esquerda, clique em *Usuários*, e então clique em *Editar* para o usuário padrão. Rolando para baixo na tela, você verá a chave API para o usuário padrão, na parte inferior da tela. Copie-a para o campo chave API quando solicitado durante a instalação.

source: Task #1 - Start a standard transfer
fr: Tâche #1 – Commencer un transfert standard
pt_br: Tarefa nº 1 - Iniciar uma transferência padrão

source: A transfer is any set of one or more files that you decide to process as a group. It can come from any storage system to which Archivematica has been connected. To start your first transfer, go to the Archivematica transfer dashboard - the main page of either the `sandbox <sandbox.archivematica.org>`_ or your `Archivematica VM <http://10.10.10.20>`_. You can also access the transfer page by clicking on the Transfer tab in your Archivematica instance.
fr: Un transfert représente un ensemble d’un ou de plusieurs fichiers que vous décidez de traiter comme groupe. Il peut provenir de n’importe quel système de stockage auquel est connecté Archivematica. Pour commencer votre premier transfert, allez au Tableau de bord de transfert Archivematica – à savoir la page d’accueil du `bac à sable <sandbox.archivematica.org>`_ ou de votre `VM Archivematica <http://10.10.10.20>`_. Vous pouvez également accéder à la page des transferts en cliquant sur l’onglet Transfert de votre milieu Archivematica.
pt_br: Uma transferência é qualquer conjunto de um ou mais arquivos que você decidiu processar como um grupo. Pode vir de qualquer sistema de armazenamento ao qual o Archivematica esteja conectado. Para iniciar sua primeira transferência, acesse o dashboard de transferência do Archivematica - a página principal, tanto na `sandbox <sandbox.archivematica.org>`_ quanto em sua `máquina virtual com Archivematica <http://10.10.10.20>`_. Você também pode acessar a página de transferência clicando no link Transferência em sua instância do Archivematica.

source: The transfer process is made up of a series of micro-services, which are in turn made up of jobs.
fr: Le processus de transfert est constitué d’une série de microservices, qui sont à leur tour constitués de travaux.
pt_br: O processo de transferência é formado por uma série de microsserviços, que, por sua vez, estão divididos em tarefas.

source: A micro-service is a group of actions that accomplish a specific goal within Archivematica. Verifying that your transfer complies with Archivematica's transfer requirements is a micro-service.
fr: Un microservice est un groupe d’actions qui a un but spécifique dans Archivematica. Vérifier si votre transfert est conforme aux exigences de transfert d’Archivematica est un microservice.
pt_br: Um microsserviço é um grupo de ações efetuadas para atingir um objetivo específico no Archivematica. A verificação se sua transferência atende as requisitos de transferência do Archivematica é um microsserviço.

source: A job is a discrete action within a micro-service. Moving the contents of your transfer to a processing directory is a job.
fr: Un travail est une action distincte d’un microservice. Est donc un travail, l’action de déplacer le contenu de votre transfert vers un répertoire de traitement.
pt_br: Uma tarefa é uma ação discreta dentro de um microsserviço. Mover os conteúdos de sua transferência para um diretório de processamento é uma tarefa.

source: Each micro-service can be expanded if you click on the micro-service name. This allows you to see every job that makes up the micro-service. You can view the command for each job by clicking on the gear icon to the right of each job name which will open a new window that lists the command information. Clicking on *Show arguments* will list the exact python command that Archivematica uses to run the job.
fr: Chaque microservice peut être développé en cliquant sur le nom du microservice. Vous pouvez ainsi voir tous les travaux de ce microservice. Vous pouvez visualiser la commande de chaque travail en cliquant sur l’icône d’engrenage, à droite du nom du travail, qui ouvrira une nouvelle fenêtre contenant l’information sur les commandes. En cliquant sur *Show arguments*, vous verrez la commande Python qu’utilise Archivematica pour exécuter le travail.
pt_br: Cada microsserviço pode ser expandido se você clicar no nome do microsserviço. Isto permite que você veja cada tarefa que forma o microsserviço. Você pode ver o comando de cada tarefa clicando no ícone de engrenagem à direita de cada nome de tarefa, que abrirá uma nova janela que listará informações do comando. Ao clicar em *Mostar argumentos* será listado o comando python exato que o Archivematica usa para executar a tarefa.

source: Jobs turn green when they have completed successfully and red if they fail.
fr: Les travaux deviennent verts lorsqu’ils ont été exécutés correctement, et rouges dans le cas contraire.
pt_br: A tarefa fica verde se completada com sucesso, e vermelha se falhar.

source: **Steps:**
fr: **Étapes :**
pt_br: **Passos:**

source: Make sure ‘Standard’ is selected in the transfer type box.
fr: Assurez-vous de sélectionner ‘Standard’ dans la case type de transfert.
pt_br: Certifique-se que 'Padrão' está selecionado na caixa de tipo de transferência.

source: Type in a name for your transfer (anything you like).
fr: Saisissez un nom pour votre transfert (à votre guise).
pt_br: Digite um nome para sua transferência (qualquer coisa que desejar).

source: Click on browse to look through the available content. Make sure to click on the folder icon to expand the directory trees.
fr: Cliquez sur naviguer pour examiner le contenu disponible. Assurez-vous de cliquer sur l’icône dossier pour développer les arborescences de répertoires.
pt_br: Clique em Pesquisar para navegar pelo conteúdo disponível. Certifique-se de clicar no ícone de pasta para expandir as árvores de diretórios.

source: Find the *images* directory in SampleTransfers and click Add.
fr: Cherchez le répertoire *images* dans SampleTransfers, et cliquez ensuite sur Ajouter.
pt_br: Encontre o diretório *images* dentro de SampleTransfers e clique em Adicionar.

source: The selected directory will be displayed below the selection box.
fr: Le répertoire sélectionné s’affichera sous la case de sélection.
pt_br: O diretório selecionado será exibido abaixo da caixa de seleção.

source: Click on the green *Start transfer* button to start the transfer.
fr: Cliquez sur le bouton vert *Commencer le transfert* pour lancer le transfert.
pt_br: Clique no botão verde *Iniciar transferência* para inciar a transferência.
