Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/quick-start/quick-start.po
Languages: fr, pt_br

source: In a moment, another decision point will prompt you to select a storage location for your AIP. There should only be one option - "Store AIP in standard Archivematica directory". Select this option.
fr: Dans quelques instants, un autre point de décision vous invitera à sélectionner un lieu de stockage pour votre AIP. Une seule option devrait s’afficher, à savoir « Stocker l’AIP dans le répertoire standard Archivematica ». Sélectionnez cette option.
pt_br: Após algum tempo, outro ponto de decisão solicitará que você selecione um local de armazenamento para seu AIP. Deve haver apenas uma opção - "Armazenar o AIP no diretório padrão do Archivematica". Selecione esta opção.

source: Once the AIP is stored successfully, you can move on to dealing with the DIP. Neither a locally-installed Archivematica VM nor the sandbox is hooked up to an access system, so under *Upload DIP* select "Store DIP".
fr: Lorsque l’AIP a été stocké correctement, vous pouvez maintenant passer au DIP. Comme il n’y a pas de VM Archivematica locale ni de bac à sable connecté à un système d’accès, sélectionnez « Stocker le DIP » sous *Télécharger le DIP*.
pt_br: Uma vez que o AIP tenha sido armazenado com sucesso, você pode começar a lidar com o DIP. Nem uma máquina virtual com Archivematica, nem a sandbox estão ligados a um sistema de acesso, então em *Fazer upload do DIP* selecione "Armazenar DIP".

source: You will be prompted to select a storage location for your DIP. There should only be one option - "Store DIP in standard Archivematica directory". Select this option.
fr: Vous serez invité à sélectionner un lieu de stockage pour votre DIP. Une seule option devrait s’afficher, à savoir «Stocker le DIP dans le répertoire standard Archivematica ». Sélectionnez cette option.
pt_br: Será solicitado que você selecione um local de armazenamento para seu DIP. Deve haver somente uma opção - "Armazenar o DIP no diretório padrão do Archivematica". Selecione esta opção.

source: Your AIP and DIP are now stored in Archivematica's internal storage. The Archivematica workflow is complete!
fr: Vos AIP et DIP sont maintenant stockés dans l’unité de stockage interne d’Archivematica. Le déroulement des opérations d’Archivematica est maintenant terminé!
pt_br: Seus AIP e DIP estão agora armazenados no armazenamento interno do Archivematica. O fluxo de trabalho do Archivematica está completo!

source: Task #4 - Review AIPs and DIPs
fr: Tâche #4 - Examen des AIP et des DIP
pt_br: Tarefa nº 4 - Revisar AIPs e DIPs

source: Now that your AIP and DIP have been stored, they can be reviewed.
fr: Maintenant que votre AIP et votre DIP sont stockés, vous pouvez les examiner.
pt_br: Agora que seus AIP e DIP foram armazenados, eles podem ser revisados.

source: Review AIP
fr: Examen de l'AIP
pt_br: Revisar o AIP

source: Click on the Archival Storage tab. You should see your AIP listed in the search results there, but if not, you can search for it using the name you gave it in Task #1.
fr: Cliquez sur l’onglet Dossier de stockage des archives. Votre AIP devrait être affiché dans les résultats de recherche, mais s’il n’y figure pas, effectuez une recherche en utilisant le nom que vous lui avez attribué à la Tâche #1.
pt_br: Clique no atalho Armazenamento Arquivístico. Você deve ver seu AIP listado nos resultados da busca nesta janela, mas se não vir, pode procurar por ele usando o nome que você deu a ele na Tarefa nº 1.

source: Depending on the version of Archivematica you are using, clicking on the name of the AIP will either open the AIP Details page or immediately download the AIP. If you end up on the AIP Details page, click on the ‘download’ button.
fr: Selon la version Archivematica que vous utilisez, lorsque vous cliquez sur le nom de l’AIP, la page Détails de l'AIP s’ouvrira ou l’AIP sera téléchargé immédiatement. Si vous vous trouvez sur la page Détails de l'AIP, cliquez sur le bouton « télécharger ».
pt_br: Dependendo da versão do Archivematica que você estiver usando, ao clicar no nome do AIP será aberta a página de detalhes do AIP ou será feito o download imediato do AIP. Se você acabar na página de detalhes do AIP, clique no botão 'download'.

source: Once it's downloaded, open the AIP. You will need to a program capable of opening 7zip files installed on your computer. If required, you can download 7Zip here: http://www.7-zip.org/download.html
fr: Ouvrez l’AIP après le téléchargement. Votre ordinateur doit être doté d’un programme ayant la capacité d’ouvrir des fichiers 7zip. Si nécessaire, vous pouvez télécharger 7Zip ici : http://www.7-zip.org/download.html
pt_br: Uma vez que o download tenha finalizado, abra o AIP. Você precisará ter um programa capaz de abrir arquivos 7zip instalado em seu computador. Se necessário, você pode fazer o download do programa 7zip aqui: http://www.7-zip.org/download.html

source: Once you have the AIP extracted, navigate through the folders until you find the objects directory. This directory contains the original images from your transfer as well as the preservation copies. You can compare the file formats in the objects directory to the rules in the Preservation Planning tab.
fr: Lorsque l’AIP a été extrait, naviguez dans les dossiers jusqu’à ce que vous trouviez le répertoire des objets. Ce répertoire contient les images originales de votre transfert et les copies de préservation. Vous pouvez comparer les formats de fichier du répertoire d’objets avec les règles qui se trouvent dans l’onglet Planification de la préservation.
pt_br: Uma vez que você tenha extraído o AIP, navegue pelas pastas até encontrar o diretório objects. Este diretório contém as imagens originais de sua transferência, bem como as cópias de preservação. Você pode comparar os formatos de arquivo no diretório objects com as regras na janela Plano de Preservação.

source: Navigate through the folders until you find the METS file and open it in a web browser or text editor. It will be titled something like "METS.7e58760a-e357-4165-9428-26f5bb2ba8ee.xml".
fr: Consultez les dossiers jusqu’à ce que vous trouviez le fichier METS et ouvrez-le dans un navigateur ou un éditeur de texte. Son nom ressemblera à « METS.7e58760a-e357-4165-9428-26f5bb2ba8ee.xml ».
pt_br: Navegue pelas pastas até encontrar o arquivo METS, e abra-o em um navegador de internet ou editor de texto. Será algo com o título semelhante a "METS.7e58760a-e357-4165-9428-26f5bb2ba8ee.xml".

source: Find the <mets:fileSec> tag in the METS. Within the fileSec, you should be able to find information about every item in your original transfer - these are in the section tagged <mets:fileGrp USE="original">. Scrolling down, you can view complementary information for each of the preservation copies - this is in the section tagged <mets:fileGrp USE="preservation">.
fr: Trouvez le marqueur <mets:fileSec> dans le METS. Dans le fileSec, vous devriez pouvoir trouver de l’information sur tous les éléments de votre transfert original. Ils se trouvent dans la section marquée <mets:fileGrp USE=”original”>. Lorsque vous défilez vers le bas, vous pouvez voir de l’information complémentaire pour chaque copie de préservation. Il s’agit de la section marquée <mets:fileGrp USE=”preservation”>.
pt_br: Encontre a tag <mets:fileSec> no METS. Dentro de fileSec, você deve encontrar informações sobre cada item em sua transferência original - eles estarão na seção com a tag <mets:fileGrp USE="original">. Rolando para baixo na tela, você poderá ver informações complementares para cada uma das cópias para preservação - elas estarão na seção com a tag <mets:fileGrp USE="preservation">.

source: The METS.xml file is very long because it contains all of the information about your files as well as information about the processes and tools that acted on those original files. For more information about the contents and structure of the METS file, check out the `Archivematica wiki <https://wiki.archivematica.org/METS>`_.
fr: Le fichier METS.xml est très long, parce qu’il contient toute l’information de vos fichiers, ainsi que des procédés et outils qui sont intervenus dans ces fichiers originaux. Pour en savoir plus sur le contenu et la structure du fichier METS, consultez le `wiki Archivematica <https://wiki.archivematica.org/METS>`_.
pt_br: O arquivo METS.xml é muito grande porque contém todas as informações sobre seus arquivos, bem como informações sobre os processos e ferramentas que atuaram nos arquivos originais. Para maiores informações sobre o conteúdo e estrutura do arquivo METS, consulte o `Archivematica wiki <https://wiki.archivematica.org/METS>`_.

source: Review DIP
fr: Examen du DIP
pt_br: Revisar o DIP

source: This section is only applicable to those using a VM. The Archivematica sandbox does not allow access to the Storage Service.
fr: Cette section ne s’applique que si vous utilisez une VM, puisque le bac à sable Archivematica interdit l’accès au Service de stockage.
pt_br: Esta seção é aplicável somente a quem estiver usando uma máquina virtual. A sandbox do Archivematica não permite acesso ao Storage Service.

source: In order to retrieve the DIP, you need to access the Archivematica Storage Service. Add ":8000" to the end of your Archivematica VM's URL (i.e. http://10.10.10.20:8000/).
pt_br: Para acessar o DIP, você terá de acessar o Storage Service do Archivematica. Adicone ":8000" ao final da URL de sua máquina virtual com Archivematica (ou seja, http://10.10.10.20:8000/).

source: In the Storage Service, click on the Packages tab.
fr: Dans le Service de stockage, cliquez sur l’onglet Paquets.
pt_br: No Storage Service, clique no link Pacotes.

source: On the far right side of the page there is a search box. Search for your DIP by entering the name you gave it in Task #1.
fr: Il y a une boîte de recherche à l’extrême droite de la page. Cherchez votre DIP en saisissant le nom que vous lui avez attribué à la Tâche #1.
pt_br: Bem à direita na página há uma caixa de busca. Procure pelo seu DIP inserindo o nome que você deu na Tarefa nº 1.

source: You should see two results. One is your AIP and the other is the DIP, indicated under the "Type" column.
fr: Deux résultats devraient être affichés : votre AIP et votre DIP, dans la colonne « Type ».
pt_br: Você deverá ver dois resultados. Um é seu AIP, e o outro seu DIP, indicados sob a coluna "Tipo".

source: Once you've identified which file is your DIP, click on "Download".
fr: Après avoir déterminé le fichier correspondant à votre DIP, cliquez sur « Télécharger ».
pt_br: Uma vez que você tenha identificado qual arquivo é seu DIP, clique em "Download".

source: Once it's downloaded, open the DIP. You will need to a program capable of opening tar files installed on your computer. 7Zip, mentioned above, can open TAR files: http://www.7-zip.org/download.html
fr: Une fois téléchargé, ouvrez le DIP. Votre ordinateur doit être doté d’un programme ayant la capacité d’ouvrir des fichiers TAR. 7Zip, peut ouvrir ce genre de fichiers : http://www.7-zip.org/download.html
pt_br: Uma vez finalizado o download, abra o DIP. Você precisará ter um programa capaz de abrir arquivos TAR instalado em seu computador. O programa 7zip, mencionado anteriormente, consegue abrir arquivos TAR: http://www.7-zip.org/download.html

source: Once you have the DIP extracted, open the objects directory. This directory contains the access copies derived from your original images. You can compare the file formats in the objects directory to the rules in the Preservation Planning tab.
fr: Après avoir extrait le DIP, ouvrez le répertoire d’objets, qui contient les copies d’accès créés à partir de vos images originales. Vous pouvez comparer les formats de fichiers du répertoire d’objets avec les règles qui se trouvent dans l’onglet Planification de la préservation.
pt_br: Uma vez que você tenha extraído o DIP, abra o diretório objects. Este diretório contém as cópias de acesso derivadas de suas imagens originais. Você pode comparar os formatos de arquivo no diretório objects com as regras na janela Plano de Preservação.

source: The DIP also contains a thumbnails directory, which has small JPG versions of your images. If the image could not be converted to a JPG (as is the case with an SVG file), a generic icon is included instead.
fr: Le DIP contient également un répertoire de vignettes, soit de petites versions JPG de vos images. Si l’image n’a pu être convertie en format JPG (comme dans le cas des fichiers SVG), une icône générique est alors insérée.
pt_br: O DIP também contém um diretório de miniaturas - thumbnails, que são pequenas versões JPG de suas imagens. Se a imagem não puder ser convertida para JPG (como no caso de um arquivo SVG), um ícone genérico será incluído em seu lugar.

source: Task #5 - Automate workflow through configuration
fr: Tâche #5 – Automatisation du déroulement des opérations au moyen d’une configuration
pt_br: Tarefa nº 5 - Automatizar o fluxo de trabalho através da configuração

source: Clicking on the Administration tab opens up Archivematica's processing configurations screen, the most basic way of automating Archivematica. Each of the decision points that you encountered during the Archivematica test that you ran in Steps #1 to #3 can be automated on this page. This is mostly used if you know you will be making the same decision each time you encounter a decision point.
fr: En cliquant sur l’onglet Administration, vous ouvrez l’écran de configurations de traitement d’Archivematica, la façon la plus élémentaire d’automatiser Archivematica. Tous les points de décisions soulevés dans l’essai d’Archivematica, aux étapes 1 à 3, peuvent être automatisés ici. On l’utilise couramment lorsqu’on sait que la même décision sera prise pour un point de décision.
pt_br: Clicar no link Administração abre a tela de configurações de processamento do Archivematica, a forma mais básica de automatizar o Archivematica. Cada um dos pontos de decisão que você encontrou durante o teste do Archivematica que executou nas tarefas nº 1 a nº 3 podem ser automatizadas nesta página. Isto é mais usado se você souber que estará tomando a mesma decisão cada vez que encontrar determinado ponto de decisão.

source: Click on the Administration tab. You will see a single processing configuration listed, called ‘default’.
fr: Cliquez sur l’onglet Administration. Vous verrez une seule configuration de traitement appelée « par défaut ».
pt_br: Clique no link Administração. Você verá uma única configuração de processamento listada, chamada 'default'.

source: Review the different options and make changes as you like. You will recognize the options from the decision points you made during previous tasks.
fr: Examinez les différentes options et apportez les changements nécessaires. Vous reconnaîtrez les options d’après les points de décisions des tâches antérieures.
pt_br: Revise as diferentes opções e faça mudanças conforme desejar. Você reconhecerá as opções dos pontos de decisão que você tomou durante as tarefas anteriores.

source: For example, you may want to automate the compression algorithm and level because you always want to use the same compression tool and you always want to compress packages at the same rate. To set the compression-related processing configurations:
fr: Exemple : vous désirez automatiser l’algorithme et le niveau de compression, parce que vous désirez toujours utiliser le même outil de compression et le même niveau de compression pour vos paquets. Pour régler les configurations de traitement de la compression :
pt_br: Por exemplo, você pode desejar automatizar o algoritmo e nível de compactação, porque você sempre deseja usar a mesma ferramenta de compactação, e você sempre deseja compactar os pacotes à mesma taxa. Para definir as configurações de processamento relacionadas à compactação:

source: Check the box next to *Select compression algorithm*.
fr: Cochez la case à côté de *Sélectionner l'algorithme de compression*.
pt_br: Ative a caixa próxima a "Selecionar algoritmo de compactação".

source: Using the dropdown to the right, select a compression algorithm - *7z using bzip2* is the most common.
fr: Dans le menu déroulant de droite, sélectionnez un algorithme de compression - *7z using bzip2* est celui qui est le plus couramment utilisé.
pt_br: Usando a caixa de seleção à direita, selecione o algoritmo de compactação - *7z usando bzip2* é o mais comum.

source: Check the box next to *Select compression level*
fr: Cochez la case à côté de *Sélectionnez le niveau de compression*
pt_br: Ative a caixa próxima a "Selecione o nível de compactação".

source: Using the dropdown to the right, select a compression level - *5 - normal compression mode* is a good balance between speed and size.
fr: Dans le menu déroulant de droite, sélectionnez un niveau de compression - *5 - mode de compression normal* donne un bon équilibre entre la vitesse et la taille.
pt_br: Usando a caixa de seleção à direita, selecione o nível de compactação - *5 - modo de compactação normal* oferece um bom equilíbrio entre velocidade e tamanho.

source: We recommend that you run several tests in Archivematica before setting up the processing configurations. As you become more familiar with Archivematica, you will begin to recognize which decisions you make over and over again. These are great candidates for automation via the processing configurations.
fr: Il est recommandé d’effectuer plusieurs essais dans Archivematica avant de paramétrer les configurations de traitement. Lorsque vous connaîtrez mieux Archivematica, vous reconnaîtrez les points de décisions répétitifs, que vous pourrez alors automatiser au moyen de configurations de traitement.
pt_br: Recomendamos que você execute diversos testes no Archivematica antes de definir as configurações de processamento. Conforme ficar mais familiarizado com o Archivematica, você começará a reconhecer quais decisões toma repetidamente. Estes são ótimos candidatos à automação através das configurações de processamento.

source: More ways to get familiar with Archivematica
fr: Autres façons de s’initier à Archivematica
pt_br: Mais formas de se familiarizar com o Archivematica

source: This tutorial covers a very basic Archivematica workflow. For information about processing more complex content, see the :ref:`User manual <user-manual>`.
fr: Ce tutoriel couvre un déroulement d’opérations élémentaire dans Archivematica. Pour vous renseigner sur la manière de traiter du contenu plus complexe, veuillez consulter le :ref:`Guide de l’utilisateur <user-manual>`.
pt_br: Este tutorial aborda um fluxo de trabalho bem básico do Archivematica. Para informações sobre o processamento de conteúdo mais complexo, consulte o :ref:`Manual do Usuário <user-manual>`.

source: The tasks above are based on the Archivematica Worksheet first developed by Justin Simpson for the HEAP-AIM25 Network Meeting in November 2016. The worksheet runs through several more examples of Archivematica workflows. It is available for download via the `Archivematica Camp Github repo <https://github.com/artefactual-labs/archivematica-camp>`_. Feel free to use this worksheet for personal use or in a teaching context - see the licence file in the repo.
fr: Les tâches ci-haut reposent sur Archivematica Worksheet qui avait été développé par Justin Simpson pour la HEAP-AIM25 Network Meeting en novembre 2016. La feuille de travail présente d’autres exemples de déroulements d’opérations dans Archivematica. Vous pouvez la télécharger à `Archivematica Camp Github repo <https://github.com/artefactual-labs/archivematica-camp>`_. N’hésitez pas à utiliser cette feuille de travail à des fins personnelles ou encore dans un contexte d’apprentissage – le fichier de licence est à la fin.
pt_br: As tarefas acima foram baseadas no Archivematica Worksheet feita por Justin Simpson para o HEAP-AIM25 Network Meeting em novembro de 2016. O documento descreve diversos outros exemplos de fluxo de trabalho do Archivematica. Está disponível para download no `repositório do Archivematica Camp no Github <https://github.com/artefactual-labs/archivematica-camp>`_. Sinta-se à vontade para usar esta worksheet para uso pessoal ou em um contexto de ensino - consulte o arquivo de licença no repositório.

source: :ref:`Back to the top <quick-start>`
fr: :ref:`Retour en haut de page <quick-start>`
pt_br: :ref:`Voltar ao topo <quick-start>`
