Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/user-manual/access/access.po
Languages: fr

source: Access
fr: Accès

source: When the DIP is prepared, Archivematica moves the DIP into the uploadDIP directory, which triggers the dashboard to display the DIP upload options to the operator. After a DIP is uploaded/stored, it is moved to the uploadedDIPs directory, which can be emptied in the Administration tab- see :ref:`Processing storage usage <dashboard-usage>`.
fr: Lorsque le DIP est prêt, il est déplacé par Archivematica dans le répertoire uploadDIP. Les options de téléchargement s'affichent alors dans le tableau de bord. Une fois le DIP téléchargé et entreposé, il est déplacé dans le répertoire uploadedDIPs. La gestion du contenu de ce répertoire se fait à partir du menu Administration, voir :ref:`Utilisation de l'espage de traitement <dashboard-usage>`.

source: The user must create the description in AtoM (or other access system) before uploading the DIP. The user will need to indicate part of the description's URL or a target collection in order to send the DIP to the appropriate place in the description.
fr: L'utilisateur doit créer la description archivistique dans AtoM (ou un autre système d'accès) avant de télécharger le DIP. Il devra inscrire l'URL de la description ou de la collection visée afin que le DIP soit lié à l'emplacement convenu dans la description.

source: Should you run into an error during this process, please see :ref:`Error handling <error-handling>`.
fr: Si une erreur survient à cette étape, veuillez vous référer à :ref:`Gestion d'erreur <error-handling>`.

source: :ref:`Upload DIP to ContentDM <dip-contentdm>`
fr: :ref:`Télécharger le DIP dans ContentDM <dip-contentdm>`

source: :ref:`Upload DIP metadata to Archivists' Toolkit <archivists-toolkit>`
fr: :ref:`Télécharger les métadonnées du DIP dans le module Archivists' Toolkit <archivists-toolkit>`

source: *On this page:*
fr: *Sur cette page:*

source: :ref:`Access systems <access-default>`
fr: :ref:`Système d'accès <access-default>`

source: :ref:`Upload DIP to AtoM <upload-atom>`
fr: :ref:`Télécharger le DIP dans AtoM <upload-atom>`

source: :ref:`Upload DIP to ArchivesSpace <upload-as>`
fr: :ref:`Télécharger le DIP dans ArchivesSpace <upload-as>`

source: :ref:`Upload DIP to Archivists' Toolkit <upload-at>`
fr: :ref:`Télécharger le DIP dans Archivists' Toolkit <upload-at>`

source: :ref:`Store DIP <store-dip>`
fr: :ref:`Entreposer le DIP <store-dip>`

source: :ref:`Review/Download DIP <review-dip>`
fr: :ref:`Vérifier/Télécharger le DIP <review-dip>`

source: :ref:`Access tab <access-tab>`
fr: :ref:`Menu Accès <access-tab>`

source: Access systems
fr: Systèmes d'accès

source: A content management tool called `AtoM <https://www.accesstomemory.org>`_ is Archivematica's default access system. AtoM supports standards-compliant hierarchical archival description and digital object management.
fr: Par défaut, le système d'accès d'Archivematica est `AtoM <https://www.accesstomemory.org>`_. Ce logiciel permet l'intégration de descriptions archivistiques selon les normes reconnues ainsi que la gestion d'objet numériques.

source: AtoM stands for Access to Memory. It is a web-based, open source application for standards-based archival description and access in a multilingual, multi- repository environment. User and Administrator manuals for AtoM are available `here <https://www.accesstomemory.org/en/docs/>`_ .
fr: AtoM signifie "Access to Memory" ou accès à la mémoire. C'est une application accessible en ligne, de type open-source, qui peut être utilisée en plusieurs langues et qui est compatible avec une variété d'entrepôts de données. Pour plus d'information, veuillez consulter les guides d'utilisation et de gestion `ici <https://www.accesstomemory.org/en/docs/>`_ .

source: Upload DIP to AtoM
fr: Télécharger le DIP dans AtoM

source: To upload DIPs to your AtoM instance, you must enter your AtoM information and credentials in the Administration tab. See :ref:`Administrator manual - AtoM DIP upload <admin-dashboard-atom>` for more information.
fr: Pour télécharger les DIP dans votre environnement AtoM, vous devez auparavant entrer les informations et identifiants qui s'y rapportent dans le menu Administration. Voir :ref:`Manuel de l'administrateur - Téléchargement du DIP dans AtoM <admin-dashboard-atom>` pour plus d'information.

source: You must create the target description in AtoM before uploading the DIP. You will need to indicate part of the description's URL or a target collection in order to send the DIP to the appropriate place during DIP upload.
fr: Vous devez créer la description de l'élément dans AtoM avant de télécharger le DIP, car l'URL de la description servira à définir l'emplacement du téléchargement du DIP.

source: In the ingest tab, select "Upload DIP to AtoM" in the Upload DIP Actions drop-down menu.
fr: À partir de l'onglet Ingestion, choisir "Télécharger un DIP dans AtoM" dans la liste déroulante des Actions de Téléchargement de DIP.

source: A dialogue box will appear. Enter the permalink of the description in the dialogue box.
fr: Une boîte de dialogue apparaîtra et vous devrez y ajouter le permalien de la description liée.

source: The permalink is the "slug" from the AtoM target description. See ``slug`` in the AtoM glossary.
fr: Le permalien correspond au terme de l'URL identifiant la description enregistrée dans AtoM. Voir aussi la définition du mot ``slug`` dans le glossaire d'AtoM.

source: Click the blue "Upload" button. Digital objects are uploaded as items within the description to which the DIP is being uploaded. If you want to create a child level of description under the target description, you must add the title of that level of description using the DC metadata template prior to normalization.
fr: Cliquer sur le bouton bleu "Téléchargement". Les objets numériques sont alors téléchargés en tant qu'éléments rattachés à la description du DIP. Si vous souhaitez créer un niveau inférieur de description, vous devez ajouter son titre selon le modèle de métadonnées Dublin Core (DC) avant de procéder à la normalisation.

source: If you are not already logged in to AtoM you will need to log in using your login credentials.
fr: Si vous n'aviez pas déjà une session ouverte dans AtoM, vous devrez vous alors authentifier.

source: The digital object is displayed in AtoM. Clicking on the image will open the uploaded object.
fr: L'objet numérique s'affiche alors dans AtoM. En cliquant sur l'image vous ouvrez l'objet téléchargé.

source: Upload metadata to AtoM
fr: Téléchargement de métadonnées dans AtoM

source: AtoM 2.4 or higher is required to use this workflow.
fr: La version 2.4 d'AtoM, ou une version plus récente, est requise pour l'utilisation de ce flux de travail.

source: The following AtoM-Archivematica workflows are not currently supported with this workflow:
fr: Ce flux de travail ne prend pas en compte les processus suivants entre AtoM et Archivematica:

source: Descriptive metadata: if descriptive metadata is included by csv or entering in the user interface, the metadata will not display in AtoM in this workflow.
fr: Métadonnées descriptives: dans ce flux de travail, les métadonnées descriptives inclues dans un fichier csv ou ajoutées dans l'interface de l'utilisateur ne s'afficheront pas dans AtoM.

source: SIPs with levels of description assigned using the :ref:`arranging for AtoM <hierarchical-dip>` workflow- the levels of description will be ignored in this workflow.
fr: Les SIP pour lesquels les niveaux de descriptions ont été assignés à partir de :ref:`traitement dans AtoM <hierarchical-dip>` verront les niveaux de descriptions être ignorés dans ce flux de travail.

source: Navigate to Archival Storage and search or browse for the AIP. Click on the name of the AIP, or "View".
fr: Allez dans le Dépôt d'archives pour rechercher l'AIP. Cliquer ensuite sur le nom de l'AIP ou sur "Visualiser".

source: Under "Actions," in the Upload DIP tab enter the slug of the AtoM description you wish to upload to.
fr: À partir du menu Actions, vous pourrez ajouter l'identifiant URL de la description visée dans AtoM sous Télécharger le DIP.

source: Upon successful upload, AtoM will have created a File level description for the AIP and an Item level description for each object.
fr: Une fois le téléchargement complété, AtoM aura généré une description au niveau du dossier pour l'AIP et une description au niveau de la pièce pour chaque objet.

source: Each item will have a generic thumbnail associated with it and digital object metadata about the original object, including filename, filesize, date uploaded, object and AIP UUIDs, format name, format version, format registry and key.
fr: Une vignette générique s'affichera, représentant chaque pièce, accompagnée des métadonnées de l'objet numérique telles que le nom de fichier, la taille du fichier, la date du téléchargement, les UUIDs de l'objet et de son AIP, le nom du format, la version du format, le registre du format et sa clé.

source: Upload DIP to ArchivesSpace
fr: Téléchargement du DIP dans ArchivesSpace

source: To upload DIPs to your ArchivesSpace instance, you must enter your ArchivesSpace information and credentials in the Administration tab. See :ref:`ArchivesSpace dashboard configuration <dashboard-AS>` for more information.
fr: Pour télécharger les DIP dans votre environnement ArchivesSpace, vous devez auparavant entrer les informations et identifiants qui s'y rapportent dans le menu Administration. Voir ::ref:`ArchivesSpace - Configuration du tableau de bord <dashboard-AS>` pour plus d'information.

source: Create a SIP using the :ref:`Transfer <transfer>` process as normal. During Normalization, choose one of the options that normalizes the package for access. During the Upload DIP micro-service, select Upload DIP to Archives Space. The Match page should automatically open.
fr: Créer le SIP en utilisant le processus régulier :ref:`Transfert <transfer>`. Lors de la Normalisation, sélectionner une option de normalisation de paquet pour l'accès. Puis, avec le microservice Téléchargement du DIP, sélectionner Télécharger le DIP dans ArchivesSpace. La page d'Assignation devrait s'afficher automatiquement.

source: Find the ArchivesSpace collection to which you would like to upload the DIP. By clicking on the name of the resource, you can drill down into the collection to upload the DIP at a lower level of description.
fr: Repérer la collection ArchivesSpaces dans laquelle vous souhaitez télécharger le DIP. En cliquant sur le nom de la ressource, vous pouvez parcourir la collection afin de sélectionner le niveau de description approprié pour télécharger le DIP.

source: When you have navigated to the level of description where you want to store the DIP, select *Assign DIP objects to this resource*.
fr: Sélectionnez *Assigner le DIP à cette ressource* lorsque vous êtes dans le niveau de description où vous souhaitez conserver le DIP.

source: When you are done pairing objects and resources, click on *Review matches.*
fr: Quand vous avez terminer l'association des objets avec leur ressources, cliquer sur *Revoir les assignations.*

source: To remove all pairs and restart, click on *Restart matching*.
fr: Pour retirer les combinaisons et reprendre le processus, cliquer sur *Réinitialiser l'assignation*.

source: If everything is correct, click on *Finish matching*.
fr: Si toutes les associations sont bonnes, cliquer sur *Terminer l'assignation*.

source: This will take you back to the Ingest tab, where you can finish ingesting the AIP.
fr: Ceci vous ramènera à l'onglet Ingestion où vous pourrez compléter l'ingestion de l'AIP.

source: Upload DIP to Archivists' Toolkit
fr: Téléchargement du DIP dans Archivist's Toolkit

source: To upload DIPs to your Archivists' Toolkit instance, you must enter your Archivists' Toolkit information and credentials in the Administration tab. See :ref:`Archivists' Toolkit dashboard configuration <dashboard-AT>` for more information.
fr: Pour télécharger les DIP dans votre environnement Archivists' Toolkit, vous devez auparavant entrer les informations et identifiants qui s'y rapportent dans le menu Administration. Voir :ref:`Archivists' Toolkit - Configuration du tableau de bord <dashboard-AT>` pour plus d'information.

source: Create a SIP using the :ref:`Transfer <transfer>` process as normal. During Normalization, choose one of the options that normalizes the package for access. During the Upload DIP micro-service, select Upload DIP to Archivists' Toolkit. The Match page should automatically open.
fr: Créer le SIP en utilisant le processus régulier :ref:`Transfert <transfer>`. Lors de la Normalisation, sélectionner une option de normalisation de paquet pour l'accès. Puis, avec le microservice Téléchargement du DIP, sélectionner Télécharger le DIP dans Archivists' Toolkit. La page d'Assignation devrait s'afficher automatiquement.

source: A page will open allowing the user to select the Archivists' Toolkit collection where the objects should be added. This page allows the user to match digital objects to resource components in Archivists' Toolkit.
fr: Une page s'affichera, vous permettant de choisir la collection à laquelle l'objet doit être ajouté dans Archivists' Toolkit. Cette page permet aussi l'assignation des objets numériques aux ressources présentes dans Archivists' Toolkit.

source: Archivematica will upload the DIP metadata to Archivists' Toolkit.
fr: Archivematica téléchargera les métadonnées du DIP dans Archivist's Toolkit.

source: Store DIP
fr: Entreposer le DIP

source: Archivematica also provides the option to store the DIP to a location that you have configured via the :ref:`Storage Service <storageservice:index>`. This can be configured to be a local server, NFS-mounted or another storage protocol such as DuraCloud.
fr: Archivematica permet aussi le stockage des DIP dans un emplacement que vous aurez configuré à l'aide de :ref:`Service d'entreposage <storageservice:index>`. La configuration peut se faire pour un serveur local, monté par NSF, ou un autre protocole de stockage tel que DuraCloud, par exemple.

source: To store a DIP:
fr: Pour entreposer le DIP:

source: Ensure that at least one DIP storage location has been configured in the :ref:`Storage Service <storageservice:index>`.
fr: Au moins un emplacement d'entreposage des DIP doit avoir été configuré sous :ref:`Service d'entreposage <storageservice:index>`.

source: Review/Download DIP
fr: Vérifier/Télécharger le DIP

source: Regardless of the access path chosen (an integrated access system, or storing the DIP) the dashboard will present the operator with the option of reviewing and downloading the DIP objects. When the Upload DIP micro-service is complete, a "review" link will appear:
fr: Sans égard au répertoire de destination retenu, que ce soit un système d'accès intégré ou l'entrepôt de DIP, le tableau de bord permettra de réviser et télécharger les objets DIP. Lorsque le microservice de téléchargement du DIP est complété un hyperlien "révision" s'affiche:

source: Access tab
fr: Menu Accès

source: By clicking the Access tab in the Dashboard, you can see a table showing all DIPs upload to AtoM including the URL, the associated AIP, the upload date and status, and the option to delete from the Access tab. Note that this link will delete the record of the DIP in the Access tab, not the actual DIP.
fr: À partir du Tableau de bord, vous pouvez accéder au menu Accès qui présente une liste de tous les DIPs téléchargés dans AtoM incluant leur URL, l'AIP associé, la date de téléchargement et le statut du DIP. Vous avez aussi l'option de supprimer l'enregistrement d'un DIP de la liste, mais cela ne supprime pas le DIP lui-même.

source: At this time, the Access tab only provides links to DIPs uploaded to AtoM, not to other access systems or DIPs that have been stored.
fr: Pour l'instant, le menu Accès présente seulement les liens pour les DIPs ayant été téléchargés dans AtoM. Un lien ne peut être fait avec d'autres systèmes d'accès ou avec un entrepôt de DIPs.

source: :ref:`Back to the top <access>`
fr: :ref:`Retour en haut de page <access>`
