Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/user-manual/access/contentdm.po
Languages: fr

source: Archivematica can prepare DIPS for upload to CONTENTdm. As of Archivematica version 1.4, no configuration with your CONTENTdm installation is necessary. Rather, Archivematica will prepare the DIP and allow you to download via the Dashboard or by SFTP to the server Archivematica is installed on.
fr: Archivematica peut préparer des DIP à télécharger dans CONTENTdm . Depuis la version 1.4 d’Archivematica il n’est plus nécessaire de configurer le CONTENTdm à l’installation. Archivematica prépare le DIP et permet le téléchargement depuis le Tableau de bord ou par SFTP vers le serveur sur lequel est hébergé Archivematica.

source: In Archivematica version 1.4, direct upload to CONTENTdm is no longer available. The process described below assumes the user will use `Project Client <http://www.contentdm.org/help6/projectclient/index.asp>`_ to upload DIPs to CONTENTdm.
fr: Dans la version 1.4 d’Archivematica , il n’est plus possible de télécharger du contenu directement dans CONTENTdm. La démarche décrite ci-dessous suppose que l’utilisateur se serve de `Project Client <http://www.contentdm.org/help6/projectclient/index.asp>`_ pour télécharger des DIP dans CONTENTdm.

source: Should you run into an error during this process, please see :ref:`Error handling <error-handling>`.
fr: Si une erreur ce produit pendant le déroulement de cette opération, consulter :ref:`Gestion erreurs <error-handling>`.

source: *On this page*
fr: *Sur cette page*

source: :ref:`Preparing a transfer for CONTENTdm <transfer-contentdm>`
fr: :ref:`Préparer un transfert pour CONTENTdm <transfer-contentdm>`

source: :ref:`Controlling the file order <contentdm-order>`
fr: :ref:`Contrôler l’ordre des fichiers <contentdm-order>`

source: :ref:`Create DIP for CONTENTdm <dip-contentdm>`
fr: :ref:`Créer des DIP pour CONTENTdm <dip-contentdm>`

source: Preparing a transfer for CONTENTdm
fr: Préparer un transfert pour CONTENTdm

source: :ref:`Manual normalization <manual-norm>`
fr: :ref:`Normalisation manuelle <manual-norm>`

source: :ref:`Import metadata <import-metadata>`
fr: :ref:`Importer des métadonnées <import-metadata>`

source: Note that it is possible to follow these instructions for either a single simple or compound object, or multiple simple or compound objects.
fr: Veuillez noter que ces instructions s’appliquent aux objets simples comme aux objets complexes. Il est possible de traiter de multiples objets simultanément.

source: **Preparing the transfer**
fr: **Préparer un transfert**

source: For a transfer of simple objects:
fr: Pour transférer un objet simple :

source: Inside the directory you wish to use as a transfer, create two subdirectories: ``metadata``, and ``objects``.
fr: Dans le répertoire à transférer, créer deux sous-répertoires : « metadata », et « objects ».

source: Inside ``objects``, place the digital objects you wish to transfer.
fr: Dans « objects », placer les objets numériques à transférer.

source: Inside ``metadata``, place a file called ``metadata.csv``. See preparation instructions below.
fr: Dans « metadata », placer un fichier nommé « metadata.csv ». Voir les instructions de préparation ci-dessous.

source: Example:
fr: Exemple :

source: For a transfer of compound objects:
fr: Pour transférer un objet complexe :

source: Inside ``objects``, create or place directories, one corrsponding to each compound object. Place the digital objects inside those directories.
fr: Dans « objects », créer ou placer les répertoires correspondant à chaque objet composé. Placer les objets numériques dans ces répertoires.

source: Inside metadata, place a file called ``metadata.csv``. See preparation instructions below.
fr: Dans « metadata », placer un fichier nommé « metadata.csv ». Voir les instructions de préparation ci-dessous.

source: **Preparing the metadata.csv**
fr: **Préparer le fichier metadata.csv**

source: The first column in the metadata.csv must be called filename. The contents will be the path to the object and/or the directory. For a simple transfer:
fr: La première colonne du document metadata.csv doit être nommée « filename ». Cette colonne contiendra les chemins d’adresse menant aux objets et/ou répertoires. Pour un transfert simple :

source: For a compound transfer:
fr: Pour un transfert complexe :

source: Or, for a compound transfer with object-level metadata
fr: Ou, pour un transfert complexe comprenant des métadonnées au niveau des objets :

source: If there are both Dublin Core and non-Dublin Core fields in metadata.csv, Archivematica will look for "custom" (non-Dublin Core) field names in the metadata.csv file file and create a tab delimited file based on those fields. This allows the operator to use the field names as they appear exactly as they do in the CONTENTdm collection, which eases the field matching in Project Client. It is also recommended that you enter the non-Dublin Core fields in the same order as in your CONTENTdm collection. However, if metadata.csv contains *only* Dublin Core namespaced fields, Archivematica will create the tab delimited file using those fieldnames, stripping out the dc namespace. For example, ``dc.title`` will become ``title``.
fr: Si metadata.csv contient à la fois des champs Dublin Core et des champs d’autres types, Archivematica cherchera des noms de champs « personnalisés » (c.-à.-d. non conforme à Dublin Core) et créera un fichier balisé en fonction de ces champs. Cela permettra à l’utilisateur de reprendre les noms de champs verbatim, exactement tels qu’ils apparaissent dans CONTENTdm, pour faciliter la correspondance des noms de champs dans Project Client. On recommande également de saisir les champs de type autre que Dublin Core, dans le même ordre que celui qui apparaît dans CONTENTdm. Cependant, si, metadata.csv contient *seulement* des champs de type Dublin Core, Archivematica créera le fichier balisé selon ces noms de champs en omettant le préfixe « dc. ». P. ex., ``dc.titre`` devient ``titre``.

source: For more information regarding the creation and transfer of a metadata.csv file, see :ref:`Import metadata <import-metadata>`.
fr: Pour en savoir plus au sujet de la création et du transfert de fichiers metadata.csv, voir :ref:`Importer des métadonnées<import-metadata>`.

source: Controlling the file order
fr: Contrôler l’ordre des fichiers

source: Currently, the only method of controlling the order of files and directories as listed in the tab delimited file is to ensure they are in alphabetical order. The sort method is based on `ASCII <http://en.wikipedia.org/wiki/ASCII>`_ characters (e.g. numbers, capital letters, underscores, small case letters).
fr: Actuellement, le seul moyen de contrôler l’ordre dans lequel les fichiers et répertoires apparaissent dans le fichier balisé est de s’assurer qu’ils soient en ordre alphabétique. Cette méthode est basée sur les caractères `ASCII<http://en.wikipedia.org/wiki/ASCII>`_ , (c.-à-d. les nombres, les lettres majuscules, les tirets de soulignement, et les lettres minuscules).

source: Other methods of controlling file order could be implemented in future releases. Please see `Issue 8448 <https://projects.artefactual.com/issues/8448>`_.
fr: On envisage d’autres méthodes de contrôle de l’ordre des fichiers dans une version ultérieure. Voir `Issue 8448<https://projects.artefactual.com/issues/8448>`_.

source: Create DIP for CONTENTdm
fr: Créer des DIP pour CONTENTdm

source: Ensure that your CONTENTdm target collection has a field called "AIP UUID and a field called "File UUID". The tab file produced by Archivematica will populate these two fields.
fr: S’assurer que la collection cible dans CONTENTdm contient un champ appelé « AIP UUID » et un champ appelé « "File UUID »". Le fichier balisé produit par Archivematica remplira ces deux champs.

source: In the Archivematica dashboard at “Upload DIP”, choose the action “Upload DIP to CONTENTdm” from the drop-down menu.
fr: À partir du Tableau de bord Archivematica, dans « Télécharger le DIP », choisissez l’action « Télécharger le DIP dans CONTENTdm » dans le menu déroulant.

source: Archivematica will create a DIP consisting of normalized or :ref:`manually normalized <manual-norm>` access objects and a tab delimited file for use in Project Client.
fr: Archivematica créera un DIP comprenant des objets normalisés ou :ref:`normalisés manuellement <manual-norm>` et un fichier balisé à utiliser dans Project Client.

source: To review the DIP in the dashboard and download individual DIP objects and/or the tab file, click "review":
fr: Pour examiner le DIP dans le Tableau de bord et télécharger des objets DIP et/ou le fichier balisé, cliquer sur « Examiner ».

source: The next screen will display the uploadedDIPs directory, which operators can navigate to locate the required DIP objects. The CONTENTdm tab file will be in the same directory as the DIP objects.
fr: Le répertoire uploadedDIPs apparaît sur l’écran suivant, et les opérateurs peuvent y localiser les objets DIP recherchés. Le fichier balisé dans CONTENTdm se trouve dans le même répertoire que les objets DIP téléchargés.

source: By default, the DIP will be stored in ``/var/archivematica/sharedDirectory/watchedDirectories/uploadedDIPs/``. It can be retrieved from this location via SFTP client, or individual objects downloaded through the web browser.
fr: Par défaut, les DIP sont conservés dans ``/var/archivematica/sharedDirectory/watchedDirectories/uploadedDIPs/``. On peut les ouvrir à partir de cet emplacement au moyen d’un client SFTP, ou télécharger les objets individuellement à l’aide d’un navigateur Web.

source: Once your work in CONTENTdm Project Client is complete, and your digital objects are uploaded, you may wish to "clean up" your uploadedDIPs directory to save space on your service and keep the Download DIP page manageable. This can be done through the :ref:`Administration tab, Processing storage usage <dashboard-usage>`.
fr: Un fois le travail dans Project Client/CONTENTdm terminé, et vos objets numériques téléchargés, il est recommandé de « nettoyer » votre répertoire uploadedDIPs, pour libérer de l’espace mémoire et éviter des problèmes futurs. Cette opération peut être effectuée à partir de l’onglet Administration :ref:`Administration, Utilisation de l’espace de traitement <dashboard-usage>.

source: :ref:`Back to the top <contentdm>`
fr: :ref:`Retour en haut de page <contentdm>`
