Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/troubleshooting/error-handling.po
Languages: fr, pt_br

source: Error handling
fr: Gestion des erreurs
pt_br: Tratamento de erros

source: Archivematica anticipates that a number of different types of errors can occur during processing. Some of them will result in processing being halted and the transfer or SIP being moved to the failed directory in the file browser. For others, processing can continue: for example, a normalization failure is reported and the user is given the opportunity to continue processing the SIP.
fr: Archivematica tient compte du fait que plusieurs types d’erreurs peuvent survenir lors du traitement. Certaines erreurs entraînent l’arrêt du traitement, auquel cas le transfert ou SIP en cours est envoyé dans le répertoire Échecs de l'explorateur de fichiers. D’autres types d'erreurs permettent la poursuite du traitement en cours. Par exemple, lorsqu’une erreur de normalisation est signalée, l’utilisateur peut choisir de poursuivre le traitement du SIP.
pt_br: O Archivematica prevê que diversos tipos diferentes de erros podem ocorrer durante o processamento. Alguns deles resultarão na interrupção do processamento, com a transferência ou SIP sendo movido para um diretório de falhas no navegador de arquivos. Para outros, o processamento pode continuar: por exemplo, uma falha na normalização é relatada, sendo dada ao usuário a oportunidade de continuar a processar o SIP.

source: If you don't find an answer here or elsewhere in the user manual, please try searching the `public user forum <https://groups.google.com/forum/?fromgroups#!forum/archivematica>`_. Someone may have had the same problem before and been offered a solution. If you do not find the answer there, feel free to ask us a question. The best questions to the list include as much information as possible about the error. This means offering us information about the system(s) you're using, the content of your transfer(s), and copying the task information (click on the cog icon on the same line as the micro-service job where the error occurred) and show arguments data output. See task information and show arguments data for the same error, below.
fr: Si la réponse recherchée ne se trouve pas dans ce manuel ni dans les autres guides, consulter le `public user forum (forum des utilisateurs) <https://groups.google.com/forum/?fromgroups#!forum/archivematica>`_. Il est probable qu’un autre utilisateur ait déjà obtenu une réponse à la même question. Dans le cas contraire, nous contacter en précisant le système utilisé et le contenu du transfert concerné, et en copiant les informations concernant la tâche (cliquer sur l’icône d’engrenage sur la même ligne que le micro-service pendant lequel l’erreur est survenue) ainsi que les données de sortie des arguments (voir l’exemple ci-dessous) :
pt_br: Se você não encontrar uma resposta aqui, ou em outro local deste manual do usuário, por favor tente procurar no `fórum público de usuários <https://groups.google.com/forum/?fromgroups#!forum/archivematica>`_. Pode ser que alguém tenha enfrentado o mesmo problema antes, e tenha oferecido uma solução. Se você não encontrar a resposta lá, sinta-se à vontade para fazer-nos uma pergunta. As melhores perguntas na lista incluem tanta informação quanto possível sobre o erro. O que significa oferecer informações sobre o(s) sistema(s) que você estiver usando, o conteúdo de sua(s) transferência(s) e cópia das informações da tarefa (clique no ícone de engrenagem na mesma linha da tarefa do microsserviço onde o erro ocorreu) e mostra dados de argumentos da resposta. Consulte as informações da tarefa e mostrar dados de argumentos para o mesmo erro, a seguir.

source: *On this page:*
fr: *Sur cette page:*
pt_br: *Nesta página:*

source: :ref:`Dashboard error reporting <error-dashboard>`
fr: :ref:`Notification des erreurs dans le tableau de bord <error-dashboard>`
pt_br: :ref:`Relatório de erros do Dashboard <error-dashboard>`

source: :ref:`Failure reports in Administration tab <failure-reports>`
fr: :ref:`Rapports d’échec dans l’onglet Administration <failure-reports>`
pt_br: :ref:`Relatório de falhas na tela Administração <failure-reports>`

source: :ref:`Email error report <email-failure>`
fr: :ref:`Courriel de rapport d’échec <email-failure>`
pt_br: :ref:`Relatório de erros por e-mail <email-failure>`

source: :ref:`Normalization errors <normalization-errors>`
fr: :ref:`Erreurs de normalisation <normalization-errors>`
pt_br: :ref:`Erros de normalização <normalization-errors>`

source: :ref:`DIP upload error <dip-error>`
fr: :ref:`Erreur de téléchargement de DIP <dip-error>`
pt_br: :ref:`Erro de upload de DIP <dip-error>`

source: :ref:`Common error behaviours <common-errors>`
fr: :ref:`Erreurs communes <common-errors>`
pt_br: :ref:`Comportamentos comuns de erros <common-errors>`

source: :ref:`Rejecting a transfer or SIP <rejecting>`
fr: :ref:`Rejeter un transfert ou SIP <rejecting>`
pt_br: :ref:`Rejeitar uma transferência ou SIP <rejecting>`

source: :ref:`Removing a transfer or SIP from the dashboard <removing>`
fr: :ref:`Retirer un transfert ou SIP du Tableau de bord <removing>`
pt_br: :ref:`Remover uma transferência ou SIP do dashboard <removing>`

source: :ref:`Browser compatability <error-browser>`
fr: :ref:`Navigateurs compatibles <error-browser>`
pt_br: :ref:`Compatibilidade de navegador <error-browser>`

source: Dashboard error reporting
fr: Notification des erreurs dans le tableau de bord
pt_br: Relatório de erros do Dashboard

source: When a micro-service fails or encounters an error, the workflow will be halted and Archivematica will report a 'Failed transfer'. The micro-service drop-down can be expanded to show the specific task that failed.
pt_br: Quando um microsserviço falha ou encontra um erro, o fluxo de trabalho será interrompido e o Archivematica relatará uma 'Falha na transferência'. A caixa de microsserviço pode ser expandida para mostrar a tarefa específica que falhou.

source: The dashboard showing a transfer has failed at the Verify transfer checksums micro-service
pt_br: Dashboard exibindo uma transferência que falhou no microsserviço Verificar soma de verificação da transferência

source: Note that the transfer has been moved to the failed directory and processing has been halted.
fr: Veuillez noter que le transfert a été envoyé dans le répertoire Échecs et que le traitement a été interrompu.
pt_br: Observe que a transferência foi movida para o diretório de falhas, e o processamento foi interrompido.

source: The expanded detail on 'Failed transfer'
pt_br: O detalhe expandido de 'Falha na transferência'

source: Click the tasks icon (the gear icon on the right-hand side) to open up an error report:
fr: Cliquer sur l’icône des tâches (engrenage à droite) pour ouvrir le rapport d’erreur :
pt_br: Clique no ícone de tarefas (o ícone de engrenagem do lado direito) para abrir um relatório de erros:

source: An error report showing that a file has failed checksum validation
pt_br: Um relatório de erros mostrando que um arquivou falhou na validação de soma de verificação

source: These reports are generally standard and predictable for certain types of errors and are useful for trouble-shooting. Note that the failed file(s) will always appear at the top of the report.
fr: Certaines erreurs sont prévisibles et les rapports d’erreur sont utiles pour le dépannage. Veuillez noter que les fichiers qui ont fait l’objet d’une erreur sont toujours mentionnés au début du rapport.
pt_br: Estes relatórios geralmente são padrão e previsíveis para certos tipos de erros, e são úteis para resolução de problemas. Observe que o(s) arquivo(s) que falhou(aram) sempre aparecerá(ão) no topo do relatório.

source: Failure reports in Administration tab
fr: Rapports d’échec dans l’onglet Administration
pt_br: Relatório de falhas na tela Administração

source: You can view failure reports in the Administration tab of the dashboard. See :ref:`Dashboard administration tab- Failures <dashboard-failures>` for more information.
fr: Pour voir les rapports d’échec dans l’onglet Administration du Tableau de bord. Voir :ref:`Onglet Administration du Tableau de bord - Échecs <dashboard-failures>` pour plus d'information.
pt_br: Você pode ver relatórios de falhas na tela Administração do dashboard. Consulte :ref:`Tela administração do dashboard - Falhas<dashboard-failures>` para maiores informações.

source: Email error report
fr: Courriel de rapport d’échec
pt_br: Relatório de erro por e-mail

source: An emailed failure report showing an error at Verify bag micro-service
fr: Un rapport d’échec envoyé par courriel montrant une erreur à l’étape du microservice Vérifier le bag.
pt_br: Um relatório de falhas enviado por e-mail mostrando um erro no microsserviço Verificar bag

source: An e-mail is generated if the transfer or ingest cannot be completed, not if an error occurs which does not halt processing. Please note that the server must have mail delivery enabled in order to receive error emails without additional configuration.
fr: Un courriel est envoyé automatiquement si le transfert ou l’acquisition ne peut pas être terminé, mais pas dans les cas où une erreur permettant la poursuite des opérations survient. Veuillez noter que l’option de livraison par courriel doit être activée dans le serveur pour que cette fonction soit opérationnelle sans nécessiter de configuration supplémentaire.
pt_br: Um e-mail é gerado se a transferência ou admissão não puder ser completada, não se ocorrer um erro que não interrompa o processamento. Por favor, observe que o servidor deve ser a entrega de e-mail habilitada para receber e-mails de erros sem configuração adicional.

source: Normalization errors
fr: Erreurs de normalisation
pt_br: Erros de normalização

source: The dashboard will report normalization errors when:
fr: Les erreurs de normalisation apparaissent dans le Tableau de bord quand :
pt_br: O dashboard relatará erros de normalização quando:

source: Normalization is attempted but fails
fr: Une tentative de normalisation échoue,
pt_br: Houve tentativa de normalização, mas falhou

source: No normalization is attempted and the file is not in a recognized preservation or access format
fr: Aucune normalisation n’est tentée et le fichier n’est pas enregistré dans un format reconnu.
pt_br: Não houve tentativa de normalização e o arquivo não é reconhecido como um formato para preservação ou acesso

source: When normalization fails, the SIP continues processing until it reaches the normalization approval step. At this point, the user has two options:
fr: Quand la normalisation échoue, le traitement du SIP se poursuit jusqu’à l’étape de validation de la normalisation. L’utilisateur a alors deux options :
pt_br: Quando a normalização falhar, o SIP continuará a ser processado até que atinja a etapa de aprovação da normalização. Neste ponto, o usuário terá duas opções:

source: **Option 1**
pt_br: **Opção 1**

source: Click on the report icon next to the Actions drop-down menu to see a summary report of the normalization:
fr: Cliquer sur l’icône du rapport à côté du menu déroulant Actions pour voir le rapport sommaire de la normalisation :
pt_br: Clicar no ícone de relatório, próximo ao menu de seleção Ações, para ver um relatório resumido da normalização:

source: Normalization report showing failed normalization attempts
fr: Rapport de normalisation montrant les tentatives de normalisation ayant échoué.
pt_br: Relatório de normalização mostrando tentativas de normalização que falharam

source: The report shows what has been normalized, what is already in an acceptable preservation and access format, and what has failed normalization or is not in a recognized preservation or access format. If normalization has failed, you can click on "yes" to see a task report of the error in a new tab:
fr: Le rapport montre ce qui a été normalisé, ce qui est déjà dans un format de préservation et d’accès convenable et ce qui n’a pas pu être normalisé ou ce qui n’est pas dans un format de préservation ou d’accès reconnu. Si la normalisation a échoué, on peut cliquer sur « Oui » pour voir un rapport d’erreur plus détaillé dans un nouvel onglet :
pt_br: O relatório mostra o que foi normalizado, o que já estava em um formato aceitável para preservação e acesso, e o que falhou na normalização, ou não for reconhecido como formato para preservação ou acesso. Se a normalização falhou, você pode clicar em "sim" para ver um relatório de tarefa do erro em uma nova janela:

source: Task output for failed normalization job
fr: Rapport de sortie d’une tâche de normalisation ayant échoué
pt_br: Retorno da tarefa para a tarefa de normalização

source: **Option 2**
pt_br: **Opção 2**

source: Click Review in parentheses next to the micro-service to view the normalization results in a directory structure in a new browser tab:
fr: Cliquer sur « Examiner », à côté du microservice, pour voir les résultats de la normalisation selon les répertoires dans un nouvel onglet :
pt_br: Clicar em Revisar entre parênteses, próximo ao microsserviço, para visualizar os resultados da normalização em uma estrutura de diretório em uma nova janela do navegador:

source: Review normalization results in a new tab
fr: Résultats d’un examen de normalisation ouvert dans un nouvel onglet
pt_br: Revisão dos resultados da normalização em uma nova janela

source: The review allows the user to either open the objects in the browser when there is an appropriate plug-in or download the objects and open them using a local application.
fr: L’examen permet à l’utilisateur d’ouvrir les objets à partir du navigateur, si le plugiciel adéquat est installé, ou de télécharger les objets et de les ouvrir dans une application locale.
pt_br: A revisão permite que o usuário abra os objetos no navegador quando houver o plug-in apropriado, ou faça o download dos objetos e abra-os usando uma aplicação local.

source: The user may choose to continue processing the SIP despite any normalization errors.
fr: L’utilisateur peut choisir de poursuivre le traitement du SIP malgré les erreurs de normalisation.
pt_br: O usuário pode optar por continuar processando o SIP independente de quaisquer erros de normalização.

source: The user may choose to redo normalization, as well. For instance, if the user chose to normalize based on FITS-JHOVE results and experienced failures, the user may wish to redo normalization and choose to normalize based on FITS-DROID results instead.
fr: L’utilisateur peut aussi choisir de relancer la normalisation. Par exemple, si des erreurs surviennent en utilisant les résultats FITS-JHOVE, l’utilisateur peut retenter la normalisation à partir des résultats FITS-DROID.
pt_br: O usuário pode escolhe refazer a normalização também. Por exemplo, se o usuário escolher fazer a normalização baseado nos resultados FITS-JHOVE e enfrentar problemas, pode escolher refazer a normalização, mas escolher a normalização baseada nos resultados do FITS-DROID.

source: Redo normalization option in drop-down menu of Approve normalization job
fr: L’option de relance de la normalisation dans le menu déroulant de la tâche « Approuver la normalisation ».
pt_br: Opção de refazer a normalização no menu de seleção da tarefa Aprovar normalização

source: UUID of the pipeline
fr: UUID du pipeline
pt_br: UUID da pipeline

source: Name and UUID of the SIP
fr: Nom et UUID du SIP
pt_br: Nome e UUID do SIP

source: File name and file UUID, and whether Preservation or Access normalization failed
fr: Nom et UUID du fichier, et type d’échec (préservation ou accès)
pt_br: Nome do arquivo e UUID do arquivo, e se a normalização para Preservação ou Acesso falhou

source: Exit code
fr: Code de sortie
pt_br: Código de saída

source: Exit code 1 indicates that a normalization rule and command exists but failed to execute properly (due to a problem in the command, a problem with the file, etc). Exit code 2 indicates that a normalization rule/command does not exist for that format.
fr: Le code de sortie 1 indique qu’une règle et une commande de normalisation existent, mais n’ont pas été exécutées correctement (à cause d’un problème de commande, de fichier, etc.) Le code de sortie 2 indique qu’aucune règle/commande n’existe pour le format concerné.
pt_br: O código de saída 1 indica que uma regra e comando de normalização existem, mas falhou em ser executado apropriadamente (devido a um problema no comando, um problema com o arquivo, etc.). O código de saída 2 indica que uma regra/comando de normalização não existe para este formato.

source: Emailed normalization error report
fr: Rapport d’erreur de normalisation envoyé par courriel
pt_br: Relatório de erro de normalização enviado por e-mail

source: Dip upload error
fr: Erreur de téléchargement du DIP
pt_br: Erro de upload do DIP

source: Archivematica will allow the user to continue to attempt to upload the DIP if a mistake was made entering the permalink:
fr: Archivematica permet à l’utilisateur de poursuivre une tentative de téléchargement du DIP en cas d’erreur de saisie du permalien :
pt_br: O Archivematica permitirá ao usuário continuar a tentar fazer o upload o DIP se um erro foi cometido na entrada do permalink:

source: Warning that permalink was incorrect, allows user to retry upload DIP
fr: Avertissement indiquant que le permalien est incorrect. L’utilisateur peut retenter le téléchargement du DIP.
pt_br: Aviso de que o permalink estava incorreto, permite ao usuário tentar refazer o upload do DIP

source: Other common error behaviours
fr: Autres erreurs communes
pt_br: Outros comportamentos comuns de erro

source: Verify metadata directory checksums: if the checksums in the metadata directory cannot be verified (i.e. if a file is missing or corrupted) the micro-service will fail and the transfer will be moved in the failed directory.
fr: Vérifier les sommes de contrôle du répertoire des métadonnées : Si les sommes de contrôle du répertoire des métadonnées ne peuvent pas être vérifiés (c.-à-d. si un fichier manque ou est corrompu), le microservice échoue et le transfert est envoyé dans le répertoire Échecs.
pt_br: Verificação somas de verificação do diretório de metadados: se a soma de verificação no diretório de metadados não puder ser verificado (ou seja, se um arquivo estiver faltando, ou corrompido), o microsserviço falhará e a transferência será movida para o diretório de falhas.

source: Scan for viruses: if a virus is found the micro-service will fail and the transfer will be moved in the failed directory.
fr: Lancer l’antivirus : Si un virus est détecté, le microservice échoue et le transfert est envoyé dans le répertoire Échecs.
pt_br: Scan por vírus: se um vírus for encontrado, o microsserviço falhará e a transferência será movida para o diretório de falhas.

source: Characterize and extract metadata: if FITS processing fails, the micro- service will fail and the transfer will continue processing. Similarly, if a tool within FITS fails, like JHOVE, you will see the pink error bar but be able to continue processing.
fr: Caractériser et extraire les métadonnées : Si un traitement FITS échoue, le microservice échoue et le transfert se poursuit. De même, si un outil échoue dans FITS, comme dans JHOVE, la barre d’erreur rose s’affiche, mais le traitement peut se poursuivre.
pt_br: Caracterização e extração de metadados: se o processamento FITS falhar, o microsserviço falhará e a transferência continuará a ser processada. Similarmente, se uma ferramenta do FITS falhar, como o JHOVE, você verá uma barra rosa de erro, mas poderá continuar a processar.

source: Remove thumbs.db file: if Archivematica is unable to remove a thumbs.db file, the micro-service will fail and the SIP will continue processing.
fr: Supprimer le fichier thumbs.db : Si Archivematica ne parvient pas à supprimer un fichier thumbs.db, le microservice échoue et le transfert se poursuit.
pt_br: Remoção do arquivo thumbs.db: se o Archivematica não conseguir remover um arquivo thumbs.db, o microsserviço falhará e o SIP continuará a ser processado.

source: Normalize submission documentation to preservation format: if normalization fails, the micro-service will fail and the SIP will continue processing.
fr: Normaliser la documentation de soumission au format de préservation : Si la normalisation échoue, le microservice échoue et le transfert se poursuit.
pt_br: Normalização de documento de submissão para o formato para preservação: se a normalização falhar, o microsserviço falhará e o SIP continuará a ser processado.

source: Rejecting a transfer or SIP
fr: Rejeter un transfert ou SIP
pt_br: Rejeitar uma transferência ou SIP

source: At any of the workflow approval points the user can choose to reject a transfer, SIP, AIP or DIP (depending on where the information object is in the workflow). This will move the transfer or SIP to the Rejected directory (accessible from the file browser) and will stop all processing on it. The transfer or SIP will still be listed in the dashboard, however. See :ref:`Removing a transfer or SIP from the dashboard <removing>`, below, to remove it from the dashboard.
fr: À toute étape d’approbation, l’utilisateur peut choisir de rejeter un transfert, SIP, AIP ou DIP (suivant l’étape du déroulement des opérations). Le transfert ou SIP refjeté sera envoyé vers le répertoire des refus (accessible depuis le navigateur de fichiers) et tout traitement le concernant sera interrompu. Cependant, le transfert ou SIP apparaîtra dans le Tableau de bord. Voir :ref:`Retirer un transfert ou SIP du Tableau de bord <removing>`, ci-dessous, pour les effacer du Tableau de bord.
pt_br: Em qualquer dos pontos de aprovação do fluxo de trabalho, o usuário poderá escolher rejeitar a transferência, SIP, AIP ou DIP (dependendo de onde o objeto de informação está no fluxo de trabalho). Isto moverá a transferência ou SIP para o diretório de rejeitados (acessível através do navegador de arquivos) e parará todo processamento dele. Entretanto, a transferência ou SIP continuará sendo listado no dashboard. Consulte::ref:`Remover uma transferência ou SIP do dashboard <removing>`, a seguir, para removê-lo do dashboard.

source: Removing a transfer or SIP from the dashboard
fr: Retirer un transfert ou SIP du Tableau de bord
pt_br: Remover uma transferência ou SIP do dashboard

source: To remove a transfer or SIP from the dashboard, click on the red "Remove" icon in the dashboard:
fr: Pour retirer un transfert ou SIP du Tableau de bord, cliquer sur l’icône « Retirer » rouge du Tableau de bord :
pt_br: Para remover uma transferência ou SIP do dashboard, clique no ícone vermelho "Remover" no dashboard:

source: Click on the red Remove icon to remove a transfer or SIP from the dashboard, then click Confirm.
fr: Pour retirer un transfert ou SIP du Tableau de bord, cliquer sur l’icône « Retirer » rouge du Tableau de bord, puis cliquer sur confirmer.
pt_br: Clique no ícone vermelho Remover para remover uma transferência ou SIP do dashboard, e então clique em Confirmar.

source: It is recommended that you clear your dashboard of transfers and SIPs periodically to improve browser performance.
fr: On recommande de supprimer régulièrement tous les SIP et transferts du Tableau de bord pour en optimiser la performance.
pt_br: É recomendável que você limpe seu dashboard de transferências e SIPs periodicamente, para melhor a performance do navegador.

source: Browser compatability
fr: Navigateurs compatibles
pt_br: Compatibilidade de navegador
