Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/troubleshooting/error-handling.po
Languages: fr, pt_br

source: Archivematica has been tested most extensively with Firefox and Chrome. There are known issues with Internet Explorer 11 which result in an inability to start transfers in the dashboard (`Issue 7246 <https://projects.artefactual.com/issues/7246>`_). Minimal, but successful, testing has been done with Microsoft Edge.
fr: Archivematica a été testé principalement en association avec Firefox et Chrome. Des problèmes connus de compatibilité avec Explorer 11 empêchent le lancement de transferts depuis le Tableau de bord (`Problème 7246<https://projects.artefactual.com/issues/7246>`_). Peu de tests ont été faits sur Microsoft Edge, mais aucun problème majeur n’a été détecté jusqu’à présent.
pt_br: O Archivematica foi testado mais extensivamente com o Firefox e Chrome. Há problemas conhecidos com o Internet Explorer 11, que resultam em uma incapacidade de iniciar transferências no dashboard (`Issue 7246 <https://projects.artefactual.com/issues/7246>`_). Testes mínimos, mas com sucesso, foram feitos com o Microsoft Edge.

source: :ref:`Back to the top <error-handling>`
fr: :ref:`Retour en haut de page <error-handling>`
pt_br: :ref:`Voltar ao topo <error-handling>`
