Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/troubleshooting/faq.po
Languages: pt_br

source: **What technical skills are required to install/maintain/operate Archivematica?**
pt_br: **Que habilidades técnicas são necessárias para instalar/manter/operar o Archivematica?**

source: To install and maintain Archivematica successfully, you or someone in your organization should be comfortable using and maintaining Linux-based servers, logging in to the server and performing operations via the command line. This individual should also be able to read and understand and/or research errors in Linux based systems to assist with troubleshooting.
pt_br: Para instalar e manter o Archivematica com sucesso, você ou alguém em sua organização deve estar confortável em usar e manter servidores baseados em Linux, fazer o login em servidores e executar operações através da linha de comando. Este indivíduo também deve ser capaz de ler e entender e/ou pesquisar por erros em sistemas baseados em Linux, para auxiliar com a resolução de problemas.

source: Operating Archivematica takes place in a web-based dashboard so an archivist/librarian/curator does not necessarily need to have the same skill set described above, so long as someone in their organization is able to provide technical support. Some familiarity with `OAIS <http://en.wikipedia.org/wiki/Open_Archival_Information_System>`_ will make Archivematica more intuitive to use but is not necessarily a prerequisite.
pt_br: A operação do Archivematica é feita através de um dashboard baseado na web, então um arquivista/bibliotecário/curador não precisa necessariamente ter as mesmas habilidades descritas acima, desde que alguém em sua organização seja capaz de fornecer suporte técnico. Alguma familiaridade com o `OAIS <http://en.wikipedia.org/wiki/Open_Archival_Information_System>`_ tornará o uso do Archivematica mais intuitivo, mas não é necessariamente um pré-requisito.

source: Organizations that are unable to provide in-house technical support may consider a `maintenance contract <http://www.artefactual.com/services/maintenance/>`_ through Artefactual Systems.
pt_br: As organizações que não puderem ter suporte técnico local podem considerar fazer um `contrato de manutenção <http://www.artefactual.com/services/maintenance/>`_ através da Artefactual Systems.

source: **I'm having a problem with installation/Why is Archivematica difficult to install?**
pt_br: **Estou tendo um problema com a instalação/Por que o Archivematica é difícil de instalar?**

source: Archivematica is a complex piece of software with many dependencies, all of which are open-source. Because of its complex, open-source nature, it is not feasible to create a click-through executible file for installation.
pt_br: O Archivematica é um software complexo, com muitas dependências, todas elas de código aberto. Devido a sua natureza complexa, de código aberto, não é viável criar um arquivo que bastaria clicar para instalar.

source: If you encounter errors during :ref:`installation <installation>` you are welcome to post your errors to our `user forum <https://groups.gtoogle.com/forum/#!forum/archivematica>`_. Artefactual Systems, or other Archivematica community members, will do their best to help you. Please be patient: answering questions from users is unsponsored work and it can take a while for us to respond when we are busy.
pt_br: Se você encontrar erros durante a :ref:`instalação <installation>`, sinta-se à vontade para postar seus erros em nosso `fórum de usuários <https://groups.google.com/forum/#!forum/archivematica>`_. A Artefactual Systems, ou outros membros da comunidade do Archivematica, farão o melhor para ajudá-lo. Por favor, tenha paciência: responder perguntas de usuários é um trabalho voluntário, e podemos levar algum tempo para responder quando estivermos ocupados.

source: **What does Archivematica do?**
pt_br: **O que faz o Archivematica?**

source: The main purpose of Archivematica is to create standards-based, self-documenting and system-independent archival information packages (AIPs). An AIP includes a METS XML file with a robust PREMIS preservation metadata implementation, and is packaged in the Library of Congress BagIt format, which includes file manifests and information about the AIP contents. The physical and logical structure of the AIP is described in the METS structMap.
pt_br: O propósito principal do Archivematica é criar pacotes tipo archival information packages (AIPs) baseado em normas, auto-documentado e independete de sistemas. Um AIP inclui um arquivo XML METS com uma implementação robusta de metadados de preservação PREMIS, e é empacotado no formato BagIt da Library of Congress, que inclui manifests de arquivos e informações sobre conteúdos AIP. A estrutura física e lógica do AIP é descrito no structMap do METS.

source: **Does Archivematica perform fixity checks?**
pt_br: **O Archivematica faz checagem de fixidez?**

source: Archivematica generates checksums upon transfer of objects into the system, and will verify those checksums before storing the AIP. It is also possible to include :ref:`pre-existing checksums <transfer-checksums>`, which Archivematica will also verify.
pt_br: O Archivematica gera checksums das transferências de objetos para o sistema, e verificará estas checksums antes de armazenar o AIP. Também é possível incluir :ref:`checksums pré-existentes <transfer-checksums>`, que o Archivematica também verificará.

source: To check fixity of AIPs in storage, Artefactual has written a separate command-line app called `Fixity <https://github.com/artefactual/fixity>`_ (further user documentation for Fixity is pending).
pt_br: Para checar a fixidez dos AIPs no armazenamento, a Artefactual elaborou uma aplicação de linha de comando chamada `Fixity <https://github.com/artefactual/fixity>`_ (mais documentação para o usuário para o Fixity está pendente).

source: **Is Archivematica a storage system?**
pt_br: **O Archivematica é um sistema de armazenamento?**

source: Archivematica is purposefully designed to be storage system agnostic, leaving the door open for integration with a wide variety of existing storage systems.
pt_br: O Archivematica foi intencionalmente concebido para ser um sistema agnóstico ao sistema de armazenamento, deixando a porta aberta para integração com uma grande variedade de sistemas de armazenamento existentes.

source: **What is the Archivematica Storage Service and why is there a separate application?**
pt_br: **O que é o Storage Service do Archivematica, e por que existe uma aplicação separada?**

source: The Archivematica Storage Service manages the storage and transfer source locations for Archivematica installations. Our recommendation is for each institution to have one or two administrators who are responsible for managing the Storage Service and restrict access to only those individuals. This is one of the reasons why it is maintained as a separate application; another reason is so that multiple Archivematica pipelines can be managed through one Storage Service.
pt_br: O Storage Service do Archivematica gerencia o armazenamento e locais de origem de transferência para instalações do Archivematica. Nossa recomendação é que cada instituição tenha um ou dois administradores responsáveis por gerenciar o Storage Service, e acesso restringido somente a estes indivíduos. Esta é uma das razões por que ele é mantido como uma aplicação separada; outra razão é que diversas pipelines do Archivematica podem ser gerenciadas através de um Storage Service.

source: **What is Archivematica’s capacity? How much can it handle?**
pt_br: **Qual a capacidade do Archivematica? Com quanto ele pode lidar?**

source: Capacity is highly dependent on the resources allocated to the servers on which the software is installed. Archivematica has been successfully tested with SIPs of 100,000 files and with video files of several TB each. No maximum size or number of files can be specified; Artefactual works with clients to determine optimal use cases and workflows on a per-institution basis.
pt_br: A capacidade depende muito dos recursos alocados para os servidores nos quais o software está instalado. O Archivematica foi testado com sucesso com SIPs com 100.000 arquivos, e com arquivos de vídeo de muitos TB. Não é possível especificar um tamanho máximo ou número de arquivos; a Artefactual trabalha com clientes para determinar casos de uso ideais e fluxos de trabalho diferentes para cada instituição.

source: **What is the format and structure of the Archival Information Package (AIP)?**
pt_br: **Qual o formato e estrutura do Archival Information Package (AIP)?**

source: The `Archivematica AIP <https://www.archivematica.org/en/docs/archivematica-1.6/user-manual/archival-storage/aip-structure/#aip-structure>`_ consists primarily of the ingested objects, any preservation masters generated during processing, and technical, preservation, audit and descriptive metadata encoded in METS XML. The METS file contains a robust PREMIS implementation, including the Object, Event, Agent and Rights entities. Dublin Core is supported as a descriptive metadata standard.
pt_br: O `AIP do Archivematica <https://www.archivematica.org/en/docs/archivematica-1.6/user-manual/archival-storage/aip-structure/#aip-structure>`_ consiste primariamente dos objetos admitidos, quaisquer arquivos mestres de preservação gerados durante o processamento, e metadados técnicos, de preservação, de auditoria e descritivos codificados em XML METS. O arquivo METS contém uma implementação robusta do PREMIS, incluindo as entidades Object, Event, Agent e Rights. O Dublin Core é suportado como um padrão de metadados descritivos.

source: **What kinds of preservation metadata is included in an AIP’s METS XML file?**
pt_br: **Quais tipos de metadados de preservação estão incluídos no arquivo XML METS de um AIP?**

source: Archivematica by default includes a very robust PREMIS implementation which includes the Object, Event, Agent and Rights entities. Standard Events include ingestion, fixity check, message digest calculation, unpacking, decompression, virus check, format identification, format validation and normalization. The names of the software platform, the organization and the logged-in user are captured as Agents for each Event. Rights statements can be ingested as csv metadata or added by the user via a metadata-entry template during processing.
pt_br: O Archivematica por padrão inclui uma implementação muito robusta do PREMIS, que inclui as entidades Object, Event, Agent e Rights. Os Events padrão incluem admissão, verificação de fixidez, cálculo message digest (MD), desempacotamento, descompactação, verificação por vírus, identificação de formato, validação e normalização de formato. Os nomes da plataforma de software, da organização e do usuário logado são capturados como Agents para cada Event. Declarações de direitos podem ser admitidas como um csv de metadados ou adicionadas pelo usuário através do modelo de entrada de metadados, durante o processamento.

source: Yes! In Archivematica 1.6 an appraisal dashboard allows the user to perform archival appraisal and arrangement activities on ingested files. Submission documentation such as donor agreements, transfer forms and accession records can be added to the SIP for preservation along with the ingested digital objects, and are identified as submission documentation in the preservation metadata in the AIP. In AtoM, an accessions module allows users to record accessions, accruals and deaccessions and to record information about appraisal and selection.
pt_br: Sim! No Archivematica 1.6 um dashboard de avaliação permite que o usuário execute atividades avaliação arquivística e arranjo em arquivos admitidos. Documentações de submissão tais como acordos do doador, formulários de transferência e registros de entrada de documentos podem ser adicionados ao SIP para preservação, juntamente com os objetos digitais admitidos, e são identificados como documentação de submissão nos metadados de preservação no AIP. No AtoM, um módulo de entrada de documentos permite que o usuário registre entrada de documentos, incorporações e baixas de documentos e registrar informações sobre avaliação.

source: **Why doesn't Archivematica have a module for providing access to digital materials?**
pt_br: **Por que o Archivematica não tem um módulo para permitir acesso aos materiais digitais?**

source: In a manner of speaking, it does! It's called :ref:`AtoM <atom:home>` and it is another open-source, freely available software application managed and developed by Artefactual Systems. Archivematica and AtoM are developed in conjunction with one another, and you can send access copies from Archivematica to AtoM, while maintaining a link between your preservation copies and the access copies. AtoM can also be used to manage archival descriptions for all of your digital and analogue material, so your users do not have to consult multiple systems to do their research.
pt_br: De certo modo, ele tem! Chama-se :ref:`AtoM <atom:home>` e é outro software aplicativo de código aberto, gratuitamente disponível, gerenciado e desenvolvido pela Artefactual Systems. O Archivematica e o AtoM são desenvolvidos em conjunto um com o outro, e você pode enviar cópias de acesso do Archivematica para o AtoM, ao mesmo tempo que mantém uma ligação entre suas cópias para preservação e para acesso. O AtoM também pode ser usado para gerenciar descrições arquivísticas de todo seu material digital e analógico, de forma que seus usuários não precisarão consultar diversos sistemas para fazer suas pesquisas.

source: We recognize that you may wish to use a different access system than AtoM, which is why we have developed workflows with CONTENTdm, Islandora, DSpace, Archivist's Toolkit and ArchivesSpace, for example. Other integrations are possible; see the next question below.
pt_br: Reconhecemos que você talvez deseje usar um sistema de acesso diferente do AtoM, e é por isso que desenvolvemos fluxos de trabalho com o CONTENTdm, o Islandora, o DSpace, o Archivist's Toolkit e o ArchivesSpace, por exemplo. Outras integrações são possíveis; consulte a próxima questão, abaixo.

source: **Can I describe content in Archivematica?**
pt_br: **Posso descrever conteúdo no Archivematica?**

source: You can ingest metadata as a CSV file or through the dashboard while processing. However, Archivematica is not an archival description system. In-depth contextual and content description can be done through an access system like AtoM.
pt_br: Você pode admitir metadados como um arquivo CSV ou através do dashboard durante o processamento. Entretanto, o Archivematica não é um sistema de descrição arquivística. Descrição contextual e de conteúdo mais detalhada pode ser feita através de um sistema de acesso como o AtoM.

source: **How does Archivematica prevent viruses?**
pt_br: **Como o Archivematica previne vírus?**

source: All ingested content is automatically scanned for viruses and malware using clamAV, a well-established open-source software tool that comes bundled with Archivematica. Virus definitions are updated on a regular basis.
pt_br: Todo conteúdo admitido é automaticamente escaneado à procura de vírus e malware usando o clamAV, uma ferramenta de software bem estabelecida de código aberto que vem junto com o Archivematica. Definições de vírus são atualizadas de forma regular.

source: **What is normalization and how does normalization work?**
pt_br: **O que é normalização, e como a funciona a normalização?**

source: Transcoding, or normalization, is automated through the use of preservation commands entered into the `Format Policy Registry <https://www.archivematica.org/en/docs/archivematica-1.6/user-manual/preservation/preservation-planning/#fpr>`_. Bundled tools for transcoding include ffmpeg, Inkscape, Ghostscript and ImageMagick. The FPR comes with hundreds of format-specific commands which can be edited by the user.
pt_br: A transcodificação, ou normalização, é automatizada através de uso do comandos de preservação inseridos na `Registro de Política de Formatos <https://www.archivematica.org/en/docs/archivematica-1.6/user-manual/preservation/preservation-planning/#fpr>`_. Ferramentas que vêm com o Archivematica para transcodificação incluem o ffmpeg, o Inkscape, o Ghostscript e o ImageMagick. A Política de Registro de Formatos vem com centenas de comandos para formatos específicos, que podem ser editados pelo usuário.

source: **How do I know if there are errors during ingest?**
pt_br: **Como eu sei se ocorreram erros durante a admissão?**

source: **I need to use Archivematica in conjunction with another system (for access, storage, etc). How can I integrate the two systems?**
pt_br: **Preciso usar o Archivematica junto com outro sistema (para acesso, armazenamento, etc.). Como posso integrar os dois sistemas?**

source: The list of systems and tools that Archivematica is integrated with grows with almost every release. If you are interested in having Archivematica integrate with a system which is not currently on our `Roadmap <https://www.archivematica.org/wiki/Development_roadmap:_Archivematica>`_, here are a few ideas:
pt_br: A lista de sistemas e ferramentas com os quais o Archivematica pode integrar aumenta praticamente a cada versão. Se você estiver interessado em integrar o Archivematica com um sistema que ainda não esteja em nosso `Roadmap <https://www.archivematica.org/wiki/Development_roadmap:_Archivematica>`_, aqui estão algumas ideias:

source: Post to the `user forum <https://groups.gtoogle.com/forum/#!forum/archivematica>`_ and ask community members if they have any experience creating a workflow between Archivematica and the other system.
pt_br: Poste no `fórum de usuários <https://groups.gtoogle.com/forum/#!forum/archivematica>`_ e pergunte aos membros da comunidade se eles têm alguma experiência em criar um fluxo de trabalho entre o Archivematica e o outro sistema.

source: If you have software development skills, consider writing to code required to integrate the two systems. If practical, we would gladly accept the code into the Archivematica code base via a `pull request <https://www.archivematica.org/wiki/Contribute_code>`_ .
pt_br: Se você tiver conhecimentos de desenvolvimento de software, considere escrever o código necessário para integrar os dois sistemas. Se for útil, aceitaremos com prazer inserir o código no código base do Archivematica através de um `pull request <https://www.archivematica.org/wiki/Contribute_code>`_ .

source: Contract Artefactual Systems to `write the code <http://www.artefactual.com/services/development/>`_. We will work with you to identify requirements and include the new integration code in the next software release, for the entire community's benefit.
pt_br: Entre em contato com a Artefactual Systems para `escrever o código <http://www.artefactual.com/services/development/>`_. Trabalharemos com você para identificar requisitos e incluir novos códigos de integração na próxima versão do software, para benefício de toda comunidade.

source: :ref:`Back to the top <faq>`
pt_br: :ref:`Voltar ao topo <faq>`
