Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/user-manual/archival-storage/aic.po
Languages: fr

source: Because datasets and digital object collections can be large and heterogeneous, one dataset or collection of digital objects may be broken into multiple AIPs. In such cases, the multiple AIPs can be intellectually combined into one AIC, or Archival Information Collection, defined by the OAIS reference model as "[a]n Archival Information Package whose Content Information is an aggregation of other Archival Information Packages." (OAIS 1-9).
fr: Étant donné que les jeux de données et les collections d'objets numériques peuvent être larges et hétérogènes, un ensemble de données ou une collection d'objets numériques peut être divisé en plusieurs AIP. Dans de tels cas, les AIP multiples peuvent être combinés intellectuellement dans un AIC, c.-à-d. une Collection d'information archivée (Archival Information Collection), défini par le modèle de référence OAIS comme étant « un Paquet d’informations archivé (AIP) dont le Contenu d’information est un agrégat d’autres AIP » (OAIS 1-9).

source: A basic AIC in Archivematica consists of:
fr: Une AIC de base dans Archivematica comprend :

source: any number of related AIPs and
fr: un nombre variable d’AIP connexes, et

source: a METS file containing a fileSec and a logical structMap listing all the related AIPs.
fr: un fichier METS contenant une fileSec et une structMap logique dressant la liste de tous les AIP.

source: In storage, a pointer.xml file gives storage and compression information for each AIC METS file and each AIP.
fr: Dans le stockage, un fichier pointeur.xml contient les informations de stockage et de compression de chaque AIP et du fichier METSde chaque AIC.

source: This part of the user guide is for creating and updating AICs.
fr: Cette partie du guide de l’utilisateur explique comment créer et mettre à jour une AIC.

source: Creating AICs
fr: Créer des AIC

source: **Step 1: Create AIPs**
fr: **Étape 1 : Créer des AIP**

source: Ingest a standard transfer consisting of metadata and data files, or create a SIP from backlog using the :ref:`SIP arrange pane <arrange-sip>`.
fr: Faire l’acquisition d’un paquet de fichiers de données et de métadonnées, ou créer un SIP à partir du Backlog grâce au volet :ref:`Classer un SIP<arrange-sip>`.

source: At the Normalize micro-service, click on the metadata button:
fr: Une fois le micro-service de Normalisation lancé, cliquer sur le bouton Métadonnées.

source: Under Metadata, select Add:
fr: Sous Métadonnées, sélectionner Ajouter.

source: Enter Dublin Core metadata. At a minimum, the AIC identifier (Part of AIC field) is required. However, if desired, use the metadata entry template to create a more detailed description of the AIP contents:
fr: Saisir les métadonnées Dublin Core. L’identifiant de l’AIC (dans le champ AIC) est obligatoire. Cependant, il est possible d'utiliser le modèle de saisie des métadonnées pour créer une description plus détaillée du contenu des AIP :

source: The AIC can be represented by any combination of letters and numbers.
fr: L’AIC peut être représentée par toute combinaison de lettres et de chiffres.

source: At bottom of screen, click the Create button.
fr: Au bas de l’écran, cliquer sur le bouton Ajouter.

source: Return to the ingest tab, finish processing and place the AIP in archival storage.
fr: Retourner à l’onglet Acquisition, terminer la procédure et placer l’AIP dans le dossier de stockage des archives.

source: Repeat steps 1 through 6 to create as many AIPs as desired. In step 1.4, be sure to enter the same value in Part of AIC if all of the AIPs are destined to be added to the same AIC.
fr: Répéter les étapes 1 à 6 pour créer tous les AIP souhaités. À l’étape 1.4, veiller à saisir la même valeur dans le champ Partie de l’AIC si tous les AIP doivent faire partie de la même AIC.

source: Once all the AIPs have been placed in storage, open the archival storage tab.
fr: Quand tous les AIP souhaités sont placés dans l’espace de stockage, ouvrir l’onglet Dossier de stockage des archives.

source: **Step 2: Create AIC**
fr: **Étape 2 : Créer une AIC**

source: To retrieve all AIPs with the same value in Part of AIC, enter AIC#[number] in the search box and select Part of AIC as the search field. On the right hand side, select "Show AICs?". Then click the Search archival storage button:
fr: Pour récupérer tous les AIP correspondant à la même AIC, saisir le numéro d’AIC (AIC#[number]) dans la case de recherche et sélectionner « Partie d’une AIC » comme champ de recherche. À droite, sélectionner « Afficher les AIC? » puis cliquer sur le bouton « Faire une recherche dans le dossier de stockage des archives » :

source: To create an AIC comprising all of the AIPs listed in the search results, click the Create an AIC button:
fr: Pour créer une AIC comprenant tous les AIP trouvés, cliquer sur le bouton « Créer une AIC ».

source: Archivematica will produce a metadata entry template for the AIC. In the template, at a minimum enter values into Title and Identifier fields.
fr: Archivematica produira un modèle de saisie des métadonnées pour l’AIC. Dans ce modèle, remplir au minimum les champs « Titre » et « Identifiant ».

source: The Identifier value must be structured as AIC#[number].
fr: La valeur de l’Identifiant doit être le numéro d’AIC (AIC#[number]).

source: If desired, use the metadata entry template to create a more detailed description of the AIC contents:
fr: Au besoin, utiliser le modèle de saisie des métadonnées pour créer une description plus détaillée du contenu des AIC.

source: Click the Create button at the bottom of the metadata entry template. Return to the ingest tab. When the AIC appears in the dashboard, approve the AIC:
fr: Cliquer sur le bouton « Ajouter », en bas du modèle et retourner à l’onglet Acquisition. Approuver l’AIC lorsqu’elle apparaît dans le Tableau de bord :

source: Continue processing the AIC and place it in archival storage.
fr: Continuer le traitement de l’AIC et la placer dans le Dossier de stockage des archives.

source: Retrieve and update AICs
fr: Extraire et mettre à jour des AIC

source: **Retrieve an AIC and related AIPs**
fr: **Extraire une AIC et ses AIP**

source: Open the Archival storage tab. To view a list of an AIC and its constituent AIPs, search for the AIPs as described in Create AIC, above. Click Add new to add a second search query using the OR boolean operator. In the second query line, enter AIC#[number] in the search box and select AIC Identifier as the search field. Click the Search archival storage button.
fr: Ouvrir l’onglet Dossier de stockage des archives. Pour afficher la liste d’une AIC et des AIP qu’elle contient, lancer une recherche par le nom choisi lors de sa création (voir ci-dessus). Cliquer sur « Ajouter » pour ajouter un second terme de recherche et l’opérateur booléen « OR » (c.-à-d. ou). Sur la seconde ligne, saisir le numéro d’AIC (AIC#[number]) et sélectionner « Identifiant AIC » comme champ de recherche. Cliquer sur le bouton « Faire une recherche dans le dossier de stockage des archives ».

source: In the results list, the AIC is distinguishable by the entry in the AIC # column, as shown in the screenshot (the constituent AIPs are shown with Part of AIC#[number]) in that field.
fr: Dans la liste des résultats, on peut repérer l’AIC par son identifiant dans la colonne AIC#, comme le montre la capture d’écran (les AIP connexes sont repérables par une partie de cet identifiant dans le même champ).

source: The Files column lists the number of AIPs in the AIC. This should match the number of AIPs shown in the search results. A bug is preventing the correct AIC file count in version 1.2 (see `Bug #7155 <https://projects.artefactual.com/issues/7155>`_ .
fr: La colonne Fichiers mentionne le nombre d’AIP contenus dans l’AIC. Ce chiffre doit correspondre au nombre de résultats produits par la recherche lancée précédemment. Un bogue entraîne une erreur de comptage des fichiers AIC dans la version 1.2 (voir `Bug #7155 <https://projects.artefactual.com/issues/7155>`_.

source: **Update an AIC**
fr: **Mettre à jour un AIC**

source: If you would like to add more AIPs to an existing AIC, the original AIC should be deleted via the archival storage tab. An AIC is deleted in the same way an AIP is deleted: see :ref:`Delete an AIP <delete-aip>`.
fr: Pour ajouter des AIP à une AIC, il faut supprimer l’AIC existante dans l’onglet Dossier de stockage des archives. La procédure pour supprimer une AIC est la même que la procédure suivie pour supprimer un AIP :ref:`Supprimer un AIP <delete-aip>`.

source: Add as many new AIPs as desired as shown Creating AIPs above, and create a new AIC as shown in Creating AICs.
fr: Ajouter tous les AIP souhaités et créer une nouvelle AIC en suivant leurs procédures de création respectives, indiquées ci-dessus.

source: :ref:`Back to the top <aic>`
fr: :ref:`Retour en haut de page <aic>`
