Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/admin-manual/installation-setup/integrations/duracloud-setup.po
Languages: fr

source: Archivematica-Duracloud Quick Start Guide
fr: Guide de démarrage rapide Archivematica-Duracloud

source: `ArchivesDirect <http://www.archivesdirect.org/>`_ is an Archivematica in DuraCloud hosting plan offered by Artefactual Systems and DuraSpace. This guide can be used by those who wish to install Archivematica and/or DuraCloud locally and run the systems themselves and may also be helpful for those using the hosted service. This guide assumes that you have already installed Archivematica and DuraCloud, or have arranged for a hosted instance through Artefactual Systems/DuraSpace. Hosted clients will have steps 1 and 2 completed for them.
fr: `ArchivesDirect <http://www.archivesdirect.org/>`_ est un plan d’hébergement d’Archivematica dans DuraCloud offert par Artefactual Systems et Duraspace. Ce guide sera utile aux personnes qui souhaitent installer Archivematica et/ou Duracloud sur leur machine et administrer elles-mêmes les systèmes; les personnes qui utilisent les services hébergés y trouveront aussi des informations pratiques. Le présent guide suppose qu’Archivematica et DuraCloud sont déjà installés sur votre ou vos machines, ou bien que vous avez déjà souscrit aux services hébergés auprès d’Artefactual Systems/DuraSpace. Les clients « hébergés » n’ont pas à suivre les deux premières étapes décrites dans ce guide.

source: For installation instructions please see:
fr: Pour les instructions d'installation, voir :

source: :ref:`Archivematica installation <installation>`
fr: :ref:`Installation d'Archivematica <installation>`

source: `DuraCloud documentation <https://wiki.duraspace.org/display/DURACLOUD/DuraCloud>`_
fr: `Documentation DuraCloud <https://wiki.duraspace.org/display/DURACLOUD/DuraCloud>`_

source: Step 1: Configure DuraCloud
fr: Étape 1 : Configurer DuraCloud

source: If you plan to use DuraCloud for transfer source, processing and AIP/DIP storage, it is recommended that your DuraCloud instance should be configured to have the following spaces:
fr: Si vous prévoyez d’utiliser DuraCloud comme source de transfert, traitement et stockage AIP/DIP, il est préférable de configurer DuraCloud de façon à créer les espaces suivants :

source: aip-store : This is the space where completed AIPs will be stored
fr: aip-store : espace où seront stockés les résultats des AIP

source: dip-store : Space where completed DIPs are stored
fr: dip-store : espace où seront stockés les résultats des DIP

source: transfer-source : Space to sync digital objects for transfer into Archivematica. You may also create multiple spaces with other names for this purpose.
fr: transfer-source : espace où seront synchronisés les objets numériques à transférer vers Archivematica. Vous pouvez créer de multiples espaces avec des noms différents à cette fin.

source: transfer-backlog : Space used by Archivematica for material sent to :ref:`backlog <manage-backlog>`.
fr: transfer-backlog : espace utilisé par Archivematica pour les fichiers envoyés vers :ref:`backlog <manage-backlog>`.

source: Note that you can pick and choose what spaces are needed in DuraCloud; for example, you may choose to use a local server for transfer source but send your AIPs and DIPs for storage in DuraCloud. You need only create the relevant spaces in DuraCloud for your particular configuration.
fr: Veuillez noter que vous pouvez choisir les espaces dont vous avez besoin dans DuraCloud; par exemple, vous pouvez utiliser un serveur local pour le transfert source et DuraCloud pour le stockage d’AIP et de DIP. Ne créez de nouveaux espaces dans DuraCloud que s’ils manquent pour votre configuration particulière.

source: Two DuraCloud users should be created:
fr: Deux utilisateurs DuraCloud devraient être créés:

source: An Client user, who has **read/write** permissions for transfer-source, and **read** permissions for aip-store and dip-store.
fr: Un utilisateur Client, qui aura permission de **lecture/écriture** dans transfer-source, et permission de **lecture** dans aip-store et dip-store.

source: An Archivematica user, who has **read/write** permissions for aip-store, dip-store and transfer-backlog, and **read** permission for transfer-source.
fr: Un utilisateur Archivematica, qui aura permission de **lecture/écriture** dans aip-store et dip-store et dans transfer-backlog, et permission de **lecture** dans transfer-source.

source: Step 2: Configure Archivematica Storage Service
fr: Étape 2 : Configurez le Service de stockage Archivematica

source: The :ref:`Archivematica Storage Service <storageservice:index>` was installed when you installed Archivematica.
fr: Le :ref:`Service de stockage Archivematica <storageservice:index>` a été installé avec Archivematica.

source: Set up a Storage Service space for each of transfer-source, transfer-backlog, aip-store and dip-store. Use the following parameters:
fr: Configurer un espace de Service de stockage pour chaque transfer-source, transfer-backlog, aip-store et dip-store. Utiliser les paramètres suivants :

source: Size: optional
fr: Size : optionnelle

source: Path: leave blank
fr: Path : laisser vide

source: Staging path: for example, ``/var/archivematica/storage_service/``
fr: Staging path : par exemple ``/var/archivematica/storage_service/``

source: Host: Hostname of the DuraCloud instance, e.g. trial.duracloud.org
fr: Host : Nom d’hébergement dans DuraCloud, ex. essai.duracloud.org

source: Username and Password: Enter Archivematica username and password that you created for DuraCloud in step 1.
fr: Username et Password : Indiquez le nom d'utilisateur et le mot de passe d'Archivematica que vous avez créé pour DuraCloud à l'étape 1.

source: Duraspace: the name of the space in DuraCloud you are creating this Storage Service space for (e.g. transfer-source, aip-store, etc).
fr: Duraspace : nom de l’espace dans DuraCloud pour lequel vous créez ce service de stockage (p. ex., transfer-source, aip-store, etc).

source: Other possible configurations are possible if you are not using DuraCloud for all Archivematica spaces.
fr: D’autres configurations sont possibles si vous ne créez pas tous vos espaces Archivematica dans DuraCloud.

source: Create one location in each space for aip-store, dip-store and transfer-backlog, choosing the appropriate purpose and relative path for each. Be sure to click on the pipeline to enable the location you are creating.
fr: Créez un emplacement dans chaque espace pour aip-store, dip-store et transfer-backlog, en choisissant le but et le chemin adapté à chacun. N’oubliez pas de cliquer sur le pipeline pour activer l’emplacement que vous créez.

source: If using DuraCloud for transfer-source, locations can be configured after content is synced- see below.
fr: Si vous créez votre espace transfer-source dans DuraCloud, les emplacements peuvent être configurés après la synchronisation du contenu, tel qu’indiqué ci-dessous.

source: Step 3: Download and configure sync tool
fr: Étape 3 : Télécharger et configurer l’outil de synchronisation

source: Content can be added to DuraCloud spaces via the sync tool, which can be installed from DuraSpace `here <https://wiki.duraspace.org/display/DURACLOUD/DuraCloud+Downloads>`_. The DuraCloud sync tool can be run through a GUI or the command line; these instructions will proceed using the GUI.
fr: L’ajout de contenu dans DuraCloud peut être automatisé grâce à l’outil de synchronisation, qui peut être téléchargé de DuraSpace `ici <https://wiki.duraspace.org/display/DURACLOUD/DuraCloud+Downloads>`_. L’outil de synchronisation de DuraCloud peut être lancé par la GUI ou par la ligne de commande. Les instructions qui suivent concernent le lancement par la GUI.

source: Step 4: Syncing content to DuraCloud
fr: Étape 4 : Synchroniser le contenu avec DuraCloud

source: These instructions pertain to users who use a DuraCloud space for transfer- source. DuraCloud offers its own `documentation <https://wiki.duraspace.org/display/DURACLOUDDOC/DuraCloud+Sync+Tool>`_ about syncing and configuring the DuraCloud Sync Tool. The following instructions are configuration requirements specific to users who have Archivematica transfer source locations in DuraCloud.
fr: Ces instructions concernent les utilisateurs qui ont créé leur espace transfer-source dans DuraCloud. DuraCloud offre son propre `guide <https://wiki.duraspace.org/display/DURACLOUDDOC/DuraCloud+Sync+Tool>`_ de synchronisation et de configuration de son outil de synchronisation. Les instructions suivantes sont des exigences de configuration spécifiques aux utilisateurs ayant des emplacements de transfert source Archivematica dans DuraCloud.

source: It is necessary to have a directory structure with a minimum depth of two levels inside the synced folder, in order for Archivematica to correctly interpret the files in DuraCloud as a potential transfer source. Deciding how to sync directories to DuraCloud is an important step for a number of reasons:
fr: Il est nécessaire d’avoir une arborescence de répertoires comportant une hiérarchie d’au moins deux niveaux au sein du dossier à synchroniser pour qu’Archivematica interprète correctement les fichiers stockés dans DuraCloud comme des sources potentielles de transfert. Il est important de décider comment vous allez procéder à vos mises à jour (synchronisations) avant de procéder, et ce, pour plusieurs raisons :

source: It will help prevent unnecessarily large transfers to Archivematica
fr: Cela contribuera à éviter des transferts trop volumineux vers Archivematica.

source: It can create a more efficient workflow for you later in Archivematica processing
fr: Cela vous aidera à fluidifier le déroulement des opérations futures de traitement de fichiers dans Archivematica.

source: Note that one transfer to Archivematica can either become one SIP (and therefore, one AIP and one DIP) or, a transfer can be sent to backlog where it can be separated and/or combined with other transfers to create one or more SIP(s). Two scenarios are outlined below:
fr: Veuillez noter qu’un transfert vers Archivematica peut soit devenir un SIP (et du même coup, un AIP), soit être envoyé au backlog, où il pourra être divisé ou combiné à d’autres transferts pour créer un ou plusieurs SIP. Voici deux exemples :

source: **Create a new directory to sync:**
fr: **Créer un nouveau répertoire à synchroniser :**

source: Create a top level directory on your local machine or server to sync to DuraCloud.
fr: Créer un répertoire parent sur votre machine locale ou sur votre serveur, à synchroniser dans DuraCloud.

source: Create at least 2 levels of directories within that directory before any digital objects.
fr: Créer au moins deux niveaux de répertoires inférieurs au sein du répertoire nouvellement créé avant d’ajouter tout objet numérique.

source: Example 1:
fr: Exemple 1 :

source: In this example, the directory called Transfers will be available in the Archivematica dashboard to support the choice of a transfer source. Project1 and Project2 would each be available as a transfer source. The transfers would each contain all of the digital objects in the directory in their respective transfers.
fr: Dans cet exemple, le répertoire appelé Transferts est accessible depuis le Tableau de bord Archivematica afin de permettre le choix d’une source de transfert : Projet1 ou Projet2. Les transferts contiennent chacun tous les objets numériques contenus dans le répertoire.

source: Example 2:
fr: Exemple 2 :

source: In this example, the archivist will have more flexibility when deciding which directory becomes a transfer in Archivematica. Either Project1 and Project2 could be transfers, as in the examples above, or the subdirectories within could become their own transfers (Photographs, Videos, etc).
fr: Dans cet exemple, l’archiviste aura une plus grande marge de manœuvre et pourra décider quels répertoires seront des sources potentielles de transferts dans Archivematica. Il pourrait s’agir de Projet1 et Projet2, comme dans l’exemple ci-dessus, ou bien de leurs sous-répertoires transférables séparément (photographies, vidéos, etc.)

source: **Sync an existing directory**
fr: **Synchroniser un répertoire existant**

source: If there are existing directories that you wish to sync but do not wish to reorganize into a directory structure deep enough to work with Archivematica, you can instead use the Sync Tool's prefix option:
fr: Si vous souhaitez synchroniser des répertoires existants, mais ne souhaitez pas créer de nouvelle arborescence suffisamment hiérarchisée pour être compatible avec Archivematica, vous pouvez utiliser l’option « préfixe » de l’outil de synchronisation.

source: Ensure your sync tool is stopped in the Status tab. Then click on the
fr: Dans l’onglet Statut, assurez-vous que l’outil est arrêté. Ensuite, cliquez sur l’

source: configuration tab.
fr: onglet Configuration.

source: Under "Other options," create a prefix for your sync folder to create a
fr: Sous « Autres options », créez un préfixe pour votre dossier à synchroniser, de façon à créer

source: directory structure at least two levels deep. The prefix must end in a slash (/).
fr: une hiérarchie à deux niveaux au moins. Le préfixe doit se terminer par une barre oblique (/).

source: Note that the prefix will replace the directory name of the sync folder in DuraCloud.
fr: Veuillez noter que le préfixe ainsi créé remplacera le nom du répertoire dans le dossier de synchronisation de DuraCloud.

source: If the sync directory selected in the sync tool is ``syncFolder``, you could add a prefix such as: ``transfers/Project1/``. Archivematica would then recognize ``transfers`` as a transfer source, and ``Project1`` would be available as a transfer. That transfer would contain all of the digital objects in ``syncFolder``.
fr: Si le nom du dossier de synchronisation sélectionné dans DuraCloud est « syncFolder », ``, vous pouvez ajouter par exemple le préfixe suivant : « transfers/Project1/ ». Archivematica reconnaîtrait le terme « transfer » et reconnaîtrait le dossier comme source potentielle de transfert, contenant tous les objets numériques du répertoire « syncFolder ».

source: It is also possible to use the prefix option with a sync folder which has subfolders.
fr: Il est également possible d’utiliser la fonction préfixe avec un dossier contenant des sous-dossiers.

source: If the sync directory selected in the sync tool is ``syncFolder``, you could add a prefix such as: ``transfers/Project1``. In this example, ``transfers`` will still be interpreted by Archivematica as a transfer source, but either ``Project1``, ``Photographs`` or ``Video`` could be chosen in the dashboard as the transfer.
fr: Si le répertoire à synchroniser sélectionné dans l’outil est « syncDossier », on peut y ajouter un préfixe comme « transfers/Project1` ». Dans ce cas, Archivematica identifie toujours le répertoire comme source de transfert, mais il devient possible de transférer séparément « Projet1 », « Photographies » ou « vidéos » depuis le Tableau de bord.

source: Step 5: Configure transfer sources
fr: Étape 5 : Configurer les sources de transfert

source: Assuming that you have configured transfer-source spaces in DuraCloud, return to the Archivematica Storage Serice at this point to configure transfer sources locations.
fr: Après avoir créé vos espaces transfer-source dans DuraCloud, retournez au Service de stockage d’Archivematica pour configurer l’emplacement des sources de transfert.

source: Navigate to the transfer-source Storage Service space and create locations for each top level directory inside the directory or directories you have synced.
fr: Trouvez l’espace réservé aux sources de transfert au sein du Service de stockage et créez-y un emplacement pour chaque dossier parent au sein du ou des répertoires que vous avez créés.

source: If you consistently use the same named top-level directory when syncing (e.g. "transfers") you will only need to configure the transfer source once.
fr: Si vous utilisez toujours le même nom pour votre dossier parent lorsque vous lancez une synchronisation (p. ex., « Transferts »), vous n’aurez pas à répéter cette opération.

source: If you browse for a path and do not see the expected directory listed, this may be caused by a UI bug. You can type the path in instead.
fr: Si un répertoire n’apparaît pas dans la liste des chemins, il y a peut-être un bogue UI (interface utilisateur). Vous pouvez saisir le chemin d'accès manuellement.

source: :ref:`Back to the top <duracloud-setup>`
fr: :ref:`Retour en haut de page <duracloud-setup>`
