Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/overview/dashboard.po
Languages: fr, pt_br

source: Web-based dashboard
fr: Tableau de bord en ligne
pt_br: Painel baseado na Web

source: From the end-user perspective, all of Archivematica's functions take place within a web-based dashboard which can be accessed from anywhere by logging in through a web browser.
fr: Du point de vue de l'utilisateur, toutes les fonctions d'Archivematica se font à l'intérieur d'un tableau de bord en ligne qui peut être accédé de partout en passant par un navigateur web.
pt_br: Do ponto de vista do usuário final, todas as funções do Archivematica ocorrem dentro de um painel baseado na web, que pode ser acessado de qualquer lugar, fazendo login através de um navegador da web.

source: The Dashboard is akin to a "processing space" for digital archives, allowing archivists to move packages of digital materials through the Archivematica pipeline before sending packages for storage or dissemination.
fr: Le Tableau de bord s'apparente à un «espace de traitement» pour les archives numériques, permettant aux archivistes de déplacer des paquets de documents numériques via le pipeline Archivematica avant d'envoyer des paquets vers le stockage ou la diffusion.
pt_br: O Painel é semelhante a um "espaço de processamento" para arquivos digitais, permitindo que os arquivistas movam pacotes de materiais digitais através do pipeline Archivematica antes de enviar pacotes para armazenamento ou disseminação.

source: A description of the Dashboard elements follows, with numbers referencing the image above.
fr: Une description des éléments du Tableau de bord suit, avec des numéros faisant référence à l'image au-dessus.
pt_br: Segue-se uma descrição dos elementos do painel, com números referentes à imagem acima.

source: 1. Tabs
fr: 1. Onglets
pt_br: 1. Abas

source: The Dashboard is divided into a number of tabs, with the grey area indicating the tab currently in view. Alerts appear in red circles when there is action required by the archivist in a tab. The names of the tabs (Transfer, Ingest, Archival storage, Preservation planning, Access, Administration) reference both the OAIS model, as well as sections of the user documentation.
fr: Le Tableau de bord est divisé en plusieurs onglets, la zone grise indiquant l'onglet en cours de visualisation. Des alertes apparaissent dans un cercle rouge lorsqu'une action est requise par l'archiviste. Les noms des onglets (Transfert, Acquisition, Dossier de stockage des archives, Planification de la préservation, Accès, Administration) renvoient à la fois au modèle OAIS et aux sections de la documentation de l’utilisateur.
pt_br: O painel é dividido em várias abas, com a área cinza indicando a aba atualmente em exibição. Os alertas aparecem em círculos vermelhos quando há uma ação exigida pelo arquivista em uma aba. Os nomes das guias (Transferência, Ingest, Armazenamento de arquivamento, Planejamento de preservação, Acesso, Administração) fazem referência ao modelo OAIS, bem como às seções da documentação do usuário.

source: 2. User login
fr: 2. Authentification de l'utilisateur
pt_br: 2. Login do usuário

source: The user login name appears beside the tabs, and is where the user logs out from when processing work is complete.
fr: Le nom de l'utilisateur utilisé lors de l’authentification apparaît à côté des onglets. C’est aussi à cet endroit que l'utilisateur peut se déconnecter lorsque le traitement est terminé.
pt_br: O nome de login do usuário aparece ao lado das abas, e é onde o usuário efetua logout quando o trabalho de processamento é concluído.

source: 3. Packages
fr: 3. Paquets
pt_br: 3. Pacotes

source: At any given time, any number of packages could be present in the Transfer and Ingest tabs, representing a Transfer of material or a Submission Information Package (SIP), respectively. A package will either be:
fr: À tout moment, un certain nombre de paquets pourraient être présents dans les onglets Transfert (Transfert de matériel) et Acquisition (Paquet d'information à verse ou SIP). Le statut d’un paquet peut être :
pt_br: A qualquer momento, qualquer número de pacotes pode estar presente nas abas Transferência e Ingest, representando uma transferência de material ou um pacote de informações de envio (SIP), respectivamente. Um pacote será:

source: In progress, indicated by green arrows
fr: En cours, indiqué par une flèche verte
pt_br: Em andamento, indicado por setas verdes

source: In need of a decision to be made, indicated by a bell icon
fr: En attente d'une décision, indiquée par une icône de cloche
pt_br: Necessidade de uma decisão a ser tomada, indicado por um ícone de sino

source: Completed, indicated by a green checkmark
fr: Complété, indiqué par un crochet vert
pt_br: Concluído, indicado por uma marca de verificação verde

source: Failed, indicated by a red stop symbol
fr: Échec, indiqué par un symbole d'arrêt rouge
pt_br: Falhou, indicado por um símbolo de parada vermelho

source: Rejected by the archivist, indicated by a grey stop symbol
fr: Rejeté par l'archiviste, indiqué par un symbole d'arrêt gris
pt_br: Rejeitado pelo arquivista, indicado por um símbolo de parada cinza

source: It is a good practice to "clean up" the Dashboard periodically by removing packages using the red "remove" button (see below).
fr: Il est recommandé de "nettoyer" le tableau de bord périodiquement en supprimant les paquets. Pour ce faire, utilisez le bouton rouge "supprimer" (voir ci-dessous).
pt_br: É uma boa prática "limpar" o Painel periodicamente removendo pacotes usando o botão vermelho "remover" (veja abaixo).

source: 4. Micro-services and Jobs
fr: 4. Microservices et tâches
pt_br: 4. Micro-serviços e tarefa

source: Archivematica's processing is performed through a number of :ref:`micro-services <micro-services>`. Micro-services are provided by a combination of Archivematica Python scripts and one or more of the free, open-source `software tools <https://www.archivematica.org/wiki/External_tools>`_ bundled in the Archivematica system.
pt_br: O processamento do Archivematica é realizado por meio de vários:ref:`micro-serviços <micro-services>`. Os micro-serviços são fornecidos por uma combinação de scripts do Archivematica Python e um ou mais dos recursos gratuitos e de código aberto. `ferramentas de software <https://www.archivematica.org/wiki/External_tools>`_ agrupados no sistema Archivematica..

source: These micro-services are broken down into a number of jobs, which users can see by clicking on the micro-service to expand. Clicking on the gear icon within a job will open a new browser tab showing the tasks performed for that particular job.
pt_br: Esses micro-serviços são divididos em várias tarefas, que os usuários podem ver clicando no micro-serviço para expandir. Clicar no ícone de engrenagem em um trabalho abrirá uma nova guia do navegador, mostrando as tarefas executadas para esse trabalho específico.

source: 5. Decision
fr: 5. Décision
pt_br: 5. Decisão

source: Certain micro-services result in a decision point for the archivist. The decision is completed by choosing an available option from a drop-down menu. Many of the decision points can be pre-configured if desired in the :ref:`Administration tab <dashboard-processing>`.
pt_br: Certos micro-serviços resultam em um ponto de decisão para o arquivista. A decisão é concluída escolhendo uma opção disponível em um menu suspenso. Muitos dos pontos de decisão podem ser pré-configurados, se desejado, na aba: ref: `Administração<dashboard-processing>`.

source: 6. Report/remove icons
pt_br: 6. Informar/remover ícones

source: Report (paper and pencil) icons appear on Transfer and Ingest packages and link the user to the :ref:`descriptive <add-metadata>` and :ref:`rights <add-rights>` metadata entry page. (The same icon is used for forensic disk image transfer metadata entry as well as the :ref:`normalization report <normalize>`).
pt_br: Ícones de relatório (papel e lápis) aparecem nos pacotes Transferência e Ingest e vinculam o usuário ao: ref: `descritivo<add-metadata>` e :ref: `direitos <add-rights>` página de entrada de metadados. (O mesmo ícone é usado para entrada de metadados de transferência de imagens de disco forense, assim como :ref:`relatório de normalização <normalize>`).

source: The red remove icon removes the package from the Dashboard. The package can be removed whether the processing is completed or not. It is best practice to remove completed packages periodically as a "cleanup" procedure to keep the web browser running smoothly. Note that removing a package **does not** delete the package or any AIPs or DIPs associated with it.
pt_br: O ícone vermelho remove exclui o pacote do painel. O pacote pode ser removido se o processamento estiver concluído ou não. É uma prática recomendada remover pacotes concluídos periodicamente como um procedimento de "limpeza" para manter o navegador da web funcionando sem problemas. Observe que remover um pacote **não** exclui o pacote ou quaisquer AIPs ou DIPs associados a ele.

source: :ref:`Back to the top <web-dashboard>`
fr: :ref:`Retour en haut de page <web-dashboard>`
pt_br: :ref:`Voltar ao topo <web-dashboard>`
