Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/overview/microservices.po
Languages: fr, pt_br

source: Micro-services
pt_br: Micro-serviços

source: Archivematica implements a micro-service approach to digital preservation. The Archivematica micro-services are granular system tasks which operate on a conceptual entity that is equivalent to an OAIS information package: Submission Information Package (SIP), Archival Information Package (AIP), Dissemination Information Package (DIP). The physical structure of an information package will include files, checksums, logs, submission documentation, XML metadata, etc.
fr: Archivematica met en œuvre une approche axée sur les microservices pour la préservation numérique. Les microservices Archivematica sont des tâches système granulaires qui fonctionnent sur une entité conceptuelle équivalente à un paquet d'information OAIS : soit les Paquet d'information à verser (SIP - Submission Information Package), les Paquets d'information archivés (AIP - Archival Information Package), et les Paquet d'information diffusé (DIP - Dissemination Information Package). La structure physique d'un paquet d'information comprendra des fichiers, des sommes de contrôle, des journaux, de la documentation de soumission, des métadonnées XML, etc.
pt_br: O Archivematica implementa uma abordagem de micro-serviço para preservação digital. Os micro-serviços Archivematica são tarefas granulares do sistema que operam em uma entidade conceitual equivalente a um pacote de informações OAIS: Pacote de informação de submissação (SIP), Pacote de informação arquivística (AIP), Pacote de informação de divulgação (DIP). A estrutura física de um pacote de informações incluirá arquivos, checksums, logs, documentação de submissão, metadados XML, etc.

source: These information packages are processed using a series of micro-services. Micro-services are provided by a combination of Archivematica Python scripts and one or more of the free, open-source `software tools <https://www.archivematica.org/wiki/External_tools>`_ bundled in the Archivematica system. Each micro-service results in a success or error state and the information package is processed accordingly by the next micro- service. There are a variety of mechanisms used to connect the various micro- services together into complex, custom workflows, resulting in a complete ingest to access system.
fr: Ces paquets d'informations sont traités à l'aide d'une série de microservices. Les microservices sont fournis par une combinaison de scripts Python Archivematica et un ou plusieurs des `outils logiciels <https://www.archivematica.org/wiki/External_tools>`_ gratuits de source ouverte regroupés dans le système Archivematica. Chaque microservice entraîne un état de réussite ou d'erreur, et le paquet d'informations est traité en conséquence par le microservice suivant. Il existe une variété de mécanismes utilisés pour relier les différents microservices à des flux de travail complexes et personnalisés, ce qui donne lieu à un système complet allant de l’acquisition à l’accès.
pt_br: Esses pacotes de informações são processados ​​usando uma série de micro-serviços. Os micro-serviços são fornecidos por uma combinação de scripts do Archivematica Python e um ou mais dos recursos gratuitos e de código aberto. `ferramentas de software <https://www.archivematica.org/wiki/External_tools>` _ incluídas no sistema Archivematica. Cada micro-serviço resulta em um estado de acerto ou erro e o pacote de informações é processado de acordo com o próximo micro-serviço. Há uma variedade de mecanismos usados ​​para conectar os vários micro-serviços em fluxos de trabalho complexos e personalizados, resultando em um processo completo de acesso ao sistema.

source: Archivematica implements a default ingest to access workflow that is compliant with the ISO-OAIS functional model. Micro-services can be distributed to processing clusters for highly scalable configurations.
fr: Archivematica met en oeuvre un flux de travail par défaut, allant de l’acquisition à l’accès, conforme au modèle fonctionnel ISO-OAIS. Les microservices peuvent être distribués aux groupes de systèmes de traitement pour des configurations hautement évolutives.
pt_br: O Archivematica implementa uma entrada padrão para acessar o fluxo de trabalho que é compatível com o modelo funcional ISO-OAIS. Micro-serviços podem ser distribuídos para processamento de clusters para configurações altamente escalonáveis.

source: Micro-services in Archivematica Releases
fr: Microservices dans les différentes versions d'Archivematica
pt_br: Micro-serviços em lançamentos do Archivematica

source: The Archivematica wiki contains an updated `list of micro-services <https://wiki.archivematica.org/Micro-services>`._
fr: Le wiki Archivematica contient une `liste de microservices <https://wiki.archivematica.org/Micro-services>`_ à jour.
pt_br: O wiki Archivematica contém uma `lista de micro-serviços atualizada <https://wiki.archivematica.org/Micro-services> ._

source: `Archivematica 1.1 Micro-services <https://www.archivematica.org/wiki/Archivematica_1.1_Micro-services>`_
fr: `Microservices - Archivematica 1.1 <https://www.archivematica.org/wiki/Archivematica_1.1_Micro-services>`_
pt_br: `Micro-serviços Archivematica 1.1 <https://www.archivematica.org/wiki/Archivematica_1.1_Micro-services>` _

source: `Archivematica 1.0 Micro-services <https://www.archivematica.org/wiki/Archivematica_1.0_Micro-services>`_
fr: `Microservices - Archivematica 1.0 <https://www.archivematica.org/wiki/Archivematica_1.0_Micro-services>`_
pt_br: `Micro-serviços Archivematica 1.0 <https://www.archivematica.org/wiki/Archivematica_1.0_Micro-services>` _

source: `Archivematica 0.10 Micro-services <https://www.archivematica.org/wiki/Archivematica_0.10_Micro-services>`_
fr: `Microservices - Archivematica 0.10 <https://www.archivematica.org/wiki/Archivematica_0.10_Micro-services>`_
pt_br: `Micro-serviços Archivematica 0.10<https://www.archivematica.org/wiki/Archivematica_0.10_Micro-services>` _

source: `Archivematica 0.9 Micro-services <https://www.archivematica.org/wiki/Archivematica_0.9_Micro-services>`_
fr: `Microservices - Archivematica 0.9 <https://www.archivematica.org/wiki/Archivematica_0.9_Micro-services>`_
pt_br: `Micro-serviços Archivematica 0.9 <https://www.archivematica.org/wiki/Archivematica_0.9_Micro-services>` _

source: `Archivematica 0.8 Micro-services <https://www.archivematica.org/wiki/Archivematica_0.8_Micro-services>`_
fr: `Microservices - Archivematica 0.8 <https://www.archivematica.org/wiki/Archivematica_0.8_Micro-services>`_
pt_br: `Archivematica 0.8 Micro-serviços <https://www.archivematica.org/wiki/Archivematica_0.8_Micro-services>` _

source: `Archivematica 0.7.1 Micro-services <https://www.archivematica.org/wiki/Archivematica_0.7.1_Micro-services>`_
fr: `Microservices - Archivematica 0.7.1 <https://www.archivematica.org/wiki/Archivematica_0.7.1_Micro-services>`_
pt_br: `Micro-serviços Archivematica 0.7.1 <https://www.archivematica.org/wiki/Archivematica_0.7.1_Micro-services>` _

source: :ref:`Back to the top <micro-services>`
fr: :ref:`Retour en haut de page <micro-services>`
pt_br: :ref:`Voltar ao topo <micro-services>`
