Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/getting-started/overview/technical.po
Languages: pt_br

source: Technical architecture
pt_br: Arquitetura técnica

source: Archivematica Ingest infrastructure overview
pt_br: Archivematica Ingest visão geral da infraestrutura

source: This page provides a high-level overview of Archivematica's technical architecture.
pt_br: Esta página fornece uma visão geral de alto nível da arquitetura técnica do Archivematica.

source: Micro-services design pattern
pt_br: Padrão de design de micro-serviços

source: Archivematica implements a micro-service approach to digital preservation. The Archivematica micro-services are granular system tasks which operate on a conceptual entity that is equivalent to an OAIS information package: Submission Information Package (SIP), Archival Information Package (AIP), Dissemination Information Package (DIP). The physical structure of an information package will include files, checksums, logs, submission documentation, XML metadata, etc.
pt_br: Os micro-serviços Archivematica são tarefas granulares do sistema que operam em uma entidade conceitual equivalente a um pacote de informações OAIS: Pacote de Informação de Submissão (SIP), Pacote de Informação Arquivística (AIP), Pacote de Informação de Divulgação (DIP). A estrutura física de um pacote de informações incluirá arquivos, somas de verificação, logs, documentação de envio, metadados XML, etc.

source: For more information, see :ref:`Micro-services <micro-services>`.
pt_br: Para mais informações, consulte: ref: `Micro-serviços <micro-services>`.

source: Web-based dashboard
pt_br: Painel baseado na Web

source: The web dashboard allow users to process, monitor and control the Archivematica workflow processes. It is developed using Python-based Django MVC framework. The Dashboard provides a multi-user interface that will report on the status of system events and make it simpler to control and trigger specific micro-services. This interface allows users to easily add or edit metadata, coordinate AIP and DIP storage and provide preservation planning information. Notifications include error reports, monitoring of MCP tasks and manual approvals in the workflow.
pt_br: O painel da web permite que os usuários processem, monitorem e controlem os processos de fluxo de trabalho do Archivematica. Ele é desenvolvido usando o framework Django MVC baseado em Python. O Painel fornece uma interface multiususo que relatará o status dos eventos do sistema e simplificará o controle e o acionamento de micro-serviços específicos. Essa interface permite que os usuários adicionem ou editem facilmente metadados, coordenem o armazenamento de AIP e DIP e forneçam informações de planejamento de preservação. As notificações incluem relatórios de erros, monitoramento de tarefas do MCP e aprovações manuais no fluxo de trabalho.

source: For more information, see :ref:`Web-based dashboard <web-dashboard>`.
pt_br: Para mais informações, consulte: ref: `Painel de controle baseado na Web <web-dashboard>`.

source: Format policies
pt_br: Políticas de formato

source: Archivematica maintains the original format of all ingested files to support migration and emulation strategies. However, the primary preservation strategy is to normalize files to preservation and access formats upon ingest. Archivematica groups file formats into format policies (e.g. text, audio, video, raster image, vector image, etc.). Archivematica's preservation formats must all be open standards. Additionally, the choice of formats is based on community best practices, availability of free and open-source normalization tools, and an analysis of the significant characteristics for each media type. The choice of access formats is based largely on the ubiquity of web-based viewers for the file format.
pt_br: O Archivematica mantém o formato original de todos os arquivos ingeridos para suportar as estratégias de migração e emulação. No entanto, a principal estratégia de preservação é normalizar os arquivos para preservar e acessar os formatos após a ingestão. O Archivematica agrupa formatos de arquivo em políticas de formato (por exemplo, texto, áudio, vídeo, imagem rasterizada, imagem vetorial, etc.). Os formatos de preservação do Archivematica devem todos ser padrões abertos. Além disso, a escolha de formatos é baseada nas melhores práticas da comunidade, na disponibilidade de ferramentas de normalização gratuitas e de código aberto e na análise das características significativas de cada tipo de mídia. A escolha dos formatos de acesso é baseada em grande parte na onipresença de visualizadores baseados na Web para o formato de arquivo.

source: Since the 1.0 production release, Archivematica format policies have been moved to a structured, online format policy registry (FPR) that brings together format identification information with significant characteristic analysis, risk assessments and normalization tool information to arrive at default preservation format and access format policies for Archivematica.
pt_br: Desde o release de produção 1.0, as políticas de formato Archivematica foram movidas para um registro de políticas de formato online estruturado (FPR) que reúne informações de identificação de formato com análise de característica significativa, avaliações de risco e informações de ferramentas de normalização para chegar ao formato de preservação padrão e políticas de formato de acesso para o Archivematica.

source: From Transfer to SIP to AIP and DIP
pt_br: De Transferência para SIP para AIP e DIP

source: The primary function of Archivematica is to process digital transfers (accessioned digital objects), turn them into SIPs, apply format policies and create high-quality, repository-independent Archival Information Packages (AIP) using `METS <http://www.loc.gov/standards/mets/>`_, `PREMIS <http://www.loc.gov/standards/premis/>`_ and `Bagit <https://confluence.ucop.edu/download/attachments/16744580/BagItSpec.pdf?version=1>`_. Archivematica is bundled with `AtoM <http://www.accesstomemory.org>`_ but is designed to upload Dissemination Information Packages (DIP), containing descriptive metadata and web-ready access copies, to any access system (e.g. Dspace, ContentDM, etc.).
pt_br: A função principal do Archivematica é processar transferências digitais (objetos digitais acessados), transformá-los em SIPs, aplicar políticas de formato e criar Pacotes de Informações de Arquivamento (AIP) independentes de repositório e de alta qualidade usando `METS <http://www.loc.gov/standards/mets/>`_, `PREMIS <http://www.loc.gov/standards/premis/>`_ and `Bagit <https://confluence.ucop.edu/download/attachments/16744580/BagItSpec.pdf?version=1>`_. O Archivematica é agrupado com o `AtoM <http://www.accesstomemory.org>` _, mas é projetado para carregar Pacotes de Informações de Divulgação (DIP), contendo metadados descritivos e cópias de acesso à web, para qualquer sistema de acesso (por exemplo, Dspace, ContentDM , etc.).

source: Single install
pt_br: Instalação única

source: Using the latest in virtualization technology, each release of the Archivematica system packages a customized Xubuntu environment as a `virtual appliance <http://en.wikipedia.org/wiki/Virtual_appliance>`_, making it possible to run on top of any consumer-grade hardware and operating system. This means the entire suite of digital preservation tools is now available from one simple installation. Archivematica can also be installed directly on dedicated hardware via its own Ubuntu repository. Its client/server processing architecture allows it to be deployed in multi-node, distributed processing configurations to support large-scale, resource- intensive production environments.
pt_br: Usando o mais recente em tecnologia de virtualização, cada versão do sistema Archivematica empacota um ambiente Xubuntu customizado como um `appliance virtual <http://en.wikipedia.org/wiki/Virtual_appliance>` _, tornando possível rodar em cima de qualquer hardware e sistema operacional ao nível de consumidor. Isso significa que todo o conjunto de ferramentas de preservação digital está disponível a partir de uma instalação simples. O Archivematica também pode ser instalado diretamente no hardware dedicado através do seu próprio repositório do Ubuntu. Sua arquitetura de processamento cliente/servidor permite que ele seja implementado em configurações de processamento distribuído de vários nós para suportar ambientes de produção em larga escala e com uso intensivo de recursos.

source: :ref:`Back to the top <technical-arch>`
pt_br: :ref:`Voltar ao topo <technical-arch>`
