Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/user-manual/transfer/bags.po
Languages: fr

source: Library of Congress Bagit format
fr: Format BagIt de la Library of Congress

source: Archivematica allows the ingest of the `Library of Congress Bagit <http://en.wikipedia.org/wiki/BagIt>`_ format. Users can ingest both zipped and unzipped bags. Bags must be packaged in accordance with the Bagit specification.
fr: Archivematica permet l’acquisition de fichiers au format `BagIt<http://en.wikipedia.org/wiki/BagIt>`_ de la Library of Congress. Les utilisateurs peuvent acquérir des « bags » (ensembles de contenus dits arbitraires ou aléatoires), compressés ou non. Ces bags doivent être agencés selon les normes BagIt.

source: To ingest a zipped bag, user selects transfer type "Zipped bag" from the dropdown menu in the transfer tab of the Dashboard. Do not add the directory that the zipped bag is in from the browse dialog, just select the zipped file (.zip). Note that you cannot add a new title to the zipped bag transfer, but you can add an accession number.
fr: Pour acquérir un bag compressé, l’utilisateur sélectionne le type de transfert « Bag compressé » à partir du Tableau de bord. Ne pas ajouter le répertoire d’origine du bag dans la boîte de dialogue, sélectionner simplement le fichier .zip. Note : il n’est pas possible de renommer le transfert d’un bag compressé, mais on peut y associer un numéro d’acquisition .

source: To ingest an unzipped bag, user selects transfer type "Unzipped bag" from the dropdown menu in the transfer tab of the Dashboard. You may add a new name or accession number to this unzipped bag.
fr: Pour acquérir un bag non compressé, l’utilisateur sélectionne le type de transfert « Bag non compressé » dans le menu déroulant du Tableau de bord. Il est possible de renommer le transfert ou d’y ajouter un numéro d’acquisition.

source: Index and search bag metadata
fr: Indexer et faire une recherche dans les métadonnées d’un bag

source: In Archivematica 1.4 and higher, fields in the bag-info.txt file are indexed as source metadata in the Archivematica METS file, making their contents searchable in the Archival storage tab after a bag transfer has been processed and stored.
fr: Depuis la version 1.4 d’Archivematica, les champs du fichier bag-info.txt sont indexés comme des métadonnées sources dans le fichier METS, ce qui permet d’effectuer une recherche à partir de l’onglet Dossier de stockage des archives, une fois le bag transféré et archivé.

source: Labels in bag-info.txt file serialized as XML in METS sourceMD, linked to the objects directory of the AIP.
fr: Les étiquettes du fichier bag-info.txt sont rendues au format XML dans le dossier METS sourceMD, et liées au répertoire contenant les objets de l’AIP.

source: Sample bag-info.txt (from https://tools.ietf.org/html/draft-kunze-bagit-10)
fr: Exemple : bag-info.txt (https://tools.ietf.org/html/draft-kunze-bagit-10)

source: Sample AIP METS file result:
fr: Exemple de résultat dans le ficher METS de l’AIP :

source: To be parsed into the METS file, Bag labels must be compliant with XML, so cannot contain spaces or forbidden characters.
fr: Pour être rendues dans le fichier METS, les étiquettes du bag doivent être compatibles avec le format XML, et ne doivent donc comporter aucune espace ni aucun caractère interdit.

source: To search the bag (transfer) metadata in the Archival Storage tab:
fr: Pour faire une recherche dans les métadonnées du bag (transfert) à partir de l’onglet Dossier de stockage des archives :

source: Use keyword field "Transfer metadata" to search all the contents of the <transfer_metadata> container in the METS file (as indexed in Elasticsearch).
fr: Utiliser le terme « Transférer les métadonnées » pour lancer une recherché dans la totalité du contenu <transfer_metadata> du fichier METS, (tel qu’indexé dans Elasticsearch).

source: Use keyword field "Transfer metadata (other)" to search individual fields in the <transfer_metadata> container. When the user selects "Transfer metadata (other)" a separate box will appear which will allow the user to enter the label of the specific field to be searched.
fr: Utiliser le terme « Transférer les métadonnées (autres) » pour lancer une recherche dans des champs particuliers du contenu <transfer_metadata>. Quand l’utilisateur sélectionne ce terme, une boîte de dialogue apparaît pour permettre la saisie des champs dans lesquels la recherche doit se faire.

source: To search on a date range in <transfer_metadata> or one if its sub-fields, the user enters two dates in ISO date format separated by a colon. For example, ``2015-01-03:2015-04-14``.
fr: Pour préciser une plage de dates dans <transfer_metadata> ou dans l’un des champs, l’utilisateur doit saisir deux dates en format ISO, séparées par deux points (:), p.ex., 2015-01-03:2015-04-14.

source: :ref:`Back to the top <bags>`.
fr: :ref:`Retour en haut de page <bags>`.
