Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/user-manual/transfer/manage-backlog.po
Languages: fr

source: Managing a backlog
fr: Gérer un backlog

source: Users may wish to send their transfers to a backlog for storage until they are ready to be retrieved and processed at a later date. Sending transfers through the micro-services in the transfer tab of the dashboard allows the repository a minimum amount of control over their digital objects. The transfer contents and METS file are indexed to facilitate retrieval.
fr: Les utilisateurs peuvent souhaiter envoyer leurs transferts à un backlog pour le stockage jusqu'à ce qu'ils soient prêts à être récupérés et traités à une date ultérieure. L'envoi de transferts par l’entremise des microservices dans l'onglet Transfert du tableau de bord permet au dépôt d'avoir un minimum de contrôle sur leurs objets numériques. Le contenu du transfert et le fichier METS sont indexés pour faciliter la récupération.

source: This workflow assumes that users have sent transfers to backlog from the end of the transfer workflow in the dashboard, in the Micro-service: Create SIP from Transfer, Job: Create SIP(s) dropdown menu. (Option 2 in Step 7 in :ref:`Process the transfer <process-transfer>`).
fr: Ce flux de travail suppose que les utilisateurs ont envoyé des transferts au backlog à partir de la fin du déroulement des opérations de transfert dans le tableau de bord, dans le menu déroulant Microservice : Création d’un SIP à partir du transfert, Tâche : Création de SIP(s). (Option 2 de l'étape 7 dans Traiter un transfert).

source: Retrieve from backlog
fr: Récupérer à partir du backlog

source: Use the Transfer backlog search bars at the top of the Ingest tab to find the transfer(s) and/or object(s) you'd like to ingest, or browse the entire backlog by clicking Search transfer backlog with a blank search. This will populate the Originals pane of the Ingest dashboard.
fr: Pour repérer les transferts et/ou les objets que vous souhaitez acquérir, utilisez les champs de recherche du Backlog des transferts figurant en haut de l'onglet Acquisition, ou parcourez le backlog complet en cliquant sur Chercher dans le backlog des transferts tout en laissant la case de recherche vide, ce qui alimentera le volet Originaux de l’onglet Acquisition.

source: Multi-item select is not yet included in this feature, though entire folders/directories can be moved.
fr: Vous ne pouvez pas sélectionner plusieurs éléments ici, mais vous pouvez déplacer des dossiers/répertoires complets.

source: To hide directories from the Originals pane, click on the directory and click Hide.
fr: Pour masquer les répertoires du volet Originaux, cliquez sur le répertoire puis sur Masquer.

source: Transfer backlog search results populate Originals pane
fr: Transférer les résultats de la recherche du backlog dans le volet Originaux

source: Drag and drop the transfer directory(ies) and/or object(s) you wish to arrange and ingest as a SIP from the Originals panel to the Arrange panel, or create an arrangement structure for your SIP.
fr: Glissez-déplacez les répertoires et/ou les objets du transfert que vous voulez classer et acquérir du volet Originaux au volet Classer, ou créez une structure de classement pour votre SIP.

source: If you wish to create one or more SIP(s) from one or more transfer(s), see :ref:`Arrange SIP(s) <arrange-sip>`.
fr: Si vous souhaitez créer un ou plusieurs SIP à partir d'un ou plusieurs transferts, voir :ref:`Classer un SIP <arrange-sip>`.

source: Click on the directory in the Arrange pane to select, and then click Create SIP. Archivematica will confirm that you wish to create a SIP, and then continue through the ingest process.
fr: Cliquez sur le répertoire du volet Classer pour le sélectionner et ensuite sur Créer un SIP. Archivematica confirmera que vous désirez bien créer un SIP, et procédera ensuite à l’acquisition.

source: In the Ingest tab, your SIP will be waiting for a user decision. Select "SIP creation complete" from the dropdown menu.
fr: Dans l'onglet Acquisition, votre SIP attend une décision de l'utilisateur. Sélectionnez "Création du SIP complète" dans le menu déroulant.

source: Continue processing using the ingest workflow. See :ref:`Ingest <ingest>`.
fr: Poursuivre le traitement à l'aide du flux de travail pour l'acquisition. Voir :ref:`Acquisition <ingest>`.

source: Once you've created an AIP and uploaded it to archival storage, your transfer will be removed from the backlog and the index will be updated.
fr: Une fois l'AIP créé et téléchargé dans le Dossier de stockage des archives, votre transfert sera retiré du backlog et l'index sera mis à jour.

source: :ref:`Back to the top <manage-backlog>`
fr: :ref:`Retour en haut de page <manage-backlog>`
