Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/admin-manual/maintenance/maintenance.po
Languages: fr, pt_br

source: Maintenance
fr: Entretien
pt_br: Manutenção

source: *On this page:*
fr: **Sur cette page*
pt_br: *Nesta página:*

source: :ref:`Delete Elasticsearch index <elasticsearch-delete>`
fr: :ref:`Supprimer l’index Elasticsearch <elasticsearch-delete>`
pt_br: :ref:`Excluir índice ElasticSearch <elasticsearch-delete>`

source: :ref:`Rebuild AIP or transfer index <elasticsearch-rebuild>`
fr: :ref:`Reconstituer l’index d’AIP ou de transfert <elasticsearch-rebuild>`
pt_br: :ref:`Reconstruir AIP ou índice de transferência <elasticsearch-rebuild>`

source: :ref:`Data backup <data-backup>`
fr: :ref:`Sauvegarder les données <data-backup>`
pt_br: :ref:`Backup de dados <data-backup>`

source: Since version 0.9, Archivematica stores AIP file information, such as METS data, using Elasticsearch. This data can be searched from the Archival Storage area of the dashboard or can be interfaced with programmatically.
fr: Depuis la version 0.9, Archivematica conserve les données concernant les fichiers AIP, par exemple les données METS, grâce à Elasticsearch. On peut effectuer une recherche dans ces données à partir de la zone Dossier de stockage des archives du Tableau de bord, ou bien programmer un mode d'accès.
pt_br: Desde a versão 0.9, o Archivematica armazena informações sobre o arquivo AIP, como dados do METS, usando o Elasticsearch. Esses dados podem ser pesquisados ​​na área Arquivo de armazenamento no painel ou podem ser conectados de forma programática.

source: **Connecting to Elasticsearch**
fr: **Se connecter à Elasticsearch**
pt_br: **Conectando-se ao Elasticsearch**

source: In this section we'll run through an example of interfacing with Elasticsearch data using a Python script that leverages the pyes library.
fr: Cette partie explore un exemple d'interaction avec les données d'Elasticsearch grâce à un script Python écrit à l'aide de la bibliothèque pyes.
pt_br: Nesta seção, veremos um exemplo de interface com os dados do Elasticsearch usando um script Python que aproveita a biblioteca pyes.

source: The first step, when using pyes, is to require the module. The following code imports pyes functionality on a system on which Archivematica is installed.
fr: La première étape, lorsqu'on utilise pyes, est de quérir le module. Le code qui suit permet d'importer les fonctionnalités de pyes dans un système où Archivematica est installé.
pt_br: O primeiro passo, quando se utiliza pyes, é requerer o módulo. O código a seguir importa a funcionalidade pyes em um sistema no qual o Archivematica está instalado.

source: Next you'll want to create a connection to Elasticsearch.
fr: Ensuite, il faut établir la connexion avec Elasticsearch.
pt_br: Em seguida, você desejará criar uma conexão com o Elasticsearch.

source: **Full text searching**
fr: **Recherche plein texte**
pt_br: **Pesquisa de texto completa**

source: Once connected to Elasticsearch, you can perform searches. Below is the code needed to do a "wildcard" search for all AIP files indexed by Elasticsearch and retrieve the first 20 items. Instead of doing a "wildcard" search you could also supply keywords, such as a certain AIP UUID.
fr: Une fois connecté à Elasticsearch, on peut lancer des recherches. Voici le code qui permet de faire une recherche "générique" dans tous les fichiers AIP indexés par Elasticsearch et faire ressortir les 20 premiers résultats. Il est également possible de lancer une recherche par mot clé, par exemple l'UUID d'un AIP.
pt_br: Uma vez conectado ao Elasticsearch, você pode realizar pesquisas. Abaixo está o código necessário para fazer uma busca "curinga" para todos os arquivos AIP indexados pelo Elasticsearch e recuperar os primeiros 20 itens. Em vez de fazer uma pesquisa "curinga", você também pode fornecer palavras-chave, como um certo AIP UUID.

source: **Querying for specific data**
fr: **Lancer une requête de données spécifiques**
pt_br: **Consultando por dados específicos**

source: While the "StringQuery" query type is good for broad searches, you may want to narrow a search down to a specific field of data to reduce false positives. Below is an example of searching documents, using "TermQuery", matching criteria within specific data. As, by default, Elasticsearch stores term values in lowercase the term value searched for must also be lowercase.
fr: Le type de requête « StringQuery » convient bien aux recherches générales, mais « TermQuery » convient mieux pour limiter la recherche à un champ particulier et réduire les faux positifs. Par défaut, Elasticsearch conserve, les termes de recherche en minuscules; il faut donc veiller à saisir les termes de recherche en minuscules également.
pt_br: Embora o tipo de consulta "StringQuery" seja bom para pesquisas gerais, convém restringir uma pesquisa a um campo específico de dados para reduzir os falsos positivos. Abaixo está um exemplo de pesquisa de documentos, usando "TermQuery", critérios de correspondência dentro de dados específicos. Como, por padrão, o Elasticsearch armazena valores de termos em letras minúsculas, o valor do termo procurado também deve ser minúsculo.

source: **Displaying search results**
fr: **Afficher les résultats d’une recherche**
pt_br: **Exibindo resultados da pesquisa**

source: Now that you've performed a couple of searches, you can display some results. The below logic cycles through each hit in a results set, representing an AIP file, and prints the UUID of the AIP the file belongs in, the Elasticsearch document ID corresponding to the indexed file data, and the path of the file within the AIP.
fr: Une fois les requêtes lancées, on peut en afficher les résultats. La logique qui suit passe en revue chaque résultat au sein d’un groupe (représentant un fichier AIP), et imprime l’UUID de l’AIP auquel il appartient, le numéro (ID) de document dans Elasticsearch correspondant aux données indexées et le chemin d'accès qui mène au fichier dans l’AIP.
pt_br: Agora que você realizou algumas pesquisas, é possível exibir alguns resultados. A lógica abaixo percorre cada ocorrência em um conjunto de resultados, representando um arquivo AIP, e imprime o UUID do AIP em que o arquivo pertence, o ID do documento Elasticsearch correspondente aos dados do arquivo indexado e o caminho do arquivo dentro do AIP.

source: **Fetching specific documents**
fr: **Récupérer des documents spécifiques**
pt_br: **Buscando documentos específicos**

source: If you want to get Elasticsearch data for a specific AIP file, you can use the Elasticsearch document ID. The above code populates the document_ids array and the below code uses this data, retrieving individual documents and extracting a specific item of data from each document.
fr: Pour trouver un fichier AIP particulier dans Elasticsearch, on peut utiliser le numéro de document (ID) Elasticsearch. Le code ci-dessus produit les numéros de documents document_ids, et le code ci-dessous utilise ces données pour extraire des documents ou des données spécifiques contenues dans chaque document.
pt_br: Se você deseja obter dados do Elasticsearch para um arquivo AIP específico, é possível usar o ID do documento do Elasticsearch. O código acima preenche a matriz document_ids e o código abaixo usa esses dados, recuperando documentos individuais e extraindo um item específico de dados de cada documento.

source: **Augmenting documents**
fr: **Augmenter un document**
pt_br: **Aumentando documentos**

source: To add additional data to an Elasticsearch document, you'll need the document ID. The following code shows an Elasticsearch query being used to find a document and update it with additional data. Note that the name of the data field being added, "__public", is prefixed with two underscores. This practice prevents the accidental overwriting of system or Archivematica-specific data. System data is prefixed with a single underscore.
fr: Pour ajouter des données (augmenter) à un document Elasticsearch, le numéro de document (ID) est requis. Le code qui suit montre une requête dans Elasticsearch visant à extraire un document et à y ajouter des données. N. B. Le nom du champ de données à ajouter est précédé de deux tirets de soulignement : « __public ». Cela évite d’effacer accidentellement des données du système ou d’Archivematica. Les données du système sont précédées d’un seul tiret de soulignement.
pt_br: Para inserir dados adicionais a um documento do Elasticsearch, você precisará do ID do documento. O código a seguir mostra uma consulta do Elasticsearch sendo usada para localizar um documento e atualizá-lo com dados adicionais. Observe que o nome do campo de dados que está sendo adicionado, "__public", é prefixado com dois sublinhados. Essa prática evita a substituição acidental de dados específicos do sistema ou do Archivematica. Os dados do sistema são prefixados com um único sublinhado.

source: Elasticsearch Head will allow you to delete an index, if need be.
fr: Elasticsearch Head permet de supprimer un index, au besoin.
pt_br: O Elasticsearch Head permitirá que você apague um índice, se necessário.

source: Delete Elasticsearch index programmatically
fr: Programmer la suppression d’index dans Elasticsearch
pt_br: Excluir o índice do Elasticsearch programaticamente

source: If, for whatever reason, you need to delete an Elasticsearch index programmatically, this can be done with pyes using the following code.
fr: Pour programmer l’opération de suppression d’un index, on peut saisir le code pyes suivant :
pt_br: Se, por qualquer motivo, você precisar excluir um índice Elasticsearch programaticamente, isso pode ser feito com pyes usando o código a seguir.

source: Rebuilding the AIP index
fr: Reconstituer l’index d’un AIP
pt_br: Reconstruindo o índice AIP

source: To rebuild the Elasticsearch AIP index enter the following to find the location of the rebuilding script:
fr: Pour reconstituer l’index d’un AIP dans Elasticsearch, saisir le code suivant pour localiser le script de reconstitution :
pt_br: Para reconstruir o índice Elasticsearch AIP, digite o seguinte para localizar o local do script de reconstrução:

source: Copy the location of the script then enter the following to perform the rebuild (substituting "/your/script/location/rebuild-elasticsearch-aip-index- from-files" with the location of the script):
fr: Copier l’adresse du script voulu et saisir le code suivant pour procéder à la reconstitution (en remplaçant « /your/script/location/rebuild-elasticsearch-aip-index- from-files » par l’adresse du fichier concerné).
pt_br: Copie a localização do script e insira o seguinte para executar a reconstrução (substituindo "/your/script/location/reconstruir-elasticsearch-aip-index-from-files" com a localização do script):

source: Rebuilding the transfer index
fr: Reconstituer l’index d’un transfert
pt_br: Reconstruindo o índice de transferência

source: Similarly, to rebuild the Elasticsearch transfer data index enter the following to find the location of the rebuilding script:
fr: De même, pour reconstituer l’index de données d’un transfert dans Elasticsearch, saisir le code suivant pour localiser le script de reconstitution :
pt_br: Da mesma forma, para reconstruir o índice de dados de transferência do Elasticsearch, digite o seguinte para localizar o local do script de reconstrução:

source: Copy the location of the script then enter the following to perform the rebuild (substituting "/your/script/location/rebuild-elasticsearch-transfer- index-from-files" with the location of the script):
fr: Copier l’adresse du script voulu et saisir le code suivant pour procéder à la reconstitution (en remplaçant "/your/script/location/rebuild-elasticsearch-transfer- index-from-files" par l’adresse du fichier concerné) :
pt_br: Copie a localização do script e insira o seguinte para executar a reconstrução (substituindo "/your/script/location/rebuild-elasticsearch-transfer- index-from-files" com a localização do script):

source: Data back-up
fr: Sauvegarde de données
pt_br: Backup de dados

source: In Archivematica there are three types of data you'll likely want to back up:
fr: Dans Archivematica, on recommande de sauvegarder les trois types de données suivantes :
pt_br: No Archivematica, existem três tipos de dados que você provavelmente deseja fazer backup:

source: Filesystem (particularly your storage directories)
fr: Filesystem (en particulier les répertoires de stockage)
pt_br: Sistema de arquivos (particularmente seus diretórios de armazenamento)

source: MySQL is used to store short-term processing data. You can back up the MySQL database by using the following command:
fr: MySQL sert à entreposer à court terme les données de traitement. On peut sauvegarder la base de données MySQL en utilisant le code de commande suivant :
pt_br: O MySQL é usado para armazenar dados de processamento de curto prazo. Você pode fazer backup do banco de dados MySQL usando o seguinte comando:

source: How to restart the Archivematica services
fr: Comment redémarrer les services Archivematica
pt_br: Como reiniciar os serviços do Archivematica

source: **Restart all services**
fr: **Relancer tous les services**
pt_br: **Reinicie todos os serviços**

source: Note that the default action is to restart all services. To see other available parameters, type:
fr: Notez que l'action par défaut consiste à redémarrer tous les services. Pour voir les autres paramètres disponibles, tapez :
pt_br: Observe que a ação padrão é reiniciar todos os serviços. Para ver outros parâmetros disponíveis, digite:

source: **Stopping**
fr: **Arrêter**
pt_br: **Parando**

source: **Starting**
fr: **Démarrer**
pt_br: **Iniciando**

source: Error stack trace
fr: Retracer une séquence d’erreurs
pt_br: Rastreio de pilha de erros

source: "I am getting a white error page in the Dashboard. How can I find out what the error is?"
fr: « Mon Tableau de bord affiche une page d’erreur vide. Comment localiser le problème? »
pt_br: "Estou recebendo uma página de erro branca no Painel. Como posso descobrir qual é o erro?"

source: Seeing an full error stack trace for the Dashboard requires knowing how to edit a configuration file from the command line.
fr: Pour retracer une séquence d’erreur dans le Tableau de bord, il est nécessaire de savoir comment modifier un fichier de configuration à partir de la ligne de commande.
pt_br: Vendo um rastreamento de pilha de erro completo para o Painel requer saber como editar um arquivo de configuração a partir da linha de comando.

source: SSH to the Archivematica server
fr: Connexion SSH au serveur Archivematica
pt_br: SSH para o servidor Archivematica

source: With your preferred text editor, open the dashboard settings file (vim shown in example; Note that you must use sudo to edit this file):
fr: Dans votre logiciel de traitement de texte, ouvrez le fichier des paramètres du Tableau de bord (ici l’exemple montre le vim; utiliser sudo pour modifier le fichier).
pt_br: Com o seu editor de texto preferido, abra o arquivo de configurações do painel (vim mostrado no exemplo; Note que você deve usar o sudo para editar este arquivo):

source: Change the "DEBUG" flag from "False" to "True"
fr: Activer l’attribut « DEBUG » en remplaçant la valeur « False » par « True »
pt_br: Alterar o sinalizador "DEBUG" de "False" para "True"

source: Save the fileservices
fr: Sauvegarder le fileservices
pt_br: Salve os serviços de arquivos

source: Restart Apache
fr: Redémarrer Apache.
pt_br: Reinicie o Apache

source: Reload the dashboard page reporting the error in your browse
fr: Rafraîchir la page de séquence d’erreur du Tableau de bord dans le navigateur.
pt_br: Recarregue a página do painel informando o erro em sua pesquisa

source: Debug or report error
fr: Déboguer ou signaler l'erreur
pt_br: Depurar ou relatar erro

source: Restore DEBUG to False and restart Apache to turn error reporting off again
fr: Désactiver l’attribut « DEBUG » (« false ») et relancer Apache pour désactiver les rapports d’erreur.
pt_br: Restaure DEBUG para False e reinicie o Apache para desativar o relatório de erros novamente

source: :ref:`Back to the top <maintenance>`
fr: :ref:`Retour en haut de page <maintenance>`
pt_br: :ref:`Voltar ao topo <maintenance>`
