Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/admin-manual/installation/customization.po
Languages: fr

source: Customization and automation
fr: Personnalisation et automatisation

source: Some workflow and processing decisions can be made or viewed in the dashboard and others are created at the development level.
fr: Certains processus et décisions de traitement peuvent être réalisés ou visualusés à partir du tableau de bord, d'autres sont crées au niveau développement

source: Resources for dashboard configuration
fr: Ressources pour la configuration du tableau de bord

source: The Preservation Planning tab allows editing or addition of commands for identification, tools, characterization, event detail, extraction, normalization, transcription, validation and verification. Please see the :ref:`Format Policy Registry (FPR) documentation <fpr:index>` for instruction.
fr: L'onglet Planification de la préservation permet de modifier ou d'ajouter des commandes d'authentification, outils, caractérisation , détail d'évenement, extraction, normalisation, transcription, validation et vérification. Voir la :ref:`documentation du Registre de politiques de format (FPR) <fpr:index>` pour consulter les instructions.

source: Basic workflow configuration is feasible by administrators or end-users in the :ref:`Administration tab <dashboard-admin>` of the dashboard.
fr: La configuration de base des flux des opérations est réalisable par les administrateurs ou les utilisateurs finaux sous l':ref:`onglet Administration <dashboard-admin>` du tableau de bord.

source: Resources for development configuration
fr: Ressources pour la configuration du développement

source: When processing a SIP or transfer, you may automate workflow choices by putting a ``processingMCP.xml`` file into the root directory of a SIP/transfer. See :ref:`Processing configuration <process-config>`.
fr: Lors du traitement d'un SIP ou un transfert, vous pouvez automatiser les choix de processus en mettant un fichier "processingMCP.xml" dans le repertoire principal du SIP/transfert. Voir :ref:'Configuration du traitement<process-config>'.

source: The MCP is the core of the Archivematica system. It controls the various micro-services in the Archivematica system. Developers who wish to modify the MCP configuration should consult the following resources on the Archivematica wiki:
fr: Le MCP est le noyau du système Archivematica. Il controle les divers microservices dans le système Archivematica. Les developpeurs qui voudraient modifier la configuration du MCP doivent consulter les ressources suivantes sur le wiki d'Archivematica :

source: For other development resources, please see the `Development <https://www.archivematica.org/wiki/Development>`_ section of our wiki.
fr: Pour d'autres ressources de developpement, voir la 'section_Developpement<https://www.archivematica.org/wiki/Development>' de notre wiki.

source: :ref:`Back to the top <customization>`
fr: :ref:`Retour en haut de page <customization>`
