Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/admin-manual/installation/dashboard-config.po
Languages: fr

source: Dashboard administration tab
fr: Onglet Administration du tableau de bord

source: The Archivematica administration pages, under the Administration tab of the dashboard, allow you to configure application components and manage users.
fr: Les pages d'administration d'Archivematica, sous l'onglet Administration du tableau de bord, vous permet de configurer les composantes de l'application et de gérer les utilisateurs.

source: *On this page:*
fr: *Sur cette page:*

source: :ref:`Processing configuration <process-config>`
fr: :ref:`Configuration du traitement <process-config>`

source: :ref:`General <admin-dashboard-general>`
fr: :ref:`Général <admin-dashboard-general>`

source: :ref:`Failures <admin-dashboard-failures>`
fr: :ref:`Échecs <admin-dashboard-failures>`

source: :ref:`Transfer source locations <admin-dashboard-transfer-source>`
fr: :ref:`Emplacements du transfert source <admin-dashboard-transfer-source>`

source: :ref:`AIP storage locations <admin-dashboard-AIP-stor>`
fr: :ref:`Emplacements de stockage d’AIP <admin-dashboard-AIP-stor>`

source: :ref:`AtoM DIP upload <admin-dashboard-atom>`
fr: :ref:`Téléchargement DIP via AtoM <admin-dashboard-atom>`

source: :ref:`ArchivesSpace DIP upload <admin-dashboard-AS>`
fr: :ref:`Téléchargement DIP via ArchivesSpace <admin-dashboard-AS>`

source: :ref:`Archivists Toolkit DIP upload <admin-dashboard-AT>`
fr: :ref:`Téléchargement DIP via Archivists Toolkit <admin-dashboard-AT>`

source: :ref:`PREMIS agent <admin-dashboard-premis>`
fr: :ref:`Agent PREMIS <admin-dashboard-premis>`

source: :ref:`Users <admin-dashboard-users>`
fr: :ref:`Utilisateurs <admin-dashboard-users>`

source: Processing configuration
fr: Configuration du traitement

source: The XML file format is:
fr: Le format de fichier XML est:

source: For the approval (yes/no) steps, the user ticks the box on the left-hand side to make a choice. If the box is not ticked, the approval step will appear in the dashboard.
fr: Pour les étapes requérant une approbation (oui/non), l'utilisateur devra faire son choix en cochant la case qui se trouve à gauche. Si la case n'est pas cochée, l'étape d'approbation apparaitra sur le tableau de bord.

source: For the other steps, if no actions are selected the choices appear in the dashboard
fr: Si aucune action n'est sélectionnée pour les autres étapes, les options se retrouveront sur le tableau de bord.

source: Specific processing configurations available on this page are:
fr: Les configurations spécifiques au traitement pouvant se trouver sur cette page sont :

source: Select whether or not to send transfers to quarantine (yes/no) and decide how long you'd like them to stay there (below).
fr: Décidez si les transferts doivent être envoyés ou non en quarantaine (oui/non) et définissez combien de temps ils doivent y rester (voir ci-dessous).

source: Approve normalization, sending the AIP to storage, and uploading the DIP without interrupting the workflow in the dashboard.
fr: Approuvez la normalisation, entreposez les AIP et téléchargez les DIP sans suspendre le déroulement des opérations dans le tableau de bord.

source: Store the AIP without interrupting the workflow in the dashboard.
fr: Entreposez les AIP sans suspendre le déroulement des opérations dans le tableau de bord.

source: Select whether or not Archivematica should transcribe files.
fr: Indiquez si Archivematica devrait transcrire les fichiers ou non.

source: Select whether or not Archivematica should generate a transfer structure report (see :ref:`Process the transfer <process-transfer>`)
fr: Indiquez si Archivematica devrait générer un rapport de structure de transfert ou non (voir ::ref:`Process the transfer <process-transfer>`)

source: Select if Archivematica should create one SIP from the transfer and continue processing or send the transfer to backlog.
fr: Indiquez si Archivematica doit créer un SIP à partir du transfert et poursuivre le traitement, ou acheminer le transfert au backlog.

source: Select Normalization options (see :ref:`Normalize <normalize>`).
fr: Sélectionnez les options de Normalisaton (see :ref:`Normalize <normalize>`).

source: Select whether or not Archivematica should remind you to add metadata at the appropriate point during ingest.
fr: Sélectionnez si Archivematica devrait ou non vous rappeler d'ajouter les métadonnées au bon moment durant l'ingestion.

source: Select whether or not to Examine contents.
fr: Déterminez si le contenu devrait être examiné ou non.

source: Select whether packages should be deleted after extraction.
fr: Indiquez si les paquets devraient être supprimés après l'extraction.

source: Select compression levels:
fr: Sélectionnez les niveaux de compression:

source: 1 - fastest mode
fr: 1 - mode le plus rapide

source: 3 - fast compression mode
fr: 3 - mode de compression rapide

source: 5 - normal compression mode
fr: 5 - mode de compression normal

source: 7 - maximum compression
fr: 7 - compression maximum

source: 9 - ultra compression
fr: 9 - compression ultra

source: Select one archival storage location where you will consistently send your AIPs and DIPs (if you are storing DIPs rather than sending them immediately to an access system.)
fr: Sélectionner un emplacement d'entreposage d'archives où vous allez régulièrement envoyer vos AIPs et vos DIPs (si vous entreposez les DIPs au lieu de les envoyer immédiatement à un système d'accè.)

source: General
fr: Général

source: In the general configuration section, you can select interface options and set Storage Service options for your Archivematica client.
fr: Dans la section de configuration générale, vous pouvez sélectionner les options de l'interface et configurer les options de service d'entreposage pour votre client Archivematica.

source: General configuration options in Administration tab of the dashboard
fr: Options de configuration générales sous l'onglet Administration du tableau de bord

source: **Interface options**
fr: **Options pour l'interface**

source: Here, you can hide parts of the interface that you don't need to use. In particular, you can hide CONTENTdm DIP upload link, AtoM DIP upload link and DSpace transfer type.
fr: Ici, vous pouvez masquer les parties de l’interface que vous n’utilisez pas, notamment CONTENTdm DIP upload link, AtoM DIP upload link et DSpace transfer type.

source: **Storage Service options**
fr: **Options du service d'entreposage**

source: This is where you'll find the complete URL for the Storage Service. See :ref:`Storage Service <storageService:administrators>` for more information about this feature.
fr: C'est ici que se trouve l'URL complet pour le service d'entreposage. Voir :ref:`Storage Service <storageService:administrators> pour plus d'informations au sujet de cette fonctionnalité.

source: Failures
fr: Échecs

source: This page displays packages that failed during processing.
fr: Cette page affiche les paquets qui ont échoué durant le traitement.

source: Failures report in the dashboard
fr: Rapport d'échec sur le tableau de bord

source: Clicking the date, name or UUID will display a report of the failure:
fr: Cliquez sur Date, Nom ou UUID pour afficher un rapport d'échec :

source: The Failure report can be removed from the Dashboard by clicking Delete.
fr: Le rapport d'échec peut être retiré du tableau de bord en sélectionnant Supprimer.

source: Transfer source location
fr: Emplacement du transfert source

source: Archivematica allows you to start transfers using the operating system's file browser or via a web interface. Source files for transfers, however, cannot be uploaded using the web interface; they must exist on volumes accessible to the Archivematica MCP server and configured via the Storage Service.
fr: Archivematica vous permet de démarrer des transferts en utilisant le navigateur de fichiers du système d'exploitation ou bien via une interface Web. Les fichiers sources pour les transferts, cependant, ne peuvent pas être téléchargés à l'aide de l'interface Web; Ils doivent exister sur des volumes accessibles au serveur Archivematica MCP et configurés via le Service de stockage.

source: When starting a transfer you are required to select one or more directories of files to add to the transfer.
fr: Lorsque vous démarrez un transfert, vous devez sélectionner un ou plusieurs répertoires de fichiers à ajouter au transfert.

source: AIP storage locations
fr: Emplacements de stockage AIP

source: AIP storage directories are directories in which completed AIPs are stored. Storage directories can be specified in a manner similar to transfer source directories using the Storage Service.
fr: Les répertoires de stockage AIP sont des répertoires dans lesquels les AIP complétés sont stockés. Les répertoires de stockage peuvent être spécifiés d’une manière similaire aux répertoires de transfert source en utilisant le Service de stockage.

source: You can view your transfer source directories in the Administrative tab of the dashboard under "AIP storage locations".
fr: Vous pouvez visualiser vos répertoires sources de transfert dans l’onglet Administration du tableau de bord sous « Emplacements de stockage d’AIP ».

source: AtoM DIP upload
fr: Téléchargement DIP via AtoM

source: Archivematica can upload DIPs directly to an AtoM website so the contents can be accessed online. The AtoM DIP upload configuration page is where you specify the details of the AtoM installation you'd like the DIPs uploaded to (and, if using Rsync to transfer the DIP files, Rsync transfer details).
fr: Archivematica peut charger les DIPs directement à un site web AtoM pour que les contenus soient accessibles en ligne. La page de configuration pour le chargement d'un DIP AtoM est l'endroit où vous spécifiez les détails d'installation d'AtoM que vous voulez pour les DIPs chargés (et, si vous utilisez Rsync pour transférer les fichiers DIP, Rsync transfère les détails).

source: The parameters that you'll most likely want to set are url, email, and password. These parameters, respectively, specify the destination AtoM website's URL, the email address used to log in to the website, and the password used to log in to the website.
fr: Les paramètres que vous voudrez probablement définir sont url, courriel et mot de passe. Ces paramètres spécifient respectivement l'adresse URL du site de destination AtoM, l'adresse de courriel utilisée pour se connecter au site Web et le mot de passe utilisé pour se connecter au site Web.

source: AtoM DIP upload can also use Rsync as a transfer mechanism. Rsync is an open source utility for efficiently transferring files. The rsync-target parameter is used to specify an Rsync-style target host/directory pairing, ``foobar.com:~/dips/`` for example. The rsync-command parameter is used to specify rsync connection options, ``ssh -p 22222 -l user`` for example. If you are using the rsync option, please see AtoM server configuration below.
fr: Le chargement d'un DIP AtoM peut aussi utiliser Rsync comme méchanisme de transfert. Rsync est un utilitaire en libre accès pour transférer les fichiers de manière efficace. Le paramétre rsync-target est utilisé pour spécifier un couplage serveur/repertoire Rsync-style cible,"foobar.com:~/dips/" par exemple. Le paramétre rsync-command est utilisé pour spécifier les options de connection, "ssh -p 22222 -I user" par exemple. Si vous utilisez l'option rsync, s'il vous plait, voir configuration de serveur AtoM ci-dessous.

source: To set any parameters for AtoM DIP upload change the values, preserving the existing format they're specified in, in the ``Command arguments`` field then click "Save".
fr: Pour la mise en place de n'importe quels paramères de chargement d'un DIP AtoM changez les valeurs, tout en gardant le format existant dans lequel elles sont spécifiées, dans le champ "Commande arguments" ensuite appuyez sur "sauvgarder"

source: AtoM server configuration
fr: Configuration du serveur AtoM

source: Generic parameters:
fr: Paramètres généraux:

source: ArchivesSpace DIP upload
fr: Téléchargement DIP via ArchivesSpace

source: Before ingesting digital objects destined for ArchivesSpace, ensure that the Achivists' Toolkit DIP upload settings in the administration tab of the dashboard have been set.
fr: Avant d’intégrer les objets numériques destinés au ArchivesSpace, il faut régler les paramètres Téléchargement DIP via Archivists Toolkit dans l’onglet Administration du tableau de bord.

source: These settings should be created and saved before digital objects destined for upload to ArchivesSpace are processed. Note that these can be set once and used for processing any number of transfers (i.e. they do not need to be re-set for each transfer).
fr: Il faut créer et sauvegarder ces paramètres avant de traiter les objets numériques qui seront téléchargés dans ArchivesSpace. Il suffit de le faire une seule fois. Vous pourrez les utiliser pour tous vos transferts (c.-à-d. que vous n’avez pas à les régler de nouveau pour chaque transfert).

source: Include the IP address of the host database (ArchivesSpace host), the database port (ArchivesSpace backend port), an ArchivesSpace administrative username, and the ArchivesSpace administrative user password.
fr: Insérez l’adresse IP de la base de données hôte (ArchivesSpace host), le port de la base de données (ArchivesSpace backend port), un nom d’utilisateur administratif ArchivesSpace, et le mot de passe de l’utilisateur administratif ArchivesSpace.

source: Restrictions Apply: Selecting *Yes* will apply a blanket access restriction to all content uploaded from Archivematica to ArchivesSpace. Selecting *No* will send all content to ArchivesSpace without restrictions. Should you wish to enable the PREMIS-based restrictions functionality, choose "base on PREMIS" under "Restrictions Apply". To add PREMIS rights, please see :ref:`Add PREMIS rights and restrictions <at-premis>`.
fr: Appliquer des restrictions : Si vous sélectionnez *Oui*, une restriction d’accès générale s’appliquera à tout le contenu téléchargé d’Archivematica à ArchivesSpace. Si vous sélectionnez *Non*, tout le contenu sera acheminé à ArchivesSpace sans restriction. Si vous désirez activer la fonctionnalité de restrictions de type PREMIS, sélectionnez « Basé sur PREMIS » sous « Appliquer des restrictions ». Pour ajouter des privilèges PREMIS, reportez-vous à :ref:`Ajouter des privilèges et restrictions PREMIS <at-premis>`.

source: ArchivesSpace repository number: Insert the identifier for the ArchivesSpace repository to which you would like to upload DIPs here. Note that the default identifier for a single-repository ArchivesSpace instance is **2**.
fr: Numéro du dépôt ArchivesSpace : Insérez l’identificateur du dépôt ArchivesSpace vers lequel vous désirez télécharger les DIP. À noter que l’identificateur par défaut d’un seul dépôt ArchivesSpace est **2**.

source: In order to save changes to the ArchivesSpace DIP upload configuration, you must enter the password before clicking save. Note that Archivematica will *not* show you an error if the password is not entered.
fr: Pour sauvegarder les changements apportés à la configuration Téléchargement DIP via ArchivesSpace, vous devez saisir le mot de passe avant de cliquer sur le bouton sauvegarder. À noter qu’Archivematica n’affiche pas de message d’erreur, si le mot de passe n’est pas saisi.

source: Archivists Toolkit DIP upload
fr: Téléchargement DIP via Archivists Toolkit

source: Before ingesting digital objects destined for Archivists' Toolkit, ensure that the Achivists' Toolkit DIP upload settings in the administration tab of the dashboard have been set.
fr: Avant d’intégrer les objets numériques destinés au Archivists’ Toolkit, il faut régler les paramètres Téléchargement DIP via Archivists Toolkit dans l’onglet Administration du tableau de bord.

source: These settings should be created and saved before digital objects destined for upload to Archivists Toolkit are processed. Note that these can be set once and used for processing any number of transfers (i.e. they do not need to be re-set for each transfer). The screenshots below show the template in the dashboard.
fr: Il faut créer et sauvegarder ces paramètres avant de traiter les objets numériques qui seront téléchargés dans Archivists Toolkit. Il suffit de le faire une seule fois. Vous pourrez les utiliser pour tous vos transferts (c.-à-d. que vous n’avez pas à les régler de nouveau pour chaque transfert). Les prises d’écran qui suivent illustrent le gabarit du tableau de bord.

source: Include the IP address of the host database (db host), the database port (db port), the database name (db name), the database user (db user), and the Archivists' Toolkit user name (at username).
fr: Insérez l’adresse IP de la base de données hôte (db host), le port de la base de données (db port), le nom de la base de données (db name), l’utilisateur de la base de données (db user) et le nom d’utilisateur d’Archivists’ Toolkit (at username).

source: Should you wish to enable the PREMIS-based restrictions functionality, choose "base on PREMIS" under "Restrictions Apply". To add PREMIS rights, please see :ref:`Add PREMIS rights and restrictions <at-premis>`.
fr: Si vous désirez activer la fonctionnalité de restrictions de type PREMIS, sélectionnez « Basé sur PREMIS » sous « Appliquer des restrictions ». Pour ajouter des privilèges PREMIS, reportez-vous à :ref:`Ajouter des privilèges et restrictions PREMIS <at-premis>`.

source: PREMIS agent
fr: Agent PREMIS

source: The PREMIS agent name and code can be set here via the administration interface.
fr: Le nom et le code de l'agent PREMIS peuvent être réglés à l’aide de l’interface d’administration.

source: API keys
fr: Clés API

source: Click "Save"
fr: Cliquez sur "Sauvegarder"

source: IP whitelist
fr: Liste blanche d'IP

source: Approving a transfer
fr: Approuver un transfert

source: **Parameters**:
fr: **Paramètres** :

source: ``directory``: directory name of the transfer
fr: ``directory`` : nom de répertoire du transfert

source: ``api_key``: an API key
fr: ``api_key`` : une clé API

source: Example curl command:
fr: Exemple de commande curl :

source: Example result:
fr: Exemple de résultat :

source: Listing unapproved transfers
fr: Faire une liste des transferts non approuvés

source: **Method**: ``GET``
fr: **Méthode** : ``GET``

source: Users
fr: Utilisateurs

source: The dashboard provides a simple cookie-based user authentication system using the `Django authentication framework <https://docs.djangoproject.com/en/1.4/topics/auth/>`_. Access to the dashboard is limited only to logged-in users and a login page will be shown when the user is not recognized. If the application can't find any user in the database, the user creation page will be shown instead, allowing the creation of an administrator account.
fr: Le tableau de bord offre un système simple d’authentification d’utilisateurs basé sur des témoins à l’aide du `Django authentication framework <https://docs.djangoproject.com/en/1.4/topics/auth/>`_. L’accès au tableau de bord est réservé aux utilisateurs qui ont ouvert une session. Une page d’accès s’affichera si l’utilisateur n’est pas reconnu. Si l’application ne trouve pas d’utilisateurs dans la base de données, la page de création d’utilisateurs s’affichera, pour que vous puissiez créer un compte d’administrateur.

source: Users can be also created, modified and deleted from the Administration tab. Only users who are administrators can create and edit user accounts.
fr: Les utilisateurs peuvent également être créés, modifiés et supprimés à partir de l'onglet Administration. Seuls les utilisateurs qui sont des administrateurs peuvent créer et modifier des comptes d'utilisateurs.

source: You can add a new user to the system by clicking the "Add new" button on the user administration page. By adding a user you provide a way to access Archivematica using a username/password combination. Should you need to change a user's username or password, you can do so by clicking the "Edit" button, corresponding to the user, on the administration page. Should you need to revoke a user's access, you can click the corresponding "Delete" button.
fr: Vous pouvez ajouter un nouvel utilisateur dans le système en cliquant sur le bouton « Ajouter » de la page d’administration des utilisateurs. Lorsque vous ajoutez un utilisateur, vous fournissez l’accès à Archivematica au moyen d’un nom d’utilisateur/mot de passe. Si vous devez modifier l’un ou l’autre de ces paramètres, vous pouvez le faire en cliquant sur le bouton « Modifier » correspondant à l’utilisateur en question, sur la page d’administration. Pour révoquer l’accès d’un utilisateur, vous cliquez alors sur le bouton « Supprimer » correspondant.

source: If you need an additional administrator user one can be created via the command-line, issue the following commands:
fr: Si vous avez besoin d'un compte administrateur supplémentaire, vous pouvez en créer un via la ligne de commande en exécutant les commandes suivantes :

source: CLI password resetting
fr: Réinitialisation de mot de passe via CLI (Interface en ligne de commande)

source: If you've forgotten the password for your administrator user, or any other user, you can change it via the command-line:
fr: Si vous avez oublié le mot de passe de votre administrateur ou de tout autre utilisateur, vous pouvez le modifier via la ligne de commande:

source: Security
fr: Sécurité

source: :ref:`Back to the top <dashboard-config>`
fr: :ref:`Retour en haut de page <dashboard-config>`
