Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/user-manual/ingest/ingest.po
Languages: fr

source: Ingest
fr: Acquisition

source: During ingest, digital objects are packaged into SIPs and run through several micro-services, including normalization, packaging into an AIP and generation of a DIP.
fr: Durant l’acquisition, les objets numériques sont intégrés dans les SIP et traités dans divers microservices, y compris la normalisation, l’intégration dans un AIP et la création d’un DIP.

source: If you would like to skip some of the default decision points or make preconfigured choices for your desired workflow, see :ref:`User administration - Processing configuration <dashboard-processing>`.
fr: Si vous désirez sauter certains points de décisions par défaut ou effectuer des choix préconfigurés pour votre flux de travail, consultez :ref:`Administration des utilisateurs - Configuration de traitement <dashboard-processing>`.

source: Should you run into an error during ingest, please see :ref:`Error handling <error-handling>`.
fr: Si une erreur se produit durant l’acquisition, consultez :ref:`Gestion des erreurs <error-handling>`.

source: *On this page:*
fr: *Sur cette page :*

source: :ref:`Create a SIP <create-sip>`
fr: :ref:`Créer un SIP <create-sip>`

source: :ref:`Arrange a SIP from backlog <arrange-sip>`
fr: :ref:`Classer un SIP à partir du backlog <arrange-sip>`

source: :ref:`Arrange a SIP for AtoM <hierarchical-dip>`
fr: :ref:`Classer un SIP pour AtoM <hierarchical-dip>`

source: :ref:`Add metadata <add-metadata>`
fr: :ref:`Ajouter des métadonnées <add-metadata>`

source: :ref:`Add PREMIS rights <add-rights>`
fr: :ref:`Ajouter des privilèges PREMIS <add-rights>`

source: :ref:`Normalize <normalize>`
fr: :ref:`Normaliser <normalize>`

source: :ref:`Transcribe SIP contents <transcribe-contents>`
fr: :ref:`Transcrire le contenu du SIP <transcribe-contents>`

source: :ref:`Store AIP <store-aip>`
fr: :ref:`Stocker l’AIP <store-aip>`

source: :ref:`Upload DIP <upload-dip>`
fr: :ref:`Télécharger le DIP <upload-dip>`

source: :ref:`Reingest AIP <reingest>`
fr: :ref:`Réacquistion de l’AIP <reingest>`

source: Create a SIP
fr: Créer un SIP

source: Process transfers as described in :ref:`Transfers <transfer>`. If you selected "Create single SIP and continue processing" on the Transfer tab, your SIP has been created and Archivematica will begin running Ingest tasks. Click on the Ingest tab to continue working with your SIP.
fr: Traitez les transferts tel que décrit dans :ref:`Transferts <transfer>`. Si vous avez sélectionné « Créer un seul SIP et poursuivre le traitement » dans l’onglet Transfert, votre SIP a été créé et Archivematica lancera les tâches d’Acquisition. Cliquez sur l’onglet Acquisition pour continuer à travailler avec votre SIP.

source: The single SIP will move through a number of micro-services. If you have preconfigured Archivematica to do so, processing will stop at a decision point that allows you to choose a file identification method to base normalization upon or to choose to use pre-existing data gathered during identification at the transfer stage. Archivematica default is to use pre-existing data. For more about this option, see :ref:`Administer — Processing configuration <dashboard-processing>`.
fr: Le SIP subira plusieurs microservices. Si vous avez préconfiguré Archivematica ainsi, le traitement arrêtera à un point de décision permettant de choisir une méthode d’identification de fichier pour la normalisation ou d’utiliser des données existantes recueillies au moment de l’identification à l’étape du transfert. Le paramètre par défaut d’Archivematica est l’utilisation de données existantes. Pour en savoir plus sur cette option, consultez :ref:`Administrer — Configuration de traitement <dashboard-processing>`.

source: Once the SIP reaches "Normalize", you will be given several options for how Archivematica should normalize the SIP. Choose the option most suitable for your workflow.
fr: Lorsque le SIP arrive à l’étape « Normaliser », vous pourrez sélectionner la méthode de normalisation privilégiée pour le SIP. Sélectionnez celle qui convient le mieux à votre flux de travail.

source: Normalization micro-service
fr: Microservice de normalisation

source: To add descriptive metadata, see :ref:`Add metadata <add-metadata>`, below.
fr: Pour ajouter des métadonnées descriptives, reportez-vous à la section :ref:`Ajouter des métadonnées <add-metadata>` ci-dessous.

source: To add PREMIS rights information, see :ref:`Add PREMIS rights <add-rights>`, below.
fr: Pour ajouter de l’information sur les privilèges PREMIS, reportez-vous à la section :ref:`Ajouter des privilèges PREMIS <add-rights>` ci-dessous.

source: For selecting a normalization option, see :ref:`Normalization <normalize>`, below.
fr: Pour sélectionner une option de normalisation, reportez-vous à la section :ref:`Normalisation <normalize>` ci-dessous.

source: Arrange a SIP from backlog
fr: Classer un SIP à partir du backlog

source: This section refers to the backlog arrangement feature on the ingest page, rather than the Backlog tab. For more information on the Backlog tab, see :ref:`Backlog <backlog>`.
fr: Cette section porte sur la fonctionnalité de classement du backlog de la page d’acquisition, plutôt que sur l’onglet Backlog. Pour en savoir plus sur l’onglet Backlog, consultez :ref:`Backlog <backlog>`.

source: Select content from the backlog by either searching for it through the backlog search bars at the top of the Ingest tab or by browsing the backlog by clicking on the folder icons in the *Originals* pane. Note: Multi-item select is not yet included in this feature, though entire folders/directories can be moved.
fr: Sélectionnez le contenu du backlog en le cherchant à l’aide des champs de recherche figurant en haut de l’onglet Acquisition ou en explorant le backlog et en cliquant sur les icônes de dossiers du volet *Originaux*. Remarque : Vous ne pouvez pas sélectionner plusieurs éléments ici, mais vous pouvez déplacer des dossiers/répertoires complets.

source: Transfer backlog search results in populating Originals pane
fr: Transférer les résultats de la recherche du backlog dans le volet Originaux

source: Archivematica will display the directories available in Transfer backlog, including the number of objects in each directory. To hide directories from the Originals pane, click on the directory and click Hide.
fr: Archivematica affichera les répertoires disponibles dans le backlog Transfert, y compris le nombre d’objets qui se trouve dans chacun des répertoires. Pour masquer les répertoires du volet Originaux, cliquez sur le répertoire et ensuite sur Masquer.

source: Drag and drop the transfer directory(ies) and/or object(s) you wish to arrange from the Originals pane to the Arrange pane. By dragging and dropping, you can create an arrangement structure for your SIP. Note that all metadata, submission documentation, and other associated data is also copied to the arrange pane with your object(s). A copy also remains with anything you leave in the Originals pane. These files are hidden because they cannot be arranged independently of the objects to which they relate.
fr: Glissez-déplacez les répertoires et/ou les objets du transfert à classer du volet Originaux au volet Classer. En glissant-déplaçant, vous pouvez créer une structure de classement pour votre SIP. À noter que toutes les métadonnées, la documentation de soumission et les autres données correspondantes sont également copiées dans le volet Classement avec vos objets. Une copie est conservée avec tout ce qui reste dans le volet Originaux. Ces fichiers sont masqués parce qu’ils ne peuvent pas être classés dans les objets correspondants.

source: Drag and drop from Originals pane to Arrange pane
fr: Glisser-déplacer du volet Originaux au volet Classer

source: In the above example, the Project.zip directory was dragged from the Originals pane to the Arrange pane. Note that the Project.zip directory in the Originals pane has been greyed out to indicate that the file has been added to a potential SIP.
fr: Dans l’exemple ci-dessus, le répertoire Project.zip a été glissé du volet Originaux au volet Classer. À noter que le répertoire Project.zip du volet Originaux est en gris pour signaler que le fichier a été ajouté comme SIP potentiel.

source: Click on the directory in the Arrange pane to select, and then click Create SIP. Archivematica will confirm that you wish to create a SIP from the selected objects and then proceed through the ingest micro-services.
fr: Cliquez sur le répertoire du volet Classer pour le sélectionner et ensuite sur Créer un SIP. Archivematica confirmera que vous désirez bien créer un SIP à partir des objets sélectionnés et passera ensuite aux microservices d’acquisition.

source: To arrange your SIP, create one or more directories in the Arrange pane by clicking *Add Directory*. You can create directories nested inside of each other. Note: You cannot rename a directory once you have created it; you must delete it and create a directory with a new name.
fr: Pour classer votre SIP, créez un ou plusieurs répertoires dans le volet Classer en cliquant sur *Ajouter un répertoire*. Vous pouvez créer des répertoires imbriqués les uns dans les autres. Remarque : Vous ne pouvez pas renommer un répertoire après l’avoir créé. Vous devez le supprimer et en créer un nouveau en lui donnant un nouveau nom.

source: Create a new directory in Arrange pane
fr: Créer un nouveau répertoire dans le volet Classer

source: Click and drag files from the Originals pane into your desired directory in the arrange panel. You can move either individual files or entire directories. Note: All files must be in a directory inside of Arrange. “Arrange” cannot be used as the top directory.
fr: Cliquez-déplacez les fichiers du volet Originaux dans le répertoire ciblé du volet Classer. Vous pouvez déplacer des fichiers individuels ou des répertoires complets. Tous les fichiers doivent se trouver dans un répertoire Classer. Vous ne pouvez pas utiliser « Classer » comme répertoire principal.

source: When you have completed moving files and directories into the Arrange pane, select your desired top-level directory - this is the directory that will become your SIP. Click on Create SIP. Any files or directories which are not inside the directory you choose will remain in the Arrange pane until you create a SIP that includes these files and directories.
fr: Lorsque vous avez fini de déplacer les fichiers et les répertoires dans le volet Classer, sélectionnez le répertoire principal : c’est ce répertoire qui deviendra votre SIP. Cliquez sur Créer un SIP. Les fichiers ou répertoires qui ne sont pas dans le répertoire que vous sélectionnez, demeureront dans le volet Classer jusqu’à ce que vous ayez créé un SIP qui les contienne.

source: Create a new SIP by clicking on a directory within Arrange pane
fr: Créer un nouveau SIP en cliquant sur un répertoire du volet Classer

source: Archivematica will confirm that you wish to create a SIP and, after receiving confirmation, will proceed to the Ingest microservices.
fr: Archivematica confirmera que vous désirez créer un SIP et, après la confirmation, passera aux microservices d’Acquisition.

source: Arranging a SIP for AtoM
fr: Classer un SIP pour AtoM

source: If you plan to create a DIP to :ref:`Upload to AtoM <upload-atom>`, you may wish to add levels of description to your directories and/or objects. Archivematica will add a logical structMAP to the METS file, which AtoM will use to create information objects, applying the chosen levels of description. Note that if you do not apply a level of description to a digital object, AtoM will automatically assign it the level of "item".
fr: Si vous prévoyez créer un DIP pour :ref:`Télécharger dans AtoM <upload-atom>`, il serait peut-être utile d’ajouter des niveaux de description à vos répertoires et/ou objets. Archivematica ajoutera une structMAP logique au fichier METS, qu’AtoM utilisera pour créer des objets d’information, en appliquant vos niveaux de description. À noter que si un objet numérique n’est pas assorti d’un niveau de description, AtoM lui attribuera automatiquement le niveau « élément ».

source: This functionality is supported with AtoM 2.2 and higher.
fr: Cette fonctionnalité fonctionne avec les versions AtoM 2.2 et plus récentes.

source: Select a directory or object in the Arrange pane. Click *Edit metadata* to choose the level of description.
fr: Sélectionnez un répertoire ou un objet dans le volet Classer. Cliquez sur *Modifier les métadonnées* pour sélectionner le niveau de description.

source: As you add levels of description they will be shown in the arrange pane for you to review before finalizing your SIP.
fr: Au fur et à mesure que vous ajoutez des niveaux de description, ils apparaîtront dans le volet Classer pour que vous puissiez les examiner avant de finaliser votre SIP.

source: To have the AtoM levels of description appear you must have entered your AtoM credentials in Administration. See :ref:`Administer, AtoM DIP upload <dashboard-atom>`. Levels of description in AtoM are managed as a taxonomy. To edit, see :ref:`Terms <atom:terms>`.
fr: Pour que les niveaux de description d’AtoM soient affichés, vous devez avoir saisi vos authentifiants AtoM dans Administration. Voir :ref:`Administrer, Télécharger un DIP <dashboard-atom>` dans AtoM. Dans AtoM, les niveaux de description sont gérés comme taxonomie. Pour modifier, voir :ref:`Conditions <atom:terms>`.

source: If you choose not to assign levels of description to directories in SIP arrange, AtoM will flatten the DIP so that all digital objects are child-level descriptions of the target description.
fr: Si vous décidez de ne pas attribuer de niveaux de description aux répertoires dans Classer le SIP, AtoM écrasera le DIP de manière à ce que tous les objets numériques soient des descriptions de niveau inférieur de la description cible.

source: Add metadata
fr: Ajouter des métadonnées

source: In Archivematica, metadata can be added either prior to the normalization step or after. Archivematica will prompt you with a reminder to add metadata if desired during the Process metadata directory micro-service. See :ref:`AtoM Dublin Core <atom:dc-template>` for information about the Dublin Core elements available.
fr: Dans Archivematica, vous pouvez ajouter des métadonnées avant ou après l’étape de la normalisation. Archivematica vous rappellera d’ajouter des métadonnées, si vous désirez le faire, durant le microservice de traitement du répertoire des métadonnées. Voir :ref:`AtoM Dublin Core <atom:dc-template>` pour en savoir plus sur les éléments du Dublin Core qui sont disponibles.

source: If you are importing lower-level metadata (i.e. metadata to be attached to subdirectories and files within a SIP) see also:
fr: Si vous importez des métadonnées de niveau inférieur (à savoir des métadonnées qui accompagneront des sous-répertoires et des fichiers d’un SIP), consultez aussi :

source: :ref:`Transfer <transfer>`
fr: :ref:`Transfert <transfer>`

source: :ref:`Import metadata <import-metadata>`
fr: :ref:`Importer des métadonnées <import-metadata>`

source: Click on the template icon.
fr: Cliquez sur l’icône de modèle.

source: To add metadata, click on the template icon
fr: Pour ajouter des métadonnées, cliquez sur l’icône de modèle

source: This will take you to the SIP detail panel. Under the Metadata heading, click Add.
fr: Cela vous amènera au panneau de détails du SIP. Dans l’entête Métadonnées, cliquez sur Ajouter.

source: SIP information page
fr: Page d’information du SIP

source: Add metadata as desired and save it by clicking the Create button at the bottom of the screen. Hovering over a field will activate tooltips that define the Dublin Core element and provide a link to `ISO 15836 Dublin Core Metadata Element Set <http://dublincore.org/documents/dces/>`_. Note that you can only add metadata at the aggregate level when using the template - that is, the metadata will be applied to each object in the SIP. If you would like to add metadata to a digital object, you must :ref:`Import metadata via CSV <import-metadata>` or add the metadata once the object has been uploaded to your access system.
fr: Ajouter les métadonnées et sauvegardez-les en cliquant sur le bouton Créer au bas de l’écran. Lorsque vous survolez un champ, des infobulles sont activées : elles définissent l’élément du Dublin Core et fournissent un lien vers `ISO 15836 Dublin Core Metadata Element Set <http://dublincore.org/documents/dces/>`_. À noter que vous ne pouvez ajouter des métadonnées qu’au niveau global à l’aide du modèle – les métadonnées seront appliquées à chaque objet du SIP. Si vous désirez ajouter des métadonnées à un objet numérique, vous devez Importer des métadonnées au moyen d’un CSV ou les ajouter lorsque l’objet a été téléchargé dans votre système d’accès.

source: SIP metadata entry form
fr: Formulaire de saisie de métadonnées du SIP

source: When you click Create, you will see the metadata entry in the list page. To edit it further, click Edit on the right-hand side. To delete it, click Delete. To add more DC metadata, click the Add button below the list.
fr: Lorsque vous cliquez sur Créer, vous verrez la saisie de métadonnées dans la page de liste. Pour la modifier davantage, cliquez sur Modifier à droite. Pour supprimer, cliquez sur Supprimer. Pour ajouter d’autres métadonnées DC, cliquez sur le bouton Ajouter, sous la liste.

source: SIP metadata list
fr: Liste de métadonnées du SIP

source: Return to the ingest tab to continue processing the SIP.
fr: Retournez à l’onglet Acquisition afin de poursuivre le traitement du SIP.

source: Add PREMIS rights
fr: Ajouter des privilèges PREMIS

source: To add rights, click on the template icon
fr: Cliquez sur l’icône de modèle.

source: This will take you to the SIP detail panel. On the left-hand side, under Rights, click Add.
fr: Cela vous mènera au panneau de détails du SIP. À gauche, sous Privilèges, cliquez sur Ajouter.

source: SIP detail panel
fr: Panneau de détails du SIP

source: Add rights as desired and save it by clicking the Save button at the bottom of the screen, or clicking Next if you are finished and ready to move on to the second page of data entry. Rights entries are made up of two pages of content.
fr: Ajoutez les privilèges et sauvegardez-les en cliquant sur le bouton Sauvegarder en bas de l’écran, ou en cliquant sur le bouton Suivant si vous avez terminé, et désirez passer à la seconde page de saisie de données. Les enregistrements de privilèges comportent deux pages de contenu.

source: SIP rights template- first page
fr: Modèle de privilèges SIP - première page

source: To get to the second page to complete data entry, click Next. Note that you can only add rights at the SIP level. If you would like to add rights to an individual digital object, you will need to do that once the object has been uploaded to your access system.
fr: Pour accéder à la seconde page pour terminer la saisie des données, cliquez sur Suivant. À noter que vous ne pouvez ajouter des privilèges qu’au niveau du SIP. Si vous désirez ajouter des privilèges à un objet numérique donné, vous devrez le faire après avoir téléchargé l’objet dans votre système d’accès.

source: SIP rights template- second page
fr: Modèle de privilèges du SIP – seconde page

source: When you click Save on the second page, you will be given the option to add another act with its associated grants and/or restrictions.
fr: Lorsque vous cliquez sur Sauvegarder à la seconde page, vous pourrez alors ajouter une autre action et ses autorisations et/ou restrictions.

source: Repeatable acts in rights template
fr: Actions répétitives du modèle des privilèges

source: If you have finished adding acts, click Done. You will see the rights entry in the list page . To edit it further, click Edit on the right-hand side.
fr: Si vous avez fini d’ajouter des Actions, cliquez sur Terminé. Vous pourrez voir l’enregistrement des privilèges sur la page de liste. Pour modifier davantage, cliquez sur Modifier à droite.

source: SIP detail panel with rights
fr: Panneau de détails du SIP avec privilèges

source: Normalize
fr: Normaliser

source: Selecting a normalization option
fr: Sélectionner une option de normalisation

source: Once normalization is completed you can review the results in the normalization report. Click on the report icon next to the Actions drop-down menu.
fr: Lorsque la normalisation est terminée, vous pouvez examiner les résultats dans le Rapport de normalisation. Cliquez sur l’icône de rapport à côté du menu déroulant Actions.

source: Click on the report icon to open the normalization report
fr: Cliquez sur l’icône de rapport pour ouvrir le rapport de normalisation

source: The report shows what has been normalized and what is already in an acceptable preservation and access format:
fr: Le rapport indique ce qui a été normalisé et ce qui est déjà dans un format de préservation et d’accès acceptable :

source: You may review the normalization results in a new tab by clicking on Review. If your browser has plug-ins to view a file, you may open it in another tab by clicking on it. If you click on a file and your browser cannot open it, it will download locally so you can view it using the appropriate software on your machine.
fr: Pour examiner les résultats de la normalisation dans un nouvel onglet, cliquez sur Examiner. Si votre navigateur est doté de plugiciels pour visualiser un fichier, vous pouvez l’ouvrir dans un autre onglet en cliquant dessus. Si vous cliquez sur un fichier et que votre navigateur ne peut l’ouvrir, le fichier sera téléchargé localement pour que vous puissiez l’examiner à l’aide d’un logiciel installé sur votre machine.

source: Review normalization results in new tab
fr: Examiner les résultats de la normalisation dans un nouvel onglet

source: Approve normalization in the Actions drop-down menu to continue processing the SIP. You may also Reject the SIP or re-do normalization. If you see errors in normalization, follow the instructions in Error handling to learn more about the problem.
fr: Approuvez la normalisation dans le menu déroulant Actions afin de poursuivre le traitement du SIP. Vous pouvez aussi Rejeter le SIP ou refaire la normalisation. Si des erreurs se sont glissées dans la normalisation, suivez les instructions de la section Gestion des erreurs pour régler le problème.

source: :ref:`Manual normalization <manual-norm>`
fr: :ref:`Normalisation manuelle <manual-norm>`

source: Transcribe SIP contents
fr: Transcrire le contenu du SIP

source: Archivematica gives users the option to Transcribe SIP contents using `Tesseract <https://code.google.com/p/tesseract-ocr/>`_ OCR tool. If Yes is selected by the user during this micro-service, an OCR file will be included in the DIP and stored in the AIP.
fr: Archivematica permet aux utilisateurs de Transcrire le contenu du SIP à l’aide de l’outil ROC `Tesseract <https://code.google.com/p/tesseract-ocr/>`_. Si l’utilisateur sélectionne Oui durant ce microservice, un fichier ROC sera inséré dans le DIP et stocké dans l’AIP.

source: This feature is designed to transcribe the text from single images (e.g. individual pages of a book scanned as image files). It does not support transcription of multi-page objects or word processing files, PDF files, etc.
fr: Cette fonctionnalité est conçue de manière à transcrire le texte à partir d’images uniques (p. ex., pages individuelles d’un livre numérisé comme fichiers d’images). Elle ne prend pas en charge la transcription d’objets multiples ou de fichiers de traitement de texte, de fichiers PDF, etc.

source: Store AIP
fr: Stocker l’AIP
