Repository: R-Khera/archivematica-docs
Catalog: locale/*/LC_MESSAGES/user-manual/ingest/ingest.po
Languages: fr

source: After normalization is approved, the SIP runs through a number of micro-services, including processing of the submission documentation, generation of the METS file, indexing, generation of the DIP and packaging of the AIP.
fr: Lorsque la normalisation a été approuvée, le SIP subit plusieurs microservices, à savoir le traitement de la documentation de soumission, la création du fichier METS, l’indexation, la production du DIP et le montage de l’AIP.

source: Archivematica ready to store the AIP and upload the DIP
fr: Archivematica est prêt à stocker l’AIP et à télécharger le DIP

source: If desired, review the contents of the AIP in another tab by clicking on Review. More information on Archivematica's AIP structure and the METS/PREMIS file is available in the Archivematica documentation: see :ref:`AIP structure <aip-structure>`. You can download the AIP at this stage by clicking on it.
fr: Si vous le désirez, examinez le contenu de l’AIP dans un autre onglet en cliquant sur Examiner. Pour en savoir plus sur la structure de l’AIP et le fichier METS/PREMIS d’Archivematica, consultez la documentation Archivematica : voir :ref:`Structure de l’AIP <aip-structure>`. Vous pouvez maintenant télécharger l’AIP en cliquant dessus.

source: From the Action dropdown menu, select "Store AIP" to move the AIP into archival storage. You can store an AIP in any number of preconfigured directories. For instructions to configure AIP storage locations, see :ref:`Administrator manual - Storage Service <storageService:administrators>`.
fr: Dans le menu déroulant Action, sélectionnez « Stocker l’AIP » pour archiver l’AIP. Vous pouvez stocker l’AIP dans divers répertoires préconfigurés. Pour en savoir plus sur la configuration des emplacements de stockage d’AIP, voir le :ref:`Manuel de l’administrateur - Service de stockage <storageService:administrators>`.

source: From the Action dropdown menu, select the AIP storage location from the pre-configured set of options.
fr: Dans le menu déroulant Actions, sélectionnez l’emplacement de stockage de l’AIP dans les options proposées.

source: We recommend storing the AIP before uploading the DIP. If there is a problem with the AIP at this point and the DIP has already been uploaded, you will have to delete the DIP from the upload location.
fr: Il est recommandé de stocker l’AIP avant de télécharger le DIP. Si vous éprouvez des problèmes avec l’AIP et que le DIP a déjà été téléchargé, vous devrez supprimer le DIP de l’emplacement de téléchargement.

source: For information on viewing and managing stored AIPs go to :ref:`Archival storage <archival-storage>`.
fr: Pour en savoir plus sur la visualisation et la gestion des AIP stockés, consultez :ref:`Archivage <archival-storage>`.

source: Upload DIP
fr: Télécharger le DIP

source: Archivematica supports DIP uploads to AtoM, ArchivesSpace, CONTENTdm and Archivists' Toolkit. For information about uploading DIPs to your access system, see :ref:`Access <access>`.
fr: Archivematica prend en charge le téléchargement de DIP vers AtoM, ArchivesSpace, CONTENTdm et Archivists’ Toolkit. Pour en savoir plus sur la manière de télécharger les DIP dans votre système d’accès, consultez :ref:`Accès <access>`.

source: Re-ingest AIP
fr: Réacquistion de l’AIP

source: There are three different types of AIP re-ingest:
fr: Il existe trois types différents de réacquisition d'AIP :

source: 1. Metadata only
fr: 1. Métadonnées seulement

source: This method is for adding or updating descriptive and/or rights metadata. Doing so will update the dmdSec of the AIP's METS file. Note that the original metadata will still be present but if you scroll down you'll also see another dmdSec that says STATUS="updated", like so:
fr: Cette méthode permet d'ajouter ou de mettre à jour des métadonnées de descriptions et/ou de privilèges. Ce faisant, le fichier dmdSec du fichier METS de l'AIP sera mis à jour. Notez que les métadonnées d'origine seront toujours présentes mais si vous faites défiler vers le bas, vous verrez également un autre fichier dmdSec identifié comme étant mis à jour (i.e. STATUS = "updated"), comme ceci:

source: Choosing metadata only AIP re-ingest will take you back to the Ingest tab.
fr: En choisissant de faire la réacquisition des métadonnées seulement , le système vous ramènera à l'onglet Acquisition.

source: 2. Partial re-ingest
fr: 2. Réacquisition partielle

source: This method is typically used by institutions who want to create a DIP sometime after they've made an AIP. They can then send their DIP to their access system or store it.
fr: Cette méthode est généralement utilisée par les institutions qui souhaitent créer un DIP après avoir créé un AIP. Ils peuvent ainsi envoyer leur DIP à leur système d'accès ou le stocker.

source: Choosing partial re-ingest will take you back to the Ingest tab.
fr: En choisissant de faire une réacquisition partielle , le système vous ramènera à l'onglet Acquisition.

source: 3. Full re-ingest
fr: 3. Réacquisition intégrale

source: This method is for institutions who want to be able to run all the major micro-services (including re-normalization for preservation if desired). A possible use case for full re-ingest might be that after a time new file characterization or validation tools have been developed and integrated with a future version of Archivematica. Running the micro-services with these updated tools will result in a updated and better AIP.
fr: Cette méthode est utilisée par les institutions qui veulent être en mesure de gérer tous les microservices principaux (y compris la renormalisation aux fins de préservation, au besoin). La réacquisition intégrale pourrait, par exemple, être utilisée après le développement et l’intégration de nouveaux outils de caractérisation ou de validation de fichier dans une version future d’Archivematica. L'exécution des microservices avec ces outils mis à jour se traduirait alors par un AIP amélioré.

source: Full re-ingest can also be used to update the metadata, and re-normalize for access.
fr: Vous pouvez effectuer une réacquisition intégrale afin d’actualiser les métadonnées et de renormaliser aux fins d’accès.

source: When performing full re-ingest, you will need to enter the name of the processing configuration you wish to use. To add new processing configurations, see :ref:`Processing configuration <dashboard-processing>`.
fr: Lorsque vous effectuez une réacquisition intégrale, vous devez saisir le nom de la configuration de traitement à utiliser. Pour ajouter de nouvelles configurations de traitement, reportez-vous à :ref:`Configuration de traitement <dashboard-processing>`.

source: The following workflows are **not** supported in full AIP re-ingest:
fr: Les flux de travail suivants **ne sont pas** pris en charge pour la réacquisition intégrale de l’AIP :

source: Examine contents if not performed on first ingest
fr: Examiner le contenu si cela n’a pas été fait au moment de l’acquisition initiale

source: Transfer structure report if not performed on first ingest
fr: Transfert du rapport de structure si cela n’a pas été fait au moment de l’acquisition initiale

source: Extract packages in the AIP and then delete them
fr: Extraire des paquets de l’AIP et les supprimer par la suite

source: Send AIP to backlog for re-arrangement during re-ingest
fr: Acheminer l’AIP au backlog pour reclassement durant la réacquisition

source: Choosing full re-ingest will take you back to the Transfer tab.
fr: En choisissant de faire une réacquisition intégrale , le système vous ramènera à l'onglet Transfert.

source: How to tell in the METS file if an AIP has been re-ingested
fr: Comment vérifier le fichier METS pour voir si un AIP a subi une réacquisition

source: 1. Look at the Header of the METS file, which will display a ``CREATEDATE`` and a ``LASTMODDATE``: ``<mets:metsHdr CREATEDATE="2017-10-17T20:29:21" LASTMODDATE="2017-10-17T20:32:36"/>``
fr: 1. Regardez l'en-tête du fichier METS, qui affichera la date de création `CREATEDATE`` et la date de la dernière modification ``LASTMODDATE`` : ``<mets:metsHdr CREATEDATE="2017-10-17T20:29:21" LASTMODDATE="2017-10-17T20:32:36"/>``

source: 2. You can also search for the reingest premis:event ``<premis:eventType>reingestion</premis:eventType>``
fr: 2. Vous pouvez également rechercher le premis:event qui a été réacquis ``<premis:eventType>reingestion</premis:eventType>``

source: 3. If you've updated the descriptive or rights metadata you will find an updated dmdSec
fr: 3. Si vous avez mis à jour les métadonnées de descriptions ou de privilèges, vous trouverez un fichier dmdSec révisé.

source: Where to start the re-ingest process
fr: Où commencer le processus de réacquisition

source: You can start the re-ingest process through the Archival Storage tab on the Dashboard, the Storage Service, or the API.
fr: Vous pouvez démarrer le processus de réacquisition via l'onglet Dossier de stockage des archives du Tableau de bord, le Service de stockage ou l'API.

source: Archival Storage tab on the Dashboard
fr: Onglet Dossier de stockage des archives du Tableau de bord

source: 1. Click on the name of the AIP or View to open that AIP's view page. Under Actions, click on Re-ingest.
fr: 1. Cliquez sur le nom de l’AIP ou sur Visualiser pour ouvrir la page de visualisation de l’AIP. Sous Actions, cliquer sur Réacquisition.

source: Choose the type of re-ingest (metadata, partial or full).
fr: Choisir le type de réacquisition (métadonnées, partielle ou intégrale).

source: Click on Re-ingest. Archivematica will tell you that the AIP has been sent to the pipeline for re-ingest.
fr: Cliquez sur Réacquisition. Archivematica vous informera que l’AIP a été acheminé au pipeline aux fins de réacquisition.

source: If you attempt to re-ingest an AIP which is already in the process of being re-ingested in the pipeline, Archivematica will alert you with an error.
fr: Si vous tentez de faire la réacquisition d’un AIP qui se trouve déjà dans le pipeline pour réacquisition, Archivematica affichera un message d’erreur.

source: Archivematica will appear to allow you to extract and then delete packages. However, the resulting AIP will still actually contain the packages, and in the METS file they will not have re-ingestion events correctly associated with them. This is documented as a bug here: https://projects.artefactual.com/issues/10699
fr: Archivematica semblera vous permettre d'extraire puis de supprimer les paquets. L’AIP correspondant contiendra toutefois les paquets, et dans le fichier METS, ils ne seront pas associés correctement aux événements de réacquisition. Ceci est documenté comme bogue ici : https://projects.artefactual.com/issues/10699

source: Proceed to the Transfer or Ingest tab and approve the AIP re-ingest.
fr: Allez à l’onglet Transfert ou Acquisition et approuvez la réacquisition de l’AIP.

source: At the Normalization micro-service you will make different choices depending on the type of AIP re-ingest you've selected.
fr: Une fois rendu à l'étape du microservice de normalisation, vous devrez faire différents choix selon le type de réacquisition d'AIP sélectionné.

source: **Metadata-only re-ingest**
fr: **Réacquisition des métadonnées seulement**

source: Add or update your metadata *before* you approve Normalization to ensure the metadata is written to the database, which means it will be written to the AIP METS file. There are two ways to add or update metadata:
fr: Ajouter ou mettez à jour les métadonnées *avant* d'approuver la normalisation pour vous assurer de l'enregistrement des métadonnées dans la base de données avant la préparation de l’AIP METS. Il existe deux façons d'ajouter ou de mettre à jour les métadonnées :

source: Add metadata directly into Archivematica
fr: Ajouter des métadonnées directement dans Archivematica

source: Click on the paper and pencil icon on the same line as the name of the SIP to take you to the "Add metadata" page.
fr: Cliquez sur l'icône du papier et crayon sur la même ligne que le nom du SIP pour accéder à la page "Ajouter des métadonnées".

source: Click "Add" under "Rights" if you have rights-related metadata to add.
fr: Cliquez sur "Ajouter", situé sous "Privilèges", si vous avez des métadonnées de privilèges à ajouter.

source: Click on "Add" under "Metadata" if you have descriptive metadata to add.
fr: Cliquez sur "Ajouter", situé sous "Métadonnées", si vous avez des métadonnées descriptives à ajouter.

source: Enter your metadata.
fr: Tapez vos métadonnées.

source: Click on "Ingest" (top left corner) to go back to the Ingest tab when you're done.
fr: Cliquez sur "Réacquisition" (en haut à gauche) pour revenir à l'onglet Réacquisition lorsque vous avez terminé.

source: Click on the metadata report icon on the same line as the name of the SIP to take you to the "Add metadata" page.
fr: Cliquez sur l'icône de rapport sur la même ligne que le nom du SIP pour accéder à la page "Ajouter des métadonnées".

source: Click on "Add metadata files" under "Metadata"
fr: Cliquez sur "Ajouter des fichiers de métadonnées", situé sous "Métadonnées".

source: Click on "Browse"
fr: Cliquez sur "Naviguer"

source: Select a ``metadata.csv`` file. Note name of the file must be exactly ``metadata.csv`` and the file must follow the structure outlined in :ref:`Import metadata <import-metadata>`. The file must also be staged in the same Transfer Source location that you stage your objects for transfer to Archivematica.
fr: Sélectionnez un fichier ``metadata.csv``. Notez que le nom du fichier doit littéralement se nommer ``metadata.csv`` et le fichier doit suivre la structure décrite dans :ref:`Importer les métadonnées <import-metadata>`. Le fichier doit également être situé dans le même Emplacement du transfert source que vous avez utilisé pour vos objets lors du transfert vers Archivematica.

source: Select "Do not normalize" when you have finished adding your metadata.
fr: Sélectionnez "Ne pas normaliser" lorsque vous avez terminé d'ajouter vos métadonnées.

source: Continue processing the SIP as normal.
fr: Continuez le traitement du SIP comme d’habitude.

source: When performing a metadata-only re-ingest, there will be no objects in your AIP in the review stage- Archivematica replaces the METS file in the existing AIP upon storage.
fr: Lorsque vous effectuez une réacquisition de métadonnées seulement, il n’y aura pas d’objets à l’étape de l’examen dans votre AIP - Archivematica remplace le fichier METS de l’AIP existant au moment du stockage.

source: **Partial re-ingest**
fr: **Réacquisition partielle**

source: Add metadata if desired. See **Metadata-only re-ingest** for instructions
fr: Au besoin, ajouter des métadonnées. Pour obtenir les instructions, consulter **Réacquisition des métadonnées seulement**.

source: Select "Normalize for access".
fr: Sélectionnez « Normaliser aux fins d’accès ».

source: **Full re-ingest**
fr: **Réacquisition intégrale**

source: Add metadata if desired. See **Metadata-only re-ingest** for instructions.
fr: Au besoin, ajouter des métadonnées. Pour obtenir les instructions, consulter **Réacquisition des métadonnées seulement**

source: Select the normalization path of your choosing.
fr: Sélectionnez la voie de normalisation désirée.

source: All normalization options will appear as for any SIP being normalized, but when performing metadata only or partial re-ingest, **only** the normalization paths noted above are supported.
fr: Toutes les options de normalisation seront affichées pour les SIP normalisés. Mais pour les métadonnées seulement ou la réacquisition partielle, **seules** les voies de normalisation ci-haut sont prises en charge.

source: You can add or update the metadata either before or after Normalization, but to ensure the metadata is written to the database before the AIP METS is prepared, it is recommended practice to add the metadata before Normalization, or set the metadata reminder to unchecked in Processing Configuration.
fr: Vous pouvez ajouter des métadonnées ou les mettre à jour avant ou après la Normalisation. Mais pour veiller à ce que les métadonnées soient enregistrées dans la base de données avant la préparation de l’AIP METS, il est recommandé d’ajouter les métadonnées avant la Normalisation ou de ne pas cocher le rappel de métadonnées dans la Configuration de traitement.

source: Storage Service
fr: Service de stockage

source: From the Packages tab in the Storage Service, click on Re-ingest beside the AIP you wish to reingest.
fr: Dans l’onglet Paquets du Service de stockage, cliquez sur Réacquisition à côté de l’AIP donné.

source: The Storage Service will ask you to choose a pipeline, the types of reingest (see above for thorough descriptions of each), and for full re-ingest, the name of the processing configuration.
fr: Le Service de stockage vous invitera à sélectionner un pipeline, les types de réacquisition (voir ci-dessus pour des descriptions détaillées), et pour une réacquisition intégrale, le nom de la configuration de traitement.

source: The Storage Service will confirm that the AIP has been sent to the pipeline for reingest. Proceed to the Transfer or Ingest tab of your pipeline, and follow steps 3-6 above.
fr: Le Service de stockage confirmera que l’AIP a été acheminé au pipeline aux fins de réacquisition. Allez à l’onglet Transfert ou Acquisition de votre pipeline, et suivez les étapes 3 à 6 ci-dessus.

source: Documentation to come.
fr: Documentation à venir.

source: :ref:`Back to the top <ingest>`
fr: :ref:`Retour en haut de page <ingest>`
